{
	"SO-01": {
		"text": "<p>Knock knock knock! \"Mail call, open up.\"</p><p>You open the door to find a grumpy Quatryl With a low-riding sack of mail. She tosses a lumpy package wrapped in cord to you. \"No name, but this address. It's yours now!\"</p><p>As she walks away she snaps her fingers, remembering something. \"Oh, right. This too.\" She hands over a letter addressed to you. As she wanders off toward a drink, you rip the letter open to read a note scrawled in excellent cursive:</p><p class=\"ms-4\">\"Please do not open the package.<br/>We will retrieve it.<br/>—Leonidas and Maximus\"</p>",
		"options": {
			"A": {
				"trigger": "Open the package.",
				"text": "<p>You tear open the edge of the package, just to get a peek. The closer you look, the less there is to see... it's empty. Sometime later a pair of Aesthers dressed in drab yellow arrive at your door.</p><p>\"Hello mercenaries. We are Leonidas—\"<br/>\"—and Maximus. We have come for our package.\"</p><p>You feign confusion and they return the sentiment.</p><p>\"Oh. Perhaps we have come too early—\"<br/>\"—or too late. We will return.\"</p>",
				"rewards": {
					"events": {
						"SO": [{ "id": "SO-40" }]
					}
				}
			},
			"B": {
				"trigger": "Respect the request.",
				"text": "<p>Against all the curiosity in your being, you refrain from opening the lumpy package. A short while later two Aesthers dressed in drab yellow arrive at your door.</p><p>\"Hello mercenaries. We are Leonidas—\"<br/>\"—and Maximus. We have come for our package.\"</p><p>You hand it over, and they tear open the top, reaching much too deep inside to be obeying the laws of the universe. Out comes a large black diamond.</p><p>\"The Shadow Gem. We have—\"<br/>\"—your payment, as agreed.\"</p><p>They hand you a sack of coins and then turn and leave, passing the diamond back and forth between them.</p>",
				"rewards": {
					"text": "Gain 30 collective gold."
				}
			}
		}
	},
	"SO-03": {
		"text": "<p>\"Hear ye, hear ye! I am the crier of the Great Dallum, the most powerful seer the world has ever known!\" An ostentatiously dressed man is shouting in the middle of town, drawing a crowd. \"It is my great honor to advise you that the Great Dallum has selected this outpost for his next visitation!\"</p><p>There are audible gasps from the crowd. \"He will arrive in a fortnight! Prepare yourselves and be merry!\"</p><p>As the crier packs up, Frosthaven's citizenry come alive: \"The Great Dallum? Here?\" and \"We'll need to prepare a feast!\" and \"We'll need an offering—I've heard he grants the wishes of those who please him with lavish donations!\"</p><p>Even Mayor Satha looks to be hiding excitement under a façade of civility... this should be an event to remember.</p>",
		"options": {
			"A": {
				"trigger": "Help clean the streets to make a good impression.",
				"text": "<p>You put in the work to clean up the dirt-and-snow-covered streets of Frosthaven. Many of the residents come out to join you, excited. A young lady chats your ear off while sweeping, her face beaming.</p><p>\"I heard from a friend his watery-blue eyes see straight into your soul. He speaks quietly, but he knows your name without asking. He's the most incredible seer the world has ever known!\"</p>",
				"rewards": {
					"text": "Gain 1 morale and 1 inspiration.<br/>Add [section_180.1] to the calendar in two weeks."
				}
			},
			"B": {
				"trigger": "Assist in the preparation of a feast.",
				"text": "<p>You join a hunting party gathering wild meats and harvesting vegetables outside Frosthaven. An older man has more spring in his step as he picks snowthistle to use as a tangy garnish.</p><p>\"He's got rough hands from working the fields before he got the gift of sight. Long, beautiful hair, not bald like me. Never met him, but heard he talks slow—not like me—he wants to make sure you get the attention you deserve. Great man, that Dallum.\"</p>",
				"rewards": {
					"text": "Gain 1 morale.<br/>Gain 1 collective [snowthistle].<br/>Add [section_180.1] to the calendar in two weeks."
				}
			}
		}
	},
	"SO-08": {
		"text": "<p>Regardless of season, Frosthaven and the surrounding environment is covered in a blanket of snow year-round. This week shows that even the most reliable of weather can take a break every now and then: the sun is shining, the air is warm, and the icy paths have melted into mud and stone.</p><p>The outposters are taking advantage of the heatwave by enjoying a splash in the bay. The Quatryl mail-carrier has taken to delivering popsicles made with ice harvested from the shade of the mountainside, and even Mayor Satha has paused her duties to take a running dive off the dock into the still-cold water.</p><p>Only one group is going about as normal: the town guard. Captain Olmstead has demanded the guard be at high alert and double the patrols.</p><p>He barks orders from the harbor tower at the sweating guards on patrol: \"All manner of sea life is just waiting to eat us alive! Be ready for them!\" The fully-armored guards look to be on the verge of collapse in the sweltering heat.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Encourage Captain Olmstead to relax and let the guards enjoy a day off.",
				"requirement": "[trait] PERSUASIVE",
				"text": "It takes the sharp tongue of a mercenary that knows the importance of vigilance, but you convince Captain Olmstead to give the guards a break. No sooner have they stripped off their armor and waded into the water than the attack begins: lightning eels, driven further inland by the heat, start stunning and dragging people under the icy waves. You are forced to rush out and fight off the eels, all while Captain Olmstead glares at you with unadulterated fury.",
				"rewards": {
					"text": "All characters start the next scenario with [damage] 2."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Encourage Captain Olmstead to relax and let the guards enjoy a day off.",
				"requirement": "[not] [trait] PERSUASIVE",
				"text": "Your disregard for safety falls on deaf ears, and Captain Olmstead has you escorted out of the tower. The guards are at least appreciative of your attempt.",
				"rewards": {
					"text": "Read outcome B."
				}
			},
			"B": {
				"trigger": "Safety first. It's good someone is watching out for the relaxing populace.",
				"text": "Screams ring out from the harbor, and Captain Olmstead blows a whistle hanging around his neck. Instantly, two teams of guards push past the outposters wading in the water and start stabbing spears at the icy waves. A red tint creeps through the bay—lightning eels were about to make a quick snack of Frosthaven's populace. Good thing someone was on the lookout... and shockingly enough, the eels make a pretty tasty dinner.",
				"rewards": {
					"text": "Gain 1 morale."
				}
			}
		}
	},
	"SO-09": {
		"text": "<p>\"I'm trying to explain, that's the very root cause of all of this! They're not aggressive by nature!\" Violet, the local Lurker researcher, is pleading on the street with Mayor Satha.</p><p>\"Right. And they have terrifying claws and razor-sharp protrusions because they're peaceful. \"Satha is having none of it. Violet is nervously balling up her purple scarf, clearly on the verge of a breakdown.</p><p>\"Please, you have to understand. My research suggests—\" Satha cuts the Valrath off.</p><p>\"Your research suggests the capital is willing to waste resources. Resources that could be put to use protecting the people of this outpost from those same Lurkers you so desperately want to repaint as benevolent! I'll be confiscating your supplies for the defense effort.\"</p>",
		"options": {
			"A": {
				"trigger": "Come to Violet's aid—there's more to the Lurkers.",
				"text": "<p>You intervene in the heated discussion and provide some reports from the field. Yes, the Lurkers can be an impressive adversary, but there are indications there's more to their actions. Violet is visibly relieved at your help.</p><p>Satha grunts. \"Fine, if you think there's value here, introduce her to the guard. But if her crackpot ideas don't pan out, I'm holding it against you lot.\"</p>",
				"rewards": {
					"events": {
						"WO": [{ "id": "WO-62" }]
					}
				}
			},
			"B": {
				"trigger": "Back up Satha's assessment—Lurker research is a waste of resources.",
				"text": "<p>You can't help but side with Satha under the circumstances: the Lurkers have proven, time and again, to be vicious killing machines with physiology to match. You don't doubt that Violet means well, but if there are resources that could be used to protect the town, it's better for Satha to use them on defense rather than research projects.</p><p>Violet lowers her gaze, then walks off without another word, dejected.</p>",
				"rewards": {
					"events": {
						"SO": [{ "id": "SO-39" }]
					}
				}
			}
		}
	},
	"SO-11": {
		"text": "<p>Pinter Droman, Frosthaven's resident Quatryl tinkerer, is unwrapping a package wrapped in brocade in his workshop.</p><p>\"Come take a look. Can't believe it. One of the guards just dropped this off. Says he found it on the hillside.\" Out from the cloth comes what looks like a long metallic-purple blade. \"Remarkable! Believe it or not, this is an antler from a Brummix. Quatryl settlers brought them here over a century ago, but they all died out. Or so I thought.\"</p><p>\"Watch this!\" He swings a heavy wrench at the antler, snapping it in two pieces.</p><p>\"Alright, let's see if the myths are true...\" He grabs the two halves of the antler and gently touches them together. Like magic, the two pieces fuse back together, looking as perfect as when he first unwrapped the antler. Pinter is grinning from ear to ear.\"</p><p>\"A marvel of nature! Now what should we use it for?\"</p>",
		"options": {
			"A": {
				"trigger": "Use it as a mutable material for crafting.",
				"text": "<p>Pinter fires up the furnace. \"We'll need to get it nice and toasty to melt this beauty!\" Pinter lobs the Brummix antler in. Soon, a purple liquid pours out the side and drains into the mold for three shiny purple bars.</p><p>\"Should be good for just about anything. Take it—just promise me if you ever find that beautiful Brummix, you treat it well. I heard they're crazy for axenuts, if you'd believe it.\"</p>",
				"rewards": {
					"text": "Gain 1 morale.<br/>Gain 3 collective material resources of any kind.<br/>Gain \"Brummix\" campaign sticker."
				}
			},
			"B": {
				"trigger": "Weave it into an art piece.",
				"text": "<p>You return several hours later to find Pinter filing the last edges off a stunning purple necklace. He wipes it with the edge of his shirt sleeve and hands it to you.</p><p>\"You take it. Just promise me, if you ever find that enchanting Brummix, you treat it well. I heard they're crazy for axenuts, if you'd believe it.\"</p>",
				"rewards": {
					"text": "Gain 1 morale.<br/>Gain \"Deathproof Charm\" [item].<br/>Gain \"Brummix\" campaign sticker."
				}
			}
		}
	},
	"SO-12": {
		"text": "<p>An incoming merchant ship tipped the town fishermen off to a dense school of large fish, about an hour's row up the bay. Captain Olmstead asked you to accompany and provide protection to the fishing expedition.</p><p>The merchants were right—after an afternoon in the calm water, the boat was full of enough fish to last the town half of winter. Which is why you're so dismayed when an Abael pops his head out of the water.</p><p>\"Per the Treaty of Deep Bay, these are our fish. Fin them over and leave immediately.\" He glares at you with black, unblinking eyes. You try to explain you've never heard of this treaty, but he cuts you off. \"Your disrespect for those already here and ignorance of our ways is no excuse. Give me the fish or face the consequences.\"</p>",
		"options": {
			"A": {
				"trigger": "You have plenty of enemies already, and it's not worth making more. Besides, you have no idea how many Abaeli are in the water below you.",
				"text": "Even if this treaty is nonsense, it's not worth the risk. You order the fishermen to dump the fish overboard. They grumble, but comply. With a splash, you watch lunch slowly sink into the depths.",
				"rewards": {
					"text": "Lose 1 morale."
				},
				"skipAttack": true
			},
			"B": {
				"trigger": "There's no treaty. This Abael is full of chum and just wants a free lunch. Keep the fish and row back to Frosthaven.",
				"text": "\"You'll regret this! The Treaty has very specific penalties for violations!\" He yells after you, just before disappearing under the waves.",
				"rewards": {
					"text": "No effect."
				}
			}
		},
		"outpostAttack": {
			"attack": 20,
			"target": 3,
			"targetPriority": "Target even-numbered buildings in order of closest to farthest from the docks (players break ties).",
			"text": "With the last of the Abaeli swimming away, you can finally dock. Satha demands to know what happened. At least you brought lunch.",
			"rewards": {
				"text": "Gain 1 morale."
			}
		}
	},
	"SO-13": {
		"text": "<p>A Valrath man comes up to you in the street. \"Say... you spend some time outside the walls, right? Happened to come across any snowthistle?\" He speaks in a low voice, and his hood makes it difficult to make out his face.</p><p>Before you have a chance to respond, a portly woman rushes up with a broom, smacking the Valrath on the back. \"You again?! Leave these people alone!\" The valrath scurries off into an alley without another word. The woman turns to you, her hands on her hips.</p><p>\"Valraths and snowthistle, am I right? For most people it's a garnish, or medicinal. For them—well, they can't get enough of the stuff. Addicts!\" She mumbles to herself as she heads back into her home.</p><p>You continue your walk, but hear the Valrath's voice down the alley. \"So? Have any? I've got coin.\"</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Sell the Valrath some snowthistle (requires [snowthistle]).",
				"requirement": "[trait] VALRATH",
				"text": "The Valrath energetically prepares some of your snowthistle for sharing. Surely, a little bit couldn't hurt—oh, it's evening now. Well, just a bit more for the road—is that the morning sun? The buyer smiles. \"Let me know if you get more. Happy to share.\"",
				"rewards": {
					"text": "Gain 1 morale and 15 collective gold.<br/>Lose all collective [snowthistle]."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Sell the Valrath some snowthistle (requires [snowthistle]).",
				"requirement": "[not] [trait] VALRATH",
				"text": "You hand the Valrath some snowthistle, and he licks his lips. \"Good, nice quality. Happy to put any excess to you have to better use...\"",
				"rewards": {
					"text": "Lose any number of collective [snowthistle].<br/>Gain 5 collective gold for each [snowthistle] lost."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Admonish the Valrath for this pursuits.",
				"requirement": "[trait] PERSUASIVE",
				"text": "You offer encouraging words, reminding the Valrath that his pursuits don't need to define who he is. He grumbles as he slinks down the alley. \"I'll, uh, consider what you said.\"",
				"rewards": {
					"text": "No effect."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Admonish the Valrath for this pursuits.",
				"requirement": "[not] [trait] PERSUASIVE",
				"text": "You tell the Valrath just how troubling his actions are for society. He waves you off. \"Keep your opinions to yourself! And, uh, let me know if you come across some snowthistle, obviously.\"",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"SO-14": {
		"text": "<p>A group of mercenaries are strapping supplies onto a donkey-drawn wagon. A woman in gleaming armor stows a warhammer, ignoring the agitated old man nattering at her.</p><p>\"Bah, go on then and rush to your deaths. There's nothing up that mountain but an unmarked grave with your name on it.\" He scrunches his face, struggling. \"Or I should say without your name on it! Because it'll be unmarked, and no one will find you!\"</p><p>He turns to you. \"These mercenaries are abandoning Frosthaven to venture into the hills for adventure. Waste of good manpower, I say!\" The mercenaries certainly look to be on the younger side, still excited for a march outside the walls.</p><p>A plucky Quatryl gathers a crowd with notes from her lute, hopping onto the back of the donkey. \"How about it, then? Who will fund our journey to treasure?\"</p>",
		"options": {
			"A": {
				"trigger": "Mercenaries should be supported. Help them purchase supplies in return for a cut of what they find.",
				"requirement": "LOSE 10 COLLECTIVE GOLD AND ANY 2 COLLECTIVE HERB RESOURCES",
				"text": "You see them safely on their way and hope for the best as they make their way out of Frosthaven's gate and into the unknown. The backing of someone like you is enough for the town to also throw in their support, and an Orchid with a longbow strapped to his back nods in thanks as they pass.",
				"rewards": {
					"text": "Gain 1 morale.",
					"events": {
						"SO": [{ "id": "SO-37" }, { "id": "SO-38" }]
					}
				}
			},
			"B": {
				"trigger": "The old man's right. They're walking to their doom. Try to stop them.",
				"text": "<p>You stop an Orchid mercenary as he loads the last of the meager supplies onto the wagon. He clearly hasn't seen much combat—you describe just how dangerous this could be.</p><p>\"I... uh, I didn't think of it that way. He walks off to talk with his companions who start looking more concerned. Eventually, he returns. \"Thanks for the dose of reality. I'm probably better off just joining the town guard. I guess we won't be needing this.\" He hands you the object that inspired their adventure.</p>",
				"rewards": {
					"text": "Gain one random side scenario.<br/>Gain 1 soldier."
				}
			}
		}
	},
	"SO-15": {
		"text": "<p>\"Damn White Oak! They give us half a budget and still expect us to stay alive!\"</p><p> Captain Olmstead is stomping around angrily. He punctuates his frustration by knocking a weapon rack to the floor.</p><p>\"Upgrades to the barracks could mean the difference of lives in this town, and we're stuck filing requests that take months to get through the pass and back—just to have their stupid red 'rejected' stamps!\" He grabs a training sword and stabs it into the straw belly of a practice dummy. \"ARRGH!\"</p><p>This seems like a bad time to ask if there are any new jobs posted.</p>",
		"options": {
			"A": {
				"trigger": "Offer to cover the cost of upgrading the barracks yourself.",
				"requirement": "LOSE 10 COLLECTIVE GOLD",
				"text": "<p>You offer to make up the budget deficit to upgrade the Barracks out of your own pocket. Captain Olmstead's eyes widen.</p><p>\"You mercenaries are not nearly the scum Satha thinks you are. I'm going to tell her right now!\"",
				"rewards": {
					"text": "Upgrade the Barracks to the next level, or, if the Barracks is already level 4, gain 1 morale instead."
				}
			},
			"B": {
				"trigger": "Leave and come back later.",
				"text": "<p>Captain Olmstead grabs a decorative shield off the wall and begins bashing it against the straw face of the practice dummy. He soon abandons the dented shield and starts furiously clawing the dummy, pulling out big tufts of straw with his bare hands.</p><p>You take that as a cue to return at a more convenient time.</p>",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"SO-16": {
		"text": "<p>You're settling in for the night when a stern knock raps against the front door to your longhouse. It's a squat, sweaty Quatryl mail carrier, intent on making a delivery to your longhouse. You look at the package: the address is right, but the name belongs to a previous resident who met an unfortunate end under an Algox raider's fist.</p><p>You nod noncommittally and accept the package. You're saving the mail carrier a long trip back with the box, really. Now you just have to figure out what to do with it.</p>",
		"options": {
			"A": {
				"trigger": "Keep the contents for yourself.",
				"text": "Inside you find heartfelt letters, a warm sweater, home-baked bread, and lots of well-wishes from a family in the capital. It feels awful to sift through, knowing the intended recipient's fate.",
				"rewards": {
					"text": "Gain 5 collective gold."
				}
			},
			"B": {
				"trigger": "Pass it along to some of the previous resident's friends.",
				"text": "You find some of the dead guard's companions at the barracks and hand off the package. Opening it is a somber occasion, but, ultimately, all of the homemade items inside lift the soldiers' spirits, and using them brings back fond memories of their friend.",
				"rewards": {
					"text": "Gain 1 morale."
				}
			}
		}
	},
	"SO-19": {
		"text": "<p>The sun is shimmering, the sea birds are honking, and this day seems uncharacteristically lively for the town of Frosthaven. Large carts of resources have just trundled in from a successful expedition, the crops have started to show, and even the populace has exchanged their upset grimaces for more welcoming grimaces. It could not be a more perfect day.</p><p>Several citizens have cornered Satha in the town square. One speaks up: \"We've stocked enough away and the harvest is plentiful. It's about time we had something to celebrate here. Why not open the city coffers and sponsor a holiday?\"</p><p>Satha contemplates the proposal, but she looks on the fence. You could probably sway her opinion.</p>",
		"options": {
			"A": {
				"trigger": "Encourage her to declare a summertime holiday to celebrate the success of the season.",
				"text": "<p>You explain the virtues of a summertime holiday, highlighting the freshness of the fruit and how the town could dance into the night with the later summer sunsets. Satha is readily swayed.</p><p>\"It's settled, then! we'll have a Summer Harvest Festival!\"</p>",
				"rewards": {
					"events": {
						"SO": [{ "id": "SO-36" }]
					}
				}
			},
			"B": {
				"trigger": "Encourage her to store the resources for a winter holiday, when the town may need to lift its spirits.",
				"text": "<p>You explain the virtues of a wintertime holiday, highlighting that hot drinks and bonfires could warm the hearts of the townsfolk, providing much needed merriment during the dark winter days. Satha is readily swayed.</p><p>\"It's settled, then! We'll have a Winter Festival!\"</p>",
				"rewards": {
					"events": {
						"WO": [{ "id": "WO-61" }]
					}
				}
			}
		}
	},
	"SO-21": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-22": {
		"unlockedBy": { "section": { "id": "129.3" }},
		"text": "<p>A young boy sits by himself on the edge of the pier, the overhead sun casting a short shadow as his legs dangle over the water. He's dragging a rope attached to a wooden dowel through the water, occasionally stopping to throw chunks of rotting meat. It takes a few minutes, but you finally figure out what he's doing.</p><p>He's fishing. Or trying to, at least.</p><p>You recognize the boy—his father is a fisherman. Well, was, until he was killed in a recent attack. It seems like the kid is trying to do his father's job and help feed the town, but at this rate, he's more likely to scare fish away than catch any.</p>",
		"options": {
			"A": {
				"trigger": "Surreptitiously pay someone a few coins to give the kid some fishing lessons.",
				"text": "You flag down a respectable looking deckhand, motion toward the kid, and drop a few coins in his hand. You watch as he puts a hand on the boy's shoulder and they start talking, then you go about your duties. A few hours later, you see them still deep in conversation. You smile.",
				"rewards": {
					"text": "Gain 1 morale.<br/>Lose 5 collective gold."
				}
			},
			"B": {
				"trigger": "Spend some time with the boy and teach him yourself.",
				"text": "You approach the boy and sit down next to him. After a few minutes of silence, he looks at you and introduces himself. You ask if anything is biting today. Next thing you know, it's nightfall. You skipped out on today's assigned duties, but you're pretty sure you spent the day doing the most important work that could be done.",
				"rewards": {
					"text": "One character starts the next scenario discarding two cards.<br/>Gain 2 morale."
				}
			}
		}
	},
	"SO-23": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-24": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-25": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-26": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-27": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-28": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-29": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-30": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-31": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-32": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-33": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-34": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"SO-35": {
		"unlockedBy": { "section": { "id": "129.3" }},
		"text": "<p>As you enter the barracks, you find Captain Olmstead staring down Eros, the local Savvas playwright. Eros taunts the Captain with a smirk, gathering the pot into a pocket in its scarf after a game of cards.</p><p>\"Don't worry, Captain. This money will be put towards building Unfettered costumes for my latest work: 'The Fettered Life: A Musical.' I'll be sure to list these barracks and especially you as a sponsor.\" Eros scoops up the last of the winnings and makes an exit.</p><p>Captain Olmstead looks to be on the verge of steam pouring out of his ears. He grabs a chair, snapping it in half with his bare hands. \"That was supposed to be for upgrading the barracks! ARRgh!\" He picks up the table, struggling to tear it apart.</p>",
		"options": {
			"A": {
				"trigger": "Offer to pay to upgrade the barracks; it's worth it for town defense.",
				"requirement": "LOSE 10 COLLECTIVE GOLD",
				"text": "Captain Olmstead looks relieved, calming his breathing. \"It's not that I don't like art. I like art. I love music. I even love musicals. I just hate that Savvas.\" He centers himself. \"In any case, thank you.\"",
				"rewards": {
					"text": "Upgrade the Barracks to the next level, or, if the Barracks is already level 4, gain 1 morale instead."
				}
			},
			"B": {
				"trigger": "This seems like the perfect time to be somewhere else.",
				"text": "You make a hasty exit—no need to disturb the Captain when it's clear he needs some alone time. There will be other opportunities.",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"SO-36": {
		"unlockedBy": { "event": { "id": "SO-19" }}
	},
	"SO-37": {
		"unlockedBy": { "event": { "id": "SO-14" }}
	},
	"SO-38": {
		"unlockedBy": { "event": { "id": "SO-14" }}
	},
	"SO-39": {
		"unlockedBy": { "event": { "id": "SO-09" }}
	},
	"SO-40": {
		"unlockedBy": { "event": { "id": "SO-01" }}
	},
	"SO-41": {
		"unlockedBy": { "event": { "id": "WO-17" }}
	},
	"SO-42": {
		"unlockedBy": { "event": { "id": "SR-02" }}
	},
	"SO-43": {
		"unlockedBy": { "event": { "id": "SR-17" }}
	},
	"SO-52": {
		"unlockedBy": { "event": { "id": "B-04" }},
		"text": "<p>You rush to the docks in response to the alarm bells and find a massive shell washed up on the icy shore. Slowly... slowly, a head wider than the guard tower emerges. It is a giant sea turtle, beached on the land. It opens its mouth and addresses Frosthaven with a slow drawl:</p><p>\"Hello, City. I apologize for intruding, when I last came through here it looked very different. I knew you when you were just Ice. Or perhaps time has not been kind on my eyes.\" The turtle's eyes are nearly glazed over in a white film. It looks blind, or close to it.</p><p>Children playing on the docks laugh at the silliness of the creature. A young girl shouts, \"Did you get stuck, Mr. Turtle?\"</p><p>\"Oh, how youthful you sound, City! You must be quite new to this world. I do appear stuck. Any chance for a push?\"</p>",
		"options": {
			"A": {
				"trigger": "Rally the guard and give a push.",
				"text": "<p>The town guard puts their backs into it and heaves the massive turtle back into the water.</p><p>\"Oh my, thank you, City! Such a polite young city. I will be sure to tell my friends.</p>",
				"rewards": {
					"text": "Gain 2 morale."
				}
			},
			"B": {
				"trigger": "This creature is on its last legs. It could be put to better use supplying the town with meat and armor.",
				"text": "<p>You pull the children back from the creature—Frosthaven has enough horrors without needing to see the circle of life so clearly.</p><p>The guards finish their dark task and you thank the turtle for helping this town survive.</p>",
				"rewards": {
					"text": "Gain 5 collective [hide].<br/>Gain 3 soldiers."
				}
			}
		}
	},
	"SO-53": {
		"unlockedBy": { "section": { "id": "7.3" }}
	},
	"SO-55": {
		"unlockedBy": { "section": { "id": "151.2" }}
	},
	"SO-57": {
		"unlockedBy": { "section": { "id": "78.4" }}
	},
	"SO-58": {
		"unlockedBy": [{ "section": { "id": "152.3" }}, { "section": { "id": "164.2" }}]
	},
	"SO-59": {
		"unlockedBy": { "section": { "id": "189.1" }}
	},
	"SO-60": {
		"unlockedBy": { "section": { "id": "7.3" }}
	},
	"SO-61": {
		"unlockedBy": { "section": { "id": "25.2" }}
	},
	"SO-62": {
		"unlockedBy": { "section": { "id": "189.1" }}
	},
	"SO-64": {
		"unlockedBy": { "section": { "id": "60.2" }}
	}
}