{
	"SO-01": {
		"text": "<p>Knock knock knock! \"Mail call, open up.\"</p><p>You open the door to find a grumpy Quatryl With a low-riding sack of mail. She tosses a lumpy package wrapped in cord to you. \"No name, but this address. It's yours now!\"</p><p>As she walks away she snaps her fingers, remembering something. \"Oh, right. This too.\" She hands over a letter addressed to you. As she wanders off toward a drink, you rip the letter open to read a note scrawled in excellent cursive:</p><p class=\"ms-4\">\"Please do not open the package.<br/>We will retrieve it.<br/>—Leonidas and Maximus\"</p>",
		"options": {
			"A": {
				"trigger": "Open the package.",
				"text": "<p>You tear open the edge of the package, just to get a peek. The closer you look, the less there is to see... it's empty. Sometime later a pair of Aesthers dressed in drab yellow arrive at your door.</p><p>\"Hello mercenaries. We are Leonidas—\"<br/>\"—and Maximus. We have come for our package.\"</p><p>You feign confusion and they return the sentiment.</p><p>\"Oh. Perhaps we have come too early—\"<br/>\"—or too late. We will return.\"</p>",
				"rewards": "Add event SO-40 to the summer outpost deck."
			},
			"B": {
				"trigger": "Respect the request.",
				"text": "<p>Against all the curiosity in your being, you refrain from opening the lumpy package. A short while later two Aesthers dressed in drab yellow arrive at your door.</p><p>\"Hello mercenaries. We are Leonidas—\"<br/>\"—and Maximus. We have come for our package.\"</p><p>You hand it over, and they tear open the top, reaching much too deep inside to be obeying the laws of the universe. Out comes a large black diamond.</p><p>\"The Shadow Gem. We have—\"<br/>\"—your payment, as agreed.\"</p><p>They hand you a sack of coins and then turn and leave, passing the diamond back and forth between them.</p>",
				"rewards": "Gain 30 collective gold."
			}
		}
	},
	"SO-09": {
		"text": "<p>\"I'm trying to explain, that's the very root cause of all of this! They're not aggressive by nature!\" Violet, the local Lurker researcher, is pleading on the street with Mayor Satha.</p><p>\"Right. And they have terrifying claws and razor-sharp protrusions because they're peaceful. \"Satha is having none of it. Violet is nervously balling up her purple scarf, clearly on the verge of a breakdown.</p><p>\"Please, you have to understand. My research suggests—\" Satha cuts the Valrath off.</p><p>\"Your research suggests the capital is willing to waste resources. Resources that could be put to use protecting the people of this outpost from those same Lurkers you so desperately want to repaint as benevolent! I'll be confiscating your supplies for the defense effort.\"</p>",
		"options": {
			"A": {
				"trigger": "Come to Violet's aid—there's more to the Lurkers.",
				"text": "<p>You intervene in the heated discussion and provide some reports from the field. Yes, the Lurkers can be an impressive adversary, but there are indications there's more to their actions. Violet is visibly relieved at your help.</p><p>Satha grunts. \"Fine, if you think there's value here, introduce her to the guard. But if her crackpot ideas don't pan out, I'm holding it against you lot.\"</p>",
				"rewards": "Add event WO-62 to the winter outpost deck."
			},
			"B": {
				"trigger": "Back up Satha's assessment—Lurker research is a waste of resources.",
				"text": "<p>You can't help but side with Satha under the circumstances: the Lurkers have proven, time and again, to be vicious killing machines with physiology to match. You don't doubt that Violet means well, but if there are resources that could be used to protect the town, it's better for Satha to use them on defense rather than research projects.</p><p>Violet lowers her gaze, then walks off without another word, dejected.</p>",
				"rewards": "Add event SO-39 to the summer outpost deck."
			}
		}
	},
	"SO-11": {
		"text": "<p>Pinter Droman, Frosthaven's resident Quatryl tinkerer, is unwrapping a package wrapped in brocade in his workshop.</p><p>\"Come take a look. Can't believe it. One of the guards just dropped this off. Says he found it on the hillside.\" Out from the cloth comes what looks like a long metallic-purple blade. \"Remarkable! Believe it or not, this is an antler from a Brummix. Quatryl settlers brought them here over a century ago, but they all died out. Or so I thought.\"</p><p>\"Watch this!\" He swings a heavy wrench at the antler, snapping it in two pieces.</p><p>\"Alright, let's see if the myths are true...\" He grabs the two halves of the antler and gently touches them together. Like magic, the two pieces fuse back together, looking as perfect as when he first unwrapped the antler. Pinter is grinning from ear to ear.\"</p><p>\"A marvel of nature! Now what should we use it for?\"</p>",
		"options": {
			"A": {
				"trigger": "Use it as a mutable material for crafting.",
				"text": "<p>Pinter fires up the furnace. \"We'll need to get it nice and toasty to melt this beauty!\" Pinter lobs the Brummix antler in. Soon, a purple liquid pours out the side and drains into the mold for three shiny purple bars.</p><p>\"Should be good for just about anything. Take it—just promise me if you ever find that beautiful Brummix, you treat it well. I heard they're crazy for axenuts, if you'd believe it.\"</p>",
				"rewards": "Gain 1 morale.<br/>Gain 3 collective material resources of any kind.<br/>Gain \"Brummix\" campaign sticker."
			},
			"B": {
				"trigger": "Weave it into an art piece.",
				"text": "<p>You return several hours later to find Pinter filing the last edges off a stunning purple necklace. He wipes it with the edge of his shirt sleeve and hands it to you.</p><p>\"You take it. Just promise me, if you ever find that enchanting Brummix, you treat it well. I heard they're crazy for axenuts, if you'd believe it.\"</p>",
				"rewards": "Gain 1 morale.<br/>Gain \"Deathproof Charm\" [item].<br/>Gain \"Brummix\" campaign sticker."
			}
		}
	},
	"SO-14": {
		"text": "<p>A group of mercenaries are strapping supplies onto a donkey-drawn wagon. A woman in gleaming armor stows a warhammer, ignoring the agitated old man nattering at her.</p><p>\"Bah, go on then and rush to your deaths. There's nothing up that mountain but an unmarked grave with your name on it.\" He scrunches his face, struggling. \"Or I should say without your name on it! Because it'll be unmarked, and no one will find you!\"</p><p>He turns to you. \"These mercenaries are abandoning Frosthaven to venture into the hills for adventure. Waste of good manpower, I say!\" The mercenaries certainly look to be on the younger side, still excited for a march outside the walls.</p><p>A plucky Quatryl gathers a crowd with notes from her lute, hopping onto the back of the donkey. \"How about it, then? Who will fund our journey to treasure?\"</p>",
		"options": {
			"A": {
				"trigger": "Mercenaries should be supported. Help them purchase supplies in return for a cut of what they find.",
				"requirement": "LOSE 10 COLLECTIVE GOLD AND ANY 2 COLLECTIVE HERB RESOURCES",
				"text": "You see them safely on their way and hope for the best as they make their way out of Frosthaven's gate and into the unknown. The backing of someone like you is enough for the town to also throw in their support, and an Orchid with a longbow strapped to his back nods in thanks as they pass.",
				"rewards": "Gain 1 morale.<br/>Add events SO-37 and SO-38 to the summer outpost deck."
			},
			"B": {
				"trigger": "The old man's right. They're walking to their doom. Try to stop them.",
				"text": "<p>You stop an Orchid mercenary as he loads the last of the meager supplies onto the wagon. He clearly hasn't seen much combat—you describe just how dangerous this could be.</p><p>\"I... uh, I didn't think of it that way. He walks off to talk with his companions who start looking more concerned. Eventually, he returns. \"Thanks for the dose of reality. I'm probably better off just joining the town guard. I guess we won't be needing this.\" He hands you the object that inspired their adventure.</p>",
				"rewards": "Gain one random side scenario.<br/>Gain 1 soldier."
			}
		}
	},
	"SO-15": {
		"text": "<p>\"Damn White Oak! They give us half a budget and still expect us to stay alive!\"</p><p> Captain Olmstead is stomping around angrily. He punctuates his frustration by knocking a weapon rack to the floor.</p><p>\"Upgrades to the barracks could mean the difference of lives in this town, and we're stuck filing requests that take months to get through the pass and back—just to have their stupid red 'rejected' stamps!\" He grabs a training sword and stabs it into the straw belly of a practice dummy. \"ARRGH!\"</p><p>This seems like a bad time to ask if there are any new jobs posted.</p>",
		"options": {
			"A": {
				"trigger": "Offer to cover the cost of upgrading the barracks yourself.",
				"requirement": "LOSE 10 COLLECTIVE GOLD",
				"text": "<p>You offer to make up the budget deficit to upgrade the Barracks out of your own pocket. Captain Olmstead's eyes widen.</p><p>\"You mercenaries are not nearly the scum Satha thinks you are. I'm going to tell her right now!\"",
				"rewards": "Upgrade the Barracks to the next level, or, if the Barracks is already level 4, gain 1 morale instead."
			},
			"B": {
				"trigger": "Leave and come back later.",
				"text": "<p>Captain Olmstead grabs a decorative shield off the wall and begins bashing it against the straw face of the practice dummy. He soon abandons the dented shield and starts furiously clawing the dummy, pulling out big tufts of straw with his bare hands.</p><p>You take that as a cue to return at a more convenient time.</p>",
				"rewards": "No effect."
			}
		}
	},
	"SO-19": {
		"text": "<p>The sun is shimmering, the sea birds are honking, and this day seems uncharacteristically lively for the town of Frosthaven. Large carts of resources have just trundled in from a successful expedition, the crops have started to show, and even the populace has exchanged their upset grimaces for more welcoming grimaces. It could not be a more perfect day.</p><p>Several citizens have cornered Satha in the town square. One speaks up: \"We've stocked enough away and the harvest is plentiful. It's about time we had something to celebrate here. Why not open the city coffers and sponsor a holiday?\"</p><p>Satha contemplates the proposal, but she looks on the fence. You could probably sway her opinion.</p>",
		"options": {
			"A": {
				"trigger": "Encourage her to declare a summertime holiday to celebrate the success of the season.",
				"text": "<p>You explain the virtues of a summertime holiday, highlighting the freshness of the fruit and how the town could dance into the night with the later summer sunsets. Satha is readily swayed.</p><p>\"It's settled, then! we'll have a Summer Harvest Festival!\"</p>",
				"rewards": "Add event SO-36 to the summer outpost deck."
			},
			"B": {
				"trigger": "Encourage her to store the resources for a winter holiday, when the town may need to lift its spirits.",
				"text": "<p>You explain the virtues of a wintertime holiday, highlighting that hot drinks and bonfires could warm the hearts of the townsfolk, providing much needed merriment during the dark winter days. Satha is readily swayed.</p><p>\"It's settled, then! We'll have a Winter Festival!\"</p>",
				"rewards": "Add event WO-61 to the winter outpost deck."
			}
		}
	},
	"SO-36": {
		"unlockedBy": { "event": { "id": "SO-19" }}
	},
	"SO-37": {
		"unlockedBy": { "event": { "id": "SO-14" }}
	},
	"SO-38": {
		"unlockedBy": { "event": { "id": "SO-14" }}
	},
	"SO-39": {
		"unlockedBy": { "event": { "id": "SO-09" }}
	},
	"SO-40": {
		"unlockedBy": { "event": { "id": "SO-01" }}
	},
	"SO-42": {
		"unlockedBy": { "event": { "id": "SR-02" }}
	},
	"SO-52": {
		"unlockedBy": { "event": { "id": "B-04" }},
		"text": "<p>You rush to the docks in response to the alarm bells and find a massive shell washed up on the icy shore. Slowly... slowly, a head wider than the guard tower emerges. It is a giant sea turtle, beached on the land. It opens its mouth and addresses Frosthaven with a slow drawl:</p><p>\"Hello, City. I apologize for intruding, when I last came through here it looked very different. I knew you when you were just Ice. Or perhaps time has not been kind on my eyes.\" The turtle's eyes are nearly glazed over in a white film. It looks blind, or close to it.</p><p>Children playing on the docks laugh at the silliness of the creature. A young girl shouts, \"Did you get stuck, Mr. Turtle?\"</p><p>\"Oh, how youthful you sound, City! You must be quite new to this world. I do appear stuck. Any chance for a push?\"</p>",
		"options": {
			"A": {
				"trigger": "Rally the guard and give a push.",
				"text": "<p>The town guard puts their backs into it and heaves the massive turtle back into the water.</p><p>\"Oh my, thank you, City! Such a polite young city. I will be sure to tell my friends.</p>",
				"rewards": "Gain 2 morale."
			},
			"B": {
				"trigger": "This creature is on its last legs. It could be put to better use supplying the town with meat and armor.",
				"text": "<p>You pull the children back from the creature—Frosthaven has enough horrors without needing to see the circle of life so clearly.</p><p>The guards finish their dark task and you thank the turtle for helping this town survive.</p>",
				"rewards": "Gain 5 collective [hide].<br/>Gain 3 soldiers."
			}
		}
	},
	"SO-64": {
		"unlockedBy": { "section": { "id": "60.2" }}
	}
}