{
	"SR-02" : {
		"text": "<p>\"Ho there! A moment of your time?\" from just off the path, a weathered Valrath calls for your attention. He approaches you with surprising speed despite the pack and gear strapped to his back. \"Edwin Merlsgate, Cartographer. You look familiar, have we met?\"</p><p>Before you can respond, he continues. \"I always forget a face, but never forget a trail. I can only cover so much ground, though—could we compare notes?\" He pulls out a scroll and quill, looking up expectantly.</p>",
		"options": {
			"A": {
				"trigger": "Share notes of your travels.",
				"text": "<p>Edwin is overjoyed to hear of your travels.<br/><strong class=\"fst-normal\">Mark a box next to each location in which you've completed at least one scenario:</strong></p><p><i class=\"fa-regular fa-square\"></i> Radiant Forest<br/><i class=\"fa-regular fa-square\"></i> Copperneck Mountains<br/><i class=\"fa-regular fa-square\"></i> Whitefire Wood<br/><i class=\"fa-regular fa-square\"></i> Crystal Fields<br/><i class=\"fa-regular fa-square\"></i> The Biting Sea</p><p>\"Thank you tremendously, that helps confirm several of the first-hand accounts I've collected. Nearly identical!\"</p>",
				"rewards": {
					"text": "<p>Gain 3 collective gold for each checked box above.</p><p>When all boxes are checked:</p>",
					"events": {
						"SO": [{ "id": "SO-42" }]
					}
				}
			},
			"B": {
				"trigger": "Ask him about his more notable travels.",
				"text": "<p>You note that you're not as well-traveled as he is, and ask if there's any locales he'd recommend.</p><p>\"I'm not a huge fan of the tourist-y places, but I can tell you about some exciting regions I've noted from afar...\"</p>",
				"rewards": {
					"text": "Gain 1 inspiration."
				}
			}
		}
	},
	"SR-03" : {
		"text": "<p>Camouflaged into an outcropping of a stone cliff face sits a savvas. You're trying to determine whether it's still alive when it proudly reveals itself with a long, gravely clearing of its throat.</p><p>\"Hello, adventurers.\" It lifts itself from the rock, standing with a creaking stretch. Some Savvas modify their bodies through painful sculpting, shaping their rocky skin like carved marble. This one has chiseled its face into the visage of a lion, and its chest glows with a swirl of black and white.</p><p>\"You look clever... answer me correctly, and I'll give you something worthy of your answer. Fail, and you shall suffer the punishment.\"</p><p>\"Fished from the waters, drawn from the earth.<br/>My presence bears both jealousy, and mirth.<br/>I've corrupted and captivated, I'm sought out and sold.<br/>If you still can't guess me: I'm worth my weight... in gold.\"</p>",
		"options": {
			"A1": {
				"id": "",
				"trigger": "Solve the riddle and say your answer aloud now.",
				"requirement": "IF YOU SAID \"GOLD\"",
				"text": "<p>\"Clever, good.\" It scratches its stony fingers along its face in thought. \"Perhaps you are the ones. Return someday, we'll see.\" It curls back into the cliff face, then remembers your deal. \"Ah, and as promised, something worth its weight, right?\"</p>",
				"rewards": {
					"text": "Gain 1 inspiration.<br/>Gain 20 collective gold.",
					"events": {
						"SR": [{ "id": "SR-33" }]
					}
				}
			},
			"A2": {
				"id": "",
				"trigger": "Solve the riddle and say your answer aloud now.",
				"requirement": "IF YOU DIDN\"T SAY \"GOLD\"",
				"text": "<p>\"Foolish. Only one thing is worth its weight in gold: gold itself. Not the ones I was looking for. Begone.\" The Savvas curls back into the cliff face, turning its lion head away. It ignores you as you move on, but you hear it mutter something under its breath.</p>",
				"rewards": {
					"text": "All characters start the next scenario with [muddle].<br/>During battle goal selection in the next scenario, all characters draw one fewer card."
				}
			}
		}
	},
	"SR-04": {
		"text": "Just outside Frosthaven, right where the road begins to become less traveled, you find a man in dusty white vestments. A few burnt-down candles are on the ground next to him, dripping wax onto the rocks.</p><p>\"Would you like to make a donation?\" The young priest holds out a bowl for offerings. \"I would be happy to extend the blessings of the Great Oak to you as protection on your journeys.\"</p><p>He sees your trepidation in turning over hard-earned gold. \"The Sanctuary sent me here to set up a shrine, but I was unfortunately set upon by robbers. I just need a bit of time to earn back the funds. And my blessings are nearly as good as the ones you'd find elsewhere!\"",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Make an offering at the improvised shrine.",
				"requirement": "LOSE 5 GOLD",
				"text": "You drop a few coins in the wooden offering plate, which gets you a sincere nod of thanks. He sends you on your way, but you feel a bit lighter in your step.",
				"rewards": {
					"text": "All characters who donated gain [bless]. Check one box below for each character who donated. The first time all 6 boxes have been checked, gain 1 prosperity."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Make an offering at the improvised shrine.",
				"requirement": "[not] LOSE 5 GOLD",
				"text": "You're not willing to support the roadside shrine.",
				"rewards": {
					"text": "No effect."
				}
			},
			"B": {
				"trigger": "It's clear this is an easy mark. Steal from the offering plate.",
				"text": "This sap expects us to believe he represents the Great Oak? you're putting a stop to this right now. A few swings of the arm take care of the makeshift shrine, and you don't expect to see this charlatan harassing travelers in the future.",
				"rewards": {
					"text": "Gain 10 collective gold.<br/>All characters start the next scenario with [curse]."
				}
			}
		}
	},
	"SR-07": {
		"text": "<p>\"Heeey. Heeeeey.\" You stop under a moss-covered tree, unsure if you heard what you think you heard: a tiny-sounding voice calling out—</p><p>\"Heeeeelllp.\" That one you're sure of. You search around the base of the tree and spot it: a beetle nearly the size of a fist. It rubs its limbs together in a practiced way, and the friction sounds nearly like human speech: \"Hellllp me.\" Against your better judgement you pick it up. Despite its unusual size it looks somehow fragile, lost.</p><p>\"Harrower. Hellllp. Saaaave.\" Is this bug claiming to be... part of a Harrower? A Harrower is a sentient collection of bugs, but it's unusual to have one maintain that intelligence when detached from the greater whole.</p>",
		"options": {
			"A": {
				"trigger": "There's a mass of fire ants marching over to get a look. Put the two together to see if it can commune with them.",
				"text": "You find an ants' nest nearby and set the beetle down next to it. There's a definite connection, but there is a power struggle as well: the ant hive has its own hierarchy and is unwilling to support a new member. Eventually, the ants take decisive action and swarm the beetle.",
				"rewards": {
					"text": "No effect."
				}
			},
			"B": {
				"trigger": "A talking bug? Might as well take it with you and keep it safe.",
				"text": "You find a suitable container and pocket the beetle. Maybe it will be useful someday.",
				"rewards": {
					"text": "Gain \"Bug in a Jar\" campaign sticker.",
					"events": {
						"SR": [{ "id": "SR-34" }]
					}
				}
			}
		}
	},
	"SR-10": {
		"text": "<p>You round a rocky outcropping and find a lavishly-dressed Savvas staring you down, anger in its eyes.</p><p>\"You're late!\" You stammer a non-committal half-response, but it's quickly cut off. \"Useless! Don't touch the food with those greasy hands of yours. It's worth more than all those pelts you're wearing. Grab a tray and get to work serving your betters—and be advised your tardiness is coming out of your tip!\"</p><p>A dozen Savvas are seated on stone benches around an outdoor table meticulously carved from a single slab of granite. Each Savvas is wearing elaborate clothing studded with metals and fine silks that really do put your own clothes to shame. The scene is set for a magnificent feast, and a nearby serving area has gorgeous platters heaped high with the most perfect cuts of... rocks?</p><p>\"Get on with it! We 're hungry!\"</p>",
		"options": {
			"A": {
				"trigger": "You heard the Savvas. Let's make some coin.",
				"text": "You shuttle heavy platters of fine rocks from the serving area to the assembled Savvas, refilling drinks and generally staying out of their way. The Savvas consume the geologic sampler with a deliberate slowness, savoring the crunch and grinding each bite to sand before swallowing. When the gathered group is satiated, one calls you over and hands you a small pouch full of gold with an idle nod of thanks.",
				"rewards": {
					"text": "Gain 15 collective gold."
				}
			},
			"B": {
				"trigger": "Oh sure, you'll serve them—but these haughty Savvas need to be taught a lesson. Rations from your packs it is.",
				"text": "<p>You dig out some of the hardened rations that have ridden around in your pack for weeks now—they're as good as rocks and equally hard. You slip a few onto the platters as you serve the uptight Savvas, and they relish them the same as any of their fancy rocks. They finish their meal happily and hand over a small pouch of gold, but cant help but remind you they're withholding some of the payment for your tardiness.</p><p>You make a quick exit and are nearly out of earshot before the retching starts.</p>",
				"rewards": {
					"text": "Gain 1 morale.<br/>Gain 10 collective gold."
				}
			}
		}
	},
	"SR-13": {
		"text": "<p>As you pause for a rest along your journey, you spot a handful of bright orange produce sticking out from the meltwater mud. It looks not dissimilar to an elongated flamefruit, though the color is different. You pick one off and smell it, noting its rich, lively herb aroma. As you prepare to take a bite, you hear a voice shouting.</p><p>\"I wouldn't do that.\" An elderly Quatryl steps out of the bushes and points at you with her walking stick. \"That's a firepepper, the strongest spice on this side of the continent!\" As you look puzzled, she continues. \"It's been said a firepepper stew can reheat even the soul of the dead. I've heard the tale of a Hungry Maw living beneath the Copperneck Mountains that only spared a village from destruction when they served it a plate of their hottest sweet-and-fiery stew.\" She chuckles to herself.</p><p>\"I'm certain it would be too much for you. I grew up eating these, but it would probably take you a week to recover!\"</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Try the firepepper.",
				"requirement": "[trait] QUATRYL, SAVVAS, STRONG or UNFETTERED",
				"text": "A challenge must be met. You pop the firepepper into your mouth, and after a second, it's clear why she warned you: this thing is HOT! After an hour, most of the burning has subsided, and the woman nods, impressed. \"Alright, perhaps you could handle a challenge of a different sort...\"",
				"rewards": {
					"text": "Gain 10 experience each.<br/>Gain \"Firepepper\" campaign sticker.",
					"scenarios": [{ "id": "122" }]
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Try the firepepper.",
				"requirement": "[not] [trait] QUATRYL, SAVVAS, STRONG or UNFETTERED",
				"text": "You pop the firepepper into your mouth, and the juices explode like lava. The old Quatryl was right. She chuckles, pouring cool milk from a canteen at her hip into your mouth. \"I told you, it was strong enough to satisfy the Hungry Maw! Now that I don't have to worry about backtalk, I'll tell you a story...\"",
				"rewards": {
					"text": "All characters start the next scenario with [damage] 2 and [brittle].<br/>Gain \"Firepepper\" campaign sticker.",
					"scenarios": [{ "id": "122" }]
				}
			},
			"B": {
				"trigger": "Ask her to demonstrate just how easily she could eat it.",
				"text": "She pops the firepepper into her mouth with a shrug, washing it down with something from her canteen. \"See? Easy for someone like me. That's the way it goes... some things are just easier depending on who you are. Now, some battle-hardened warriors like yourselves? Well, you'd probably be best at a task I need some help with...\"",
				"rewards": {
					"text": "Gain \"Firepepper\" campaign sticker.",
					"scenarios": [{ "id": "122" }]
				}
			}
		}
	},
	"SR-16": {
		"text": "<p>The treacherous road ahead of you is blocked by a tattered blue blanket stretched across the path. Your approach disturbs the Inox under it, who jumps up in surprise.</p><p>\"Oh, eh. Wasn't expecting to see others out here. you from Frosthaven? I used to be from there, but haven't been back in uh... a while.\" He rubs the grey fur on his chin thoughtfully, which irritates one of the long scratches running down his face. A bit of blood oozes out, and he sees your concern.</p><p>\"That? It's nothing. Was cold last night, bedded down with an Algox—what they call 'sharing a horn.' Turned on me in the morning. Buyer's remorse, eh?\" He smiles in a way that suggests he hasn't smiled around people for some time.</p><p>\"Y'know... I used to work in Frosthaven's lumber yard. I've got some skill with a saw. Would be willing to teach you, if you've got something edible to trade. Or maybe you've got something warm to wear?\"</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Offer him herbs for wood-cutting skills.",
				"requirement": "<p>LOSE 2 COLLECTIVE HERB RESOURCES",
				"text": "\"I built up a bit of skill with the saw. It's part technique and part sharpening the blade right. Watch this.\"</p><p> What he lacks in decorum he certainly makes up in skill. You learn a thing or two before heading on your way.</p>",
				"rewards": {
					"text": "Add a [plus1] sticker to one [lumber] loot card (the card gives one extra [lumber] when resolved)."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Offer him herbs for wood-cutting skills.",
				"requirement": "[not] LOSE 2 COLLECTIVE HERB RESOURCES",
				"text": "\"Come back when you've got something worth swappin' for.\"",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Offer him hides for wood-cutting skills.",
				"requirement": "<p>LOSE 2 COLLECTIVE [hide]",
				"text": "\"Nice pelt. Is this Valrath?\" It is not Valrath.</p><p> True to his word, the Inox shows you how to sharpen a saw with a technique new to you. You thank him and head on your way.</p>",
				"rewards": {
					"text": "Add a [plus1] sticker to one [lumber] loot card (the card gives one extra [lumber] when resolved)."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Offer him hides for wood-cutting skills.",
				"requirement": "[not] LOSE 2 COLLECTIVE [hide]",
				"text": "\"No offense, but I think you've overstayed your welcome. See you when you've got something worth swappin' for.\"",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"SR-33": {
		"unlockedBy": { "event": { "id": "SR-03" }}
	},
	"SR-34": {
		"unlockedBy": { "event": { "id": "SR-07" }}
	}
}