{
	"WR-01": {
		"text": "<p>“YOU! Strong mer-canaries! You help Hurdle, yes!”</p><p>An ancient Vermling approaches from a copse of trees. From the looks of him, he’s been on his own in the wilderness for a long, long time.</p><p>“Help kill evil Clovis! Ruined Hurdle’s home! Mer-canaries bring justice for Hurdle! You follow, you kill, I reward!” The Vermling called Hurdle leads you to the bank of a briskly running stream, where he points a bony claw toward a large pile of sticks lying across the stream bed. “Cloooovis,” he whispers.</p><p>As you watch, the malodorous beast called Clovis emerges from the water and climbs atop the dam…</p><p>It’s a beaver. Clovis is a beaver. And not a very large one at that.</p><p>“Clovis dam stream,” the hermit spits, “Stream flood Hurdle’s home. Clovis must SUFFER, yes!”</p><p>He turns back to you and repeats his demand. “You kill evil Clovis! I reward greedy mer-canaries. Kill kill!”</p>",
		"options": {
			"A": {
				"trigger": "Kill Clovis.",
				"text": "Clovis sounds like a pretty bad guy. You decide to do this Vermling—no, the world—a favor and rid it of this nefarious beast. A single arrow is all it takes to lay Clovis to rest. Hurdle is overjoyed. “YES! Take that, Clovis!” Regarding your reward, the hermit touches you. “You lucky now,” he says cryptically. “You find what you seek.”",
				"rewards": {
					"text": "Gain 1 collective [hide].<br/>All characters start the next scenario with [muddle].<br/>The first time any character would draw a loot card next scenario, they instead draw two cards, choose one to keep, and place the other on the bottom of the deck."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Try to talk the raving hermit down.",
				"requirement": "[trait] OUTCAST",
				"text": "You know there’s no use trying to convince the stubborn hermit of the beaver’s innocence. Instead you appeal to Hurdle’s better nature, convincing him that the best vengeance is a life well lived, and that Clovis must live with the weight of his guilt. The Vermling nods sagely. “Wise mer-canary… You help Hurdle see truth, yes. Hurdle return gift.”",
				"rewards": {
					"text": "Add a [plus1sticker] sticker to one [metal] loot card (the card gives one extra [metal] when resolved)."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Try to talk the raving hermit down.",
				"requirement": "[not] [trait] OUTCAST",
				"text": "You’ve been asked to do some demeaning things as a mercenary, but your pride is still above settling a vendetta against a small, semi-aquatic mammal. “Stupid mer-canaries!” The hermit rages as he scurries off. “You regret!” As you turn away, you hear a menacing chitter—almost a laugh—from the dam behind you… but when you look back, Clovis is gone.",
				"rewards": {
					"text": "All characters start the next scenario with [curse]."
				}
			}
		}
	},
	"WR-02": {},
	"WR-03": {
		"text": "<p>Walking along, you see a green burlap sack sticking out of the ice. You pry it free and unwrap the contents: a tattered letter and a smaller pouch. The letter reads:</p><p>“Dear Traveler,</p><p>I fear that if you are reading this, my hiding place has been discovered. The enclosed item—an otherwise unremarkable stone—is accursed. Do not touch it, do not carry it with you, and I daresay your life would be much improved were you to return it to its satchel and bury it again for some future unfortunate explorer to suffer its curse. I repeat: heed my warning, leave this item be! It is not a treasure, but a horror I cannot convey in the few words I have here. Step past and do not return!”</p><p>You peek into the smaller pouch: sure enough, it looks like a rock.</p>",
		"options": {
			"A": {
				"trigger": "Take the rock.",
				"text": "<p>Despite the clear warning, you uncinch the sack and pour the rock into your hand. For something buried in the ice it feels strangely warm to the touch. You roll it over in your hand and feel its heat curl up your body… it feels familiar somehow.</p><p>A wave of concern passes over you, which turns into a dark dread. This was not something you should have disturbed. You put it back in the satchel and push it down into the snow. You walk off and leave it behind, but further down the road you reach into your pocket to feel a hard lump. Seems like it won’t be lost so easily.</p>",
				"rewards": {
					"text": "Gain “Cursed Rock” [item_243]."
				}
			},
			"B": {
				"trigger": "Leave the rock.",
				"text": "<p>This is either the world’s greatest threat or the world’s greatest treasure someone is trying to protect. If it was treasure, they wouldn’t have left it buried in the snow.</p><p>You push it back in the snow as deeply as the ice will allow and move on.</p>",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"WR-04": {},
	"WR-05": {
		"text": "<p>You approach the edge of a great chasm not far from Frosthaven’s gates. A rickety wooden bridge, wide enough for just a single person to cross at a time, spans from one end to the other. The alternative to the treacherous bridge is a swift-looking river fed by glacial runoff down below—it looks dire at best.</p><p>Before you have a chance to decide, a hulking Algox wearing a polar-bear-fur vest steps up to block your path. He speaks in a halting staccato. “You pay use bridge. My bridge.”</p><p>The Algox doesn’t wait for a response before explaining further. “Legitimate business bridge. You each pay or use death-path.” He points to the trail leading down to the river you’d have to ford to get across. The Algox crosses his arms and waits for an answer.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Pay to use the legitimate business bridge.",
				"requirement": "LOSE 1 MATERIAL RESOURCE EACH",
				"text": "The hulking Algox steps aside and waves you through. “No run, go slow. Enjoy bridge.” You’re not sure if going slow is recommended for safety or overall enjoyment, but the bridge does hold your party’s weight the whole way across.",
				"rewards": {
					"text": "<p>Mark one box below.<br/>[square] [square]</p><p>When all boxes are marked, remove this card from the deck and:</p>",
					"events": {
						"SO": [{ "id": "WR-35" }]
					}
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Pay to use the legitimate business bridge.",
				"requirement": "[not] LOSE 1 MATERIAL RESOURCE EACH",
				"text": "The Algox refuses to let you through, and you’re forced to cross the river.",
				"rewards": {
					"text": "Read outcome B."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Ford the river.",
				"requirement": "[trait] CHAOTIC or RESOURCEFUL",
				"text": "The river looks dire, but it’s a manageable problem. You see the patterns in the chaotic water and strategically toss in some larger stones and branches to create a makeshift path and get across with only a few unexpected dips into the stream.",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Ford the river.",
				"requirement": "[not] [trait] CHAOTIC or RESOURCEFUL",
				"text": "You try to wade through the icy river, but it’s impossibly cold. The swift current takes your balance out from under you, and by the time you’ve made it to the other side, all warmth has left your body, and the contents of your pack are scattered.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle], [damage] 3 and [loseCard] one [equipmentItem]."
				}
			}
		}
	},
	"WR-06": {
		"text": "<p>A translucent Aesther wearing hunter’s garb is studying some tracks on the path, and turns to catch your attention as you approach. “You there! A moment of your time!” He flags you down. “I’ve been searching for a Vermling by the name of Dramm. About yea high. Have you seen him?”</p><p>When you don’t immediately respond, he thumbs a wicked-looking blade and continues: “You see, this particular Vermling killed someone quite dear to me, and I promised that I would return the favor.” The Aesther’s eyes flash a dark longing.</p>",
		"options": {
			"A": {
				"trigger": "Agree to keep an eye out for him.",
				"text": "<p>You assure the Aesther hunter that you’ll keep an eye out for the Vermling killer. He smiles.</p><p>“My thanks. I am Malak. If you do locate him I ask only that you call for me so I can finish my task at last.”</p>",
				"rewards": {
					"events": {
						"SR": [{ "id": "SR-36" }]
					},
					"removedEvents": {
						"SR": [{ "id": "SR-08" }]
					}
				}
			},
			"B": {
				"trigger": "No, you haven’t seen him.",
				"text": "You tell the Aesther you haven’t seen Dramm. His eyes linger on you a bit too long, trying to determine whether you’re lying, but ultimately he shrugs and accepts your statement with a disconcerting smile. You hurry on to your destination.",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"WR-07": {},
	"WR-08": {
		"text": "<p>The giant boughs of the willowburn tree hang low, heavy with the ice of the season. This picturesque grotto features an iced-over pond. During the warmer season, it would be fed by a waterfall, which is now frozen and anchored to th cliff face overlooking the area.</p><p>The ice over the pond is sturdy and supports your weight easily. The frozen waterfall beckons you closer with an unnatural blue light, and as you approach you can see glowing shapes moving behind the ice—it’s a cave of some sort, now sealed off. The ice is much too thick to get a decent look, but you can feel a supernatural chill that turns your stomach.</p><p>The waterfall likely hasn’t run since summer and has a rough surface that would be perfect for climbing. The top would put you right underneath the willowburn branches.</p>",
		"options": {
			"A": {
				"trigger": "Make camp in the middle of the iced-over pond.",
				"text": "You triple-check that the ice is frozen completely solid: the perfect place to set camp. Visibility is ideal in every direction, and you can make out the stars between the branches of the willowburn tree. you drift off to a peaceful night’s sleep.",
				"rewards": {
					"text": "All characters start the next scenario with [bless]."
				}
			},
			"B": {
				"trigger": "Climb to the top of the waterfall and make camp overlooking the grotto.",
				"text": "The frozen waterfall provides easy handholds for climbing its surface, and before long, you’re standing at the top, looking down on the grotto. You can even reach up and touch the willowburn tree branches. It looks like a great spot to make camp… before the buzzing starts. In a burst of angry yellow, thousands of bees swarm your party, driving you back down the waterfall. You’re out of breath before they give up the chase.",
				"rewards": {
					"text": "All characters start the next scenario with [impair] and discard two cards."
				}
			}
		}
	},
	"WR-09": {
		"text": "<p>As you crest a low hillock a few hours into your walk, a spray of color against the stark white landscape draws your eye.</p><p>Blood in the snow.</p><p>You draw closer to the scene, the telltale black-red pools already melted into the surface.</p><p>The blood and scratch marks around the scene show that this was no quick hunter’s kill; something had a fight here, and recently.</p><p>The blood trails off into a nearby copse of trees. Following it, you discover that the trail splits at a fork in the path: the blood continues to the left alongside large tracks, though judging by the broken twigs and footprints, something also ran off to the right.</p>",
		"options": {
			"A": {
				"trigger": "Follow the bloody trail to the left.",
				"text": "A polar bear lies on the ground in a small clearing, its fur matted with blood. You loose an arrow to make sure it’s dead, but the red-stained corpse doesn’t so much as twitch. Approaching, you see its killer: a swarthy Orchid with wounds to match those of the bear. His breathing is labored and it’s clear his injuries are beyond medical care.",
				"rewards": {
					"text": "Gain 2 collective [hide]."
				}
			},
			"A1": {
				"requirement": "[trait] RESOURCEFUL",
				"text": "You recognize a medicinal plant growing nearby and use it to soothe the pain of the dying man, who uses his last words to tell you what lies along the other path. You take off quickly as he slips away.",
				"rewards": {
					"text": "Read outcome B."
				}
			},
			"B": {
				"trigger": "Follow the trail of broken twigs to the right.",
				"text": "<p>Three sets of small tracks lead to a blackthorn shrub, whose prickly branches quiver with fear. You part the barbed branches and see three little Orchids, barely more than toddlers. Their father defended them from a polar bear, they tell you, and commanded them to hide while he drew the bear away. Judging by the amount of blood you saw back there, you doubt their father is returning anytime soon.</p><p>You’re too remote to send the children home on their own. You can take them with you, though, and bring them to Frosthaven once your business nearby is complete.</p>",
				"rewards": {
					"text": "If you complete the next scenario:<br/>Gain 3 morale."
				}
			}
		}
	},
	"WR-10": {},
	"WR-11": {
		"text": "<p>For as far as the eye can see, the view is the same: nothing but Kivak, pack animals known for their rocky skin and prominent horn. Hundreds, packed in together for warmth or comfort, block the path ahead of you. As you approach, they stop their grazing in an eerie unison, their heads turning in perfect concert. They refuse to part to allow you passage.</p><p>A Quatryl shephard in muddy overalls steps forward from the crowd. “Yep. They’ll let you through, but they want something in return.” The Kivak blink in unison. You look at him, not understanding. “It’s a Kivak hive. All linked up,” he says, as if this clarified things.</p><p>He rolls his eyes. “Harrowers… they’s a bunch a bugs that all work as one thing. Savvas is thinking rocks. Heck, even humans’re just gray worms swimming around in a skull driving a skeleton around. This here’s a buncha Kivak all as one. Anyways, they want something first.” The animals part, leaving a single member of their group staring at you in the center of the clearing.</p><p>“That one wronged the others. They want you to kill her.” He shrugs. “I understand ’em, but I can’t say I understand ’em.” The Kivak waits, unblinkingly.</p>",
		"options": {
			"A": {
				"trigger": "Kill the Kivak.",
				"text": "You cut the doomed Kivak down. It doesn’t move or cry out, having seemingly accepted its fate. The remaining Kivak part and allow you to pass, no longer interested in the proceedings. The shepherd mumbles as you go: “Most Kivak just want to eat dirt and grass. O’course I get the weird ones.”",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals.",
				"requirement": "[trait] OUTCAST",
				"text": "You don’t know what this solitary Kivak did to wrong the others, but you understand rejection by your peers. You grab the Kivak and push through the herd. Once on the other side, the reject snorts in thanks before wandering off.",
				"rewards": {
					"text": "Gain 1 [checkmark] each."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals.",
				"requirement": "[not] [trait] OUTCAST",
				"text": "You ignore the lone Kivak and the crazy shepherd, instead pushing through the herd. They stand strong, and their stone skin makes passage akin to squeezing through a tight cave. Finally, you emerge exhausted on the other side of the herd.",
				"rewards": {
					"text": "All characters start the next scenario with [impair] and [damage] 2."
				}
			}
		}
	},
	"WR-12": {},
	"WR-13": {},
	"WR-14": {},
	"WR-15": {},
	"WR-16": {
		"text": "<p>Screaming is usually a pretty good indication something is wrong, and an Algox battle cry is a good reason to hurry up and get involved. Breaking into a full sprint through the snowy road, you quickly find an overturned cart surrounded by bright white Algox hides. A short distance away, you spot four Algox bandits attacking a Valrath.</p><p>You shout to distract them from the bloodied Valrath. The good news is it worked—they stop attacking the Valrath. The bad news is that it worked—they’re now very focused on you.</p><p>They growl as you circle each other, both groups waiting for the other to make a move. The Valrath whimpers in pain between you.</p>",
		"options": {
			"A": {
				"trigger": "Don’t let any of these bandits near the injured traveler. Take up a defensive position around the Valrath.",
				"text": "Your top priority is to defend this Valrath. You take up a defensive position and bear your weapons. The Algox initiate a few attacks, but seeing your resolute defense of the traveler, they break off, collect the hides from around the cart, and retreat into the woods. Once you’re sure it’s safe, you check on the Valrath. The wounds are too severe and you can’t tend to them fast enough. You search the body—the dead have no need for material possessions.",
				"rewards": {
					"text": "Gain “Skinning Knife” [item_231]."
				}
			},
			"B": {
				"trigger": "The best defense is a good offense. Charge in and bring the fight to them.",
				"text": "You charge at the Algox, hoping to drive them off quickly so you can come back to tend to the Valrath. These towering bandits are holding their own, putting up a ferocious fight, when they suddenly flee into the woods. Confused, you turn around just in time to see a fifth Algox dragging the Valrath into the woods. You try to track them, but the robbers are very adept at covering their tracks in the snow, and you soon lose the trail. The Valrath might be gone, but the overturned cart is still there.",
				"rewards": {
					"text": "Gain 1 [hide] each.<br/>Lose 1 morale."
				}
			}
		}
	},
	"WR-17": {
		"text": "<p>A gnarled Orchid stands in the middle of the road, watching you approach. A ratty cloak barely covers her shoulders, but she doesn’t seem to mind the cold air. She beckons you closer, then quietly recites something under her breath.</p><p>“May your words never falter,<br/>When you face the crystal altar,<br/>They will not agree…”</p><p>She pauses before finishing, staring you down with deep blue eyes and urging you to step within whispering distance.</p>",
		"options": {
			"A": {
				"id": "",
				"trigger": "Choose one player now to hear the secret. Hand the card to them to read the conclusion.",
				"text": "<p>The Orchid leans in close and whispers something only you can hear.</p><p><strong>STOP READING THIS CARD ALOUD. THE CONCLUSION IS FOR YOU AND YOU ALONE.</strong></p><p>“—but speak Option Sea.” She nods, then continues on her way.</p><p>As though in some kind of trance, you cannot reveal the information to your companions. They ask what you learned, you simply respond, “Nothing important.”</p>",
				"rewards": {
					"text": "<p>You may only reveal the contents of this card when the time comes and you are faced with the crystal altar.</p><p>Add event WR-34 to the winter road deck.</p>"
				}
			}
		}
	},
	"WR-18": {
		"text": "<p>“Mer-canaries! You help! Help Hurdle, yes!”</p><p>The snow-wizened Vermling calling himself Hurdle rushes up to you with such speed that you think he might attack, but he stops short, waving his arms indignantly.</p><p>“Tonight is soup! Jeremy hide food for soup night, but forgot hiding spots. STUPID Jeremy!” Hurdle shouts at a tree behind you. Following his gaze you see Jeremy, a red squirrel, sitting on a branch. Jeremy chitters back angrily, clearly masking embarrassment.</p><p>“Stupid Jeremy lost food, and now finding it is up to Hurdle. Hurdle… and greedy mer-canaries!” Hurdle grins, sweeping his arm to indicate a nearby clearing. “Jeremy leave food all over! I reward mer-canary who digs up most! Berries, and nuts, and eggs…” Hurdle pauses, scrunching up his nose. “On second thought, don’t dig up eggs.”</p>",
		"options": {
			"A": {
				"trigger": "Help Hurdle dig up Jeremy’s hidden food.",
				"text": "<p>You sigh and heft your shovel. You suppose this is what they mean when they say “No job is too small.”</p>",
				"rewards": {
					"text": "<p>All characters each take one turn drawing as many cards as they want from the monster attack modifier deck, one at a time, until they choose to stop. If a character draws a null card, they’ve unearthed an old egg, and their number of drawn cards is considered O. Shuffle the entire monster attack modifier deck between each turn.</p><p>Characters are then awarded the following, based on who drew the most cards (tied characters gain the full rewards of their shared rank):</p><p>1st: Gain 12 experience.<br/>2nd: Gain 6 gold.<br/>3rd: Gain 2 [lumber].<br/>4th: Gain 1 [hide].</p><p>If you collectively drew at least Cx3 cards, Hurdle is overjoyed: add a [plus1sticker] sticker to one [axenut] loot card (the card gives one extra [axenut] when resolved).</p>"
				}
			},
			"B": {
				"trigger": "Offer to share your own rations instead.",
				"text": "You’re a sell-sword, not a sell-shovel. Still, you’re happy to bail Jeremy out of an embarrassing situation, so you volunteer some of your own supplies. Hurdle snatches up your offering and scurries off in a huff, muttering that next time will be “Jeremy soup.”",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			}
		}
	},
	"WR-19": {
		"text": "<p>ding, diNG, dING, DING! A lone bell rings from somewhere down a crevasse. You make your way down the mountainside and find a metal vessel mostly-buried at the bottom. Attached to the top of the vessel and floating without explanation is a red canvas balloon large enough to fit a building inside.</p><p>DING! DING! DING! A brass bell clangs for your attention—sounds like someone inside needs your help. With a crank, the hatch pops open, and a hiss of air passes through.</p><p>“Thank you!” A stocky Quatryl woman crawls out of the hatch. “My aeronautical hit some rough clouds, and I couldn’t blow my emergency hatch. Been a while… I tell you, that bell was the best investment in this thing—I use it more than the steering wheel!” She looks around. “Was worried I was being rescued by a bunch of Lurkers. I’m strictly opposed to being a snack.”</p><p>She pulls a device from her pocket and scans the horizon. “It’s actually a decent hour to get back into the sky… could I impose on you a bit more to dig out my crash landing in exchange for a ride closer to your destination?” She gestures into the confined space of the aeronautical.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Help her dig out the remainder and set the aeronautical back into the air without you.",
				"requirement": "<p>[trait] STRONG",
				"text": "The Quatryl waves her thanks and seals the hatch as you dig out the last of the aeronautical. A burst of flame erupts from the top of the craft, inflating the red canvas balloon. Flapping metal wings unfurl and it vanishes majestically into the distance.</p><p>A few minutes later you think you hear a phantom ringing of a bell. Probably nothing.</p>",
				"rewards": {
					"text": "No effect."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Help her dig out the remainder and set the aeronautical back into the air without you.",
				"requirement": "[not] [trait] STRONG",
				"text": "You eventually pry the aeronautical free, but the effort takes its toll. By the time the Quatryl seals the hatch for takeoff the sun is setting.",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			},
			"B": {
				"trigger": "Take her up on the lift—what’s the worst that could happen?",
				"text": "You dig out the aeronautical and cram into the restricted interior. The Quatryl just barely seals the hatch with you all inside and struggles to start up the machine with the extra weight. It’s claustrophobic, but after it gets airborne much of the terror subsides. The descent is violent but you arrive in one piece closer to your destination.",
				"rewards": {
					"text": "All characters without [trait] QUATRYL or VERMLING start the next scenario with [impair]."
				}
			}
		}
	},
	"WR-20": {
		"text": "<p>The sky has turned a perfect, uniform gray as the snowfall of a blizzard blots out any vision more than an arms-length ahead. The flurries hide his presence until you’re right on top of him, but seated in deep meditation is an Orchid. While they have a frail humanoid appearance, they gain the majority of their sustenance from direct contact with the ground as a plant would, growing beautiful crystalline structures across their skin if they remain sedentary. Judging by the length and prominence of the crystals on this Orchid’s head and arms, he’s been seated here meditating for a very long time—perhaps years.</p><p>Although he shows no signs of noticing, the snow has begun to accumulate on him. Unfortunately the weather has left you turned around and without a bit of help you’re as likely to be heading away from your destination as towards it.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Wake the Orchid to ask directions.",
				"requirement": "[trait] ORCHID",
				"text": "You begin a low, lilting hum. Orchids use it as something ofa reverse-lullaby, a melody to gently wake someone in deep meditative slumber. The Orchid slowly rouses itself to the tune, opening one eye with a smile. After a long, dramatic stretch he’s happy to provide directions to your destination",
				"rewards": {
					"text": "Gain 5 experience each."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Wake the Orchid to ask directions.",
				"requirement": "[not] [trait] ORCHID",
				"text": "You brush the snow off the Orchid, then tap gently on his crystalline head. That leads to more insistent knocking, and finally a light shake. When he finally jolts awake, he’s startled and furious. You do your best to apologize, and he points you in the right direction.",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Leave the Orchid to his meditation and find your own way.",
				"requirement": "[trait] CHAOTIC or RESOURCEFUL",
				"text": "The sun is gone, and the world is a sea of white, but you are at home in the confusion and know exactly how to handle the situation. You trace your steps back the way you came and reorient yourself based on your rapidly fading footprints. It’s a cold trip but you make it to your destination.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle]."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Leave the Orchid to his meditation and find your own way.",
				"requirement": "[not] [trait] CHAOTIC or RESOURCEFUL",
				"text": "It can’t be that difficult to find a way through this blizzard. You head back the way you came for a few steps, then strike out toward what you’re sure is the right direction. It is not, and by the time you’ve determined where you are, you’re numb with cold.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle] and [damage] 2."
				}
			}
		}
	},
	"WR-21": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-22": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-23": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-24": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-25": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-26": {
		"unlockedBy": { "section": { "id": "129.3" }},
		"text": "<p>You’ve been hiking for a long time. In fact, you should have reached your destination long ago, but still the path stretches on ahead.</p><p>Now that you think of it, you’re certain you’ve seen that copse of trees before.</p><p>After another hour of telling yourselves that the destination must be around the next bend, you’re forced to admit it: you’re lost.</p><p>You pause to weigh your options. It might be better to stop and orient yourselves once the stars come out… but your supplies are already dwindling from the overlong journey, and waiting for nightfall would take up valuable time you don’t have.</p>",
		"options": {
			"A": {
				"trigger": "Press on—it’s got to be around here somewhere.",
				"text": "You don’t have time or supplies to waste. You set forth with renewed vigor and are eventually rewarded: you emerge from the underbrush at the top of a hill to behold a magnificent view of the surrounding wilderness. Not only does it set you on the right path, it fills you with a sense of wonder.",
				"rewards": {
					"text": "Gain 1 inspiration.<br/>All characters start the next scenario discarding one card."
				}
			},
			"B": {
				"trigger": "Camp until night and try to navigate by the stars.",
				"text": "<p>You wait until nightfall—it’s not a long wait this time of year. You peer through the rippling aurora as the stars emerge, trying to make sense of where you are.</p>"
			},
			"B1": {
				"id": "B",
				"requirement": "[trait] CHAOTIC",
				"text": "Yes, the darkness of night is definitely more your thing. You embrace the uncertainty of the situation and follow your gut. It doesn’t lead you astray.",
				"rewards": {
					"text": "Gain 1 inspiration."
				}
			},
			"B2": {
				"id": "B",
				"requirement": "[not] [trait] CHAOTIC",
				"text": "You think you’ve got it figured out… until you realize the constellation you thought you were following isn’t even in the sky this time of year. Hopes dashed, you make camp and try again in the morning.",
				"rewards": {
					"text": "All characters start the next scenario with [damage] 2.<br/>Read outcome A."
				}
			}
		}
	},
	"WR-27": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-28": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-29": {
		"unlockedBy": { "section": { "id": "129.3" }}
	},
	"WR-30": {
		"unlockedBy": { "section": { "id": "129.3" }},
		"text": "<p>The sun is disappearing behind the mountains for the evening. You set your pack down on a rock embedded in the snow and start setting up camp.</p><p>CRACK! The weight of your pack was just enough to break the rock free of the snow and ice, creating a small avalanche and sending your supplies tumbling off a cliff.</p><p>Winter days are brutally cold, but without a source of warmth, winter nights are deadly. You’re unprepared in unfamiliar territory, sunlight is dwindling, and you can already feel your fingertips going numb. If you don’t find a way to warm up or find a way through this darkness, you’re going to have a rough night.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Search the remains of what you brought with you for a way to generate heat and light.",
				"requirement": "[trait] RESOURCEFUL",
				"text": "You are able to stretch the meager supplies and keep everyone warm through the night.",
				"rewards": {
					"text": "No effect."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Search the remains of what you brought with you for a way to generate heat and light.",
				"requirement": "[not] [trait] RESOURCEFUL",
				"text": "You have to make some hard decisions, but it’s this or freeze.",
				"rewards": {
					"text": "All characters start the next scenario either discarding one card with [fire] or [light] or suffer [damage] 3.<br/>Also infuse [ice] at the start of the next scenario."
				}
			},
			"B": {
				"trigger": "Give up and hike back to Frosthaven.",
				"text": "You’ll never make it through the night. The only way to keep warm is to keep moving, and without your supplies there’s nothing you can do but turn back.",
				"rewards": {
					"text": "All characters start the next scenario discarding two cards.<br/>Resolve another winter road event."
				}
			}
		}
	},
	"WR-31": {},
	"WR-32": {},
	"WR-33": {},
	"WR-34": {
		"unlockedBy": { "event": { "id": "WR-17" }}
	},
	"WR-35": {
		"unlockedBy": { "event": { "id": "WR-05" }}
	},
	"WR-36": {},
	"WR-37": {
		"unlockedBy": { "event": { "id": "SR-15" }}
	},
	"WR-38": {
		"unlockedBy": { "event": { "id": "SR-15" }},
		"text": "<p>You’re walking along the trail when you hear the unmistakable howl of hounds from behind you. You try to hustle to keep ahead of them, scrambling along the snowy path, but their excited yips make clear they’re gaining on you. From the sounds of it, there’s a full pack massing to attack.</p><p>Perched at the top of the ridgeline, you see a familiar-looking Algox. Time has not been kind to him, but you’re certain it’s Malrog, the young Algox you helped so long ago.</p>",
		"options": {
			"A": {
				"trigger": "Stand your ground.",
				"text": "<p>You find an open enough area to make your stand. The hounds rush into the clearing and circle around your party, each waiting for another to make the first move. Malrog silently watches as you batter back wave after wave, fighting for your life. Finally, the exhaustion setting in and your guard down, the last of the hounds jumps toward you only to be cut down by a well-placed arrow from Malrog’s bow.</p><p>“You honored me with your assistance some time ago, and an Algox doesn’t forget.” He throws a fresh kill at your feet. “As repayment. My debt is cleared.”</p>",
				"rewards": {
					"text": "Gain 3 collective [hide].<br/>All characters start the next scenario with [wound]."
				}
			},
			"B": {
				"trigger": "Call up to the Algox for help.",
				"text": "<p>You shout up to Malrog, who obliges with a flurry of blue-feathered arrows from his bow. The hounds scatter, uninterested in a fight they’re not sure to win.</p><p>“You honored me with your assistance some time ago, and an Algox doesn’t forget. Regardless of your appearance, you will always be among my Algox friends.”</p><p>He drops a fresh kill at your feet. “I wish you safe travels.”</p>",
				"rewards": {
					"text": "Gain 2 collective [hide]."
				}
			}
		}
	},
	"WR-39": {
		"unlockedBy": { "event": { "id": "SR-15" }},
		"text": "<p>You’re walking along the trail when you hear the unmistakable howl of hounds from behind you. You try to hustle to keep ahead of them, scrambling along the snowy path, but their excited yips make clear they’re gaining on you. From the sounds of it, there’s a full pack massing to attack.</p><p>Perched at the top of the ridgeline, you see a familiar-looking Algox. He’s older, and time certainly has not been kind to him, but you’re certain it’s Malrog, the young Algox you refused to help so long ago.</p>",
		"options": {
			"A": {
				"trigger": "Stand your ground.",
				"text": "<p>You find an open enough area to make your stand. The hounds rush into the clearing and circle around your party, each waiting for another to make the first move. Malrog silently watches as you batter back wave after wave, fighting for your life. Finally, the exhaustion setting in and your guard down, the last of the hounds jumps toward you, and you barely beat it away. Still Malrog watches.</p><p>“You taught me an important lesson about self-sufficiency, and I am thrilled you’ve been able to learn the same lesson. Until we meet again.”</p>",
				"rewards": {
					"text": "All characters start the next scenario with [wound], [brittle], [impair], and discard one card."
				}
			},
			"B": {
				"trigger": "Call up to the Algox for help.",
				"text": "<p>You shout up to Malrog, asking for help in the face of impossible odds. “You taught me an important lesson about self-sufficiency, and I would not dishonor you by preventing your own education.”</p><p>The hounds circle your party and attack, a maelstrom of bites and claws, as Malrog silently watches from his perch. You fight for your lives as the exhaustion sets in, and still Malrog refuses to do more than observe. You barely beat back the last of the hounds and see that Malrog has turned to leave.</p><p>“Until we meet again.”</p>",
				"rewards": {
					"text": "All characters start the next scenario with [wound], [brittle], [impair], and discard one card."
				}
			}
		}
	},
	"WR-40": {},
	"WR-41": {
		"unlockedBy": { "section": { "id": "25.2" }}
	},
	"WR-42": {},
	"WR-43": {
		"unlockedBy": { "event": { "id": "SO-59" }},
		"text": "<p>As you follow the road deeper into the woods, you hear a commotion off the path. After a bit of bushwhacking, you find a small, well-hidden Vermling village that looks like it has seen better days.</p><p>To your left, you see a small group hammering away on the roof of a small building. It looks like the thatching caved in under the weight of a recent snowstorm, and they still have a lot of work left to do before it’s weatherproof.</p><p>To your right, another group is sitting around a large fire with several pots of stew simmering over the flame. Looks like they’re trying to make enough food to get themselves through the next snowstorm. The smell wafts over to you. It smells delicious.</p><p>You’ve gotten into plenty of fights with Vermlings, but this pack seems like they could use a hand.</p>",
		"options": {
			"A": {
				"trigger": "Help with repairs.",
				"text": "You climb up and start helping with the repairs. A few minutes later, two Vermlings start arguing over whose turn it is to use a hammer. You walk over to break up the fight, but it seems like Vermling rooftops aren’t really that strong to begin with. With a loud crack, the board you’re standing on snaps in half, and you fall through. The Vermlings crowd around you—half of them wanting to make sure you’re okay, and the other half upset at you for undoing all their work.",
				"rewards": {
					"text": "All characters start the next scenario with [damage] 2."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Help with the cooking.",
				"requirement": "[trait] VERMLING",
				"text": "You catch a whiff of the meal they’re cooking and recognize it immediately! It’s Black Imp stew—your mother used to make it for the whole nest when you were young.",
				"rewards": {
					"text": "All [trait] VERMLING characters start the next scenario with [ward] and [bless]."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Help with the cooking.",
				"requirement": "[not] [trait] VERMLING",
				"text": "You offer to tend to the stew. The Vermlings are surprised, but happy for the help. After a few minutes of stirring, you taste it to see if it’s ready… and start vomiting within seconds. A Vermling mutters, “Most species can’t handle Black Imp meat like we can. Delicate stomachs.”",
				"rewards": {
					"text": "All characters start the next scenario with [poison]."
				}
			}
		}
	},
	"WR-44": {
		"unlockedBy": { "section": { "id": "193.1" }},
		"text": "<p>“Good to meet you. I’m Hail. Unless we’ve met before, in which case… uh, well, I’m still Hail.” A translucent Aesther is blocking the road in front of you. “You’re mercenaries, right? This sheer, icy cliff leads to the Crimson Plant Grove. I want you to climb up there and bring back a red one of that one plant. You know?” You do not know, but she’s willing to draw you a picture.</p><p>After a few hours of climbing, you uncrumple the drawing of the plant you’re looking for and… well, it leaves a lot to be desired.</p><p>It looks like there’s red axenuts and red corpsescaps here. She was very insistent that the Crimson Plant Grove is precious and you shouldn’t take more than one. Which do you bring back to Hail?</p>",
		"options": {
			"A": {
				"trigger": "The red axenut.",
				"text": "<p>“Perfect, thank y—wait, is that an axenut? I specifically said I wanted a red corpsescap.” Hail looks at you with intense scorn and sighs longer and louder than you think is necessary. You try to explain that she drew an axenut.</p><p>“The audacity…” she mutters, examining her drawing, which suddenly appears in her hand. “You were holding it upside down. Oh, look, just forget the whole thing.” She pops open a small portal to the top of the cliff and reaches through to pluck the red corpsescap. “I’ll just do it myself.”</p>",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			},
			"B": {
				"trigger": "The red corpsescap.",
				"text": "<p>“Perfect,” she says as the red corpsescap you were holding suddenly appears in her hand. She gives it a big sniff. “Yes, this should do nicely…” She breaks off a small chunk and hands it to you. “Chew on that.”</p><p>It has a spongy, icy texture that melts to a distinct aftertaste of ash. “Don’t say I never gave you anything.” With that, she splits a portal open in the air and steps through to an alley in front of a decrepit tavern in a city that looks nice and warm. It snaps shut behind her.</p>",
				"rewards": {
					"text": "All characters start the next scenario with [ward] and [strengthen]."
				}
			}
		}
	},
	"WR-45": {
		"unlockedBy": [{ "section": { "id": "143.2" }}, { "section": { "id": "164.2" }}]
	},
	"WR-46": {
		"unlockedBy": { "section": { "id": "116.3" }},
		"text": "<p>The spot Eddica the Librarian marked out for you was certainly easy to find: you just had to make your way toward the ominous column of smoke and ash billowing out of the top of the hillside. The hike up was treacherous and the snow underfoot frequently crumbled away to dark pits you’d prefer not to explore. Cresting the lip of the caldera reveals a single pillar with a stone dome on top. A pool of lava swirls around the pillar and gives off a brazen heat.</p><p>You approach the dome to lift the heavy covering and the boiling rock recedes to allow you passage. Underneath is a tome covered in a beautifully-sculpted cover—the piece looks like a work of art. Images of the elements are carved into the rough Kivak leather as a ring of familiar circles, and ornate citrine studs bind it together. It is warm, and inviting, and impossibly light. It is breathtaking. This is the Tome of the Elements.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Open the tome to learn its secrets.",
				"requirement": "[trait] ARCANE",
				"text": "You unlatch the tome and feel the thrum of power within it. It burns, it trembles, it screams in a conflicting storm of energy. You attune yourself to its contents and feel it swell through you.",
				"rewards": {
					"text": "Start the next scenario with all elements in the strong column.<br/>Add [section_44.4] to the calendar in one week.",
					"removedEvents": {
						"WR": [{ "id": "SR-48" }]
					}
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Open the tome to learn its secrets.",
				"requirement": "[not] [trait] ARCANE",
				"text": "From the instant you break open the binding, the elemental energy of the tome swells through your being, ripping through your insides indiscriminately. You feel a gust of wind travel under your skin, you feel the searing intensity of the sun. Every nerve, every piece of you fills with the terrifying churn of power. And then—as quickly as it began—it stops, leaving you to catch your breath in short gasps.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle] and [damage] 3.<br/>Add [section_44.4] to the calendar in one week.",
					"removedEvents": {
						"WR": [{ "id": "SR-48" }]
					}
				}
			},
			"B": {
				"trigger": "Bring the book back to Eddica for her informed review.",
				"text": "You remember Eddica’s warning and quickly stow the book in your satchel without opening it. She’ll be in a better position to unlock the power within.",
				"rewards": {
					"text": "Add [section_44.4] to the calendar in one week.",
					"removedEvents": {
						"WR": [{ "id": "SR-48" }]
					}
				}
			}
		}
	},
	"WR-47": {
		"unlockedBy": { "section": { "id": "89.2" }}
	},
	"WR-48": {},
	"WR-49": {}
}