{
	"WR-06": {
		"text": "<p>A translucent Aesther wearing hunter's garb is studying some tracks on the path, and turns to catch your attention as you approach. \"You there! A moment of your time!\" He flags you down. \"I've been searching for a Vermling by the name of Dramm. About yea high. Have you seen him?\"</p><p>When you don't immediately respond, he thumbs a wicked-looking blade and continues: \"You see, this particular Vermling killed someone quite dear to me, and I promised that I would return the favor.\" The Aesther's eyes flash a dark longing.</p>",
		"options": {
			"A": {
				"trigger": "Agree to keep an eye out for him.",
				"text": "<p>You assure the Aesther hunter that you'll keep an eye out for the Vermling killer. He smiles.</p><p>\"My thanks. I am Malak. If you do locate him I ask only that you call for me so I can finish my task at last.\"</p>",
				"rewards": {
					"events": {
						"SR": [{ "id": "SR-36" }]
					},
					"removedEvents": {
						"SR": [{ "id": "SR-08" }]
					}
				}
			},
			"B": {
				"trigger": "No, you haven't seen him.",
				"text": "You tell the Aesther you haven't seen Dramm. His eyes linger on you a bit too long, trying to determine whether you're lying, but ultimately he shrugs and accepts your statement with a disconcerting smile. You hurry on to your destination.",
				"rewards": {
					"text": "No effect."
				}
			}
		}
	},
	"WR-08": {
		"text": "<p>The giant boughs of the willowburn tree hang low, heavy with the ice of the season. This picturesque grotto features an iced-over pond. During the warmer season, it would be fed by a waterfall, which is now frozen and anchored to th cliff face overlooking the area.</p><p>The ice over the pond is sturdy and supports your weight easily. The frozen waterfall beckons you closer with an unnatural blue light, and as you approach you can see glowing shapes moving behind the ice—it's a cave of some sort, now sealed off. The ice is much too thick to get a decent look, but you can feel a supernatural chill that turns your stomach.</p><p>The waterfall likely hasn't run since summer and has a rough surface that would be perfect for climbing. The top would put you right underneath the willowburn branches.</p>",
		"options": {
			"A": {
				"trigger": "Make camp in the middle of the iced-over pond.",
				"text": "You triple-check that the ice is frozen completely solid: the perfect place to set camp. Visibility is ideal in every direction, and you can make out the stars between the branches of the willowburn tree. you drift off to a peaceful night's sleep.",
				"rewards": {
					"text": "All characters start the next scenario with [bless]."
				}
			},
			"B": {
				"trigger": "Climb to the top of the waterfall and make camp overlooking the grotto.",
				"text": "The frozen waterfall provides easy handholds for climbing its surface, and before long, you're standing at the top, looking down on the grotto. You can even reach up and touch the willowburn tree branches. It looks like a great spot to make camp... before the buzzing starts. In a burst of angry yellow, thousands of bees swarm your party, driving you back down the waterfall. You're out of breath before they give up the chase.",
				"rewards": {
					"text": "All characters start the next scenario with [impair] and discard two cards."
				}
			}
		}
	},
	"WR-11": {
		"text": "<p>For as far as the eye can see, the view is the same: nothing but Kivak, pack animals known for their rocky skin and prominent horn. Hundreds, packed in together for warmth or comfort, block the path ahead of you. As you approach, they stop their grazing in an eerie unison, their heads turning in perfect concert. They refuse to part to allow you passage.</p><p>A Quatryl shephard in muddy overalls steps forward from the crowd. \"Yep. They'll let you through, but they want something in return.\" The Kivak blink in unison. You look at him, not understanding. \"It's a Kivak hive. All linked up,\" he says, as if this clarified things.</p><p>He rolls his eyes. \"Harrowers... they's a bunch a bugs that all work as one thing. Savvas is thinking rocks. Heck, even humans're just gray worms swimming around in a skull driving a skeleton around. This here's a buncha Kivak all as one. Anyways, they want something first.\" The animals part, leaving a single member of their group staring at you in the center of the clearing.</p><p>\"That one wronged the others. They want you to kill her.\" He shrugs. \"I understand 'em, but I can't say I understand 'em.\" The Kivak waits, unblinkingly.</p>",
		"options": {
			"A": {
				"trigger": "Kill the Kivak",
				"text": "You cut the doomed Kivak down. It doesn't move or cry out, having seemingly accepted its fate. The remaining Kivak part and allow you to pass, no longer interested in the proceedings. The shepherd mumbles as you go: \"Most Kivak just want to eat dirt and grass. O'course I get the weird ones.\"",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals",
				"requirement": "[trait] OUTCAST",
				"text": "You don't know what this solitary Kivak did to wrong the others, but you understand rejection by your peers. You grab the Kivak and push through the herd. Once on the other side, the reject snorts in thanks before wandering off.",
				"rewards": {
					"text": "Gain 1 [checkmark] each."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals",
				"requirement": "[not] [trait] OUTCAST",
				"text": "You ignore the lone Kivak and the crazy shepherd, instead pushing through the herd. They stand strong, and their stone skin makes passage akin to squeezing through a tight cave. Finally, you emerge exhausted on the other side of the herd.",
				"rewards": {
					"text": "All characters start the next scenario with [impair] and [damage] 2."
				}
			}
		}
	},
	"WR-18": {
		"text": "<p>\"Mer-canaries! You help! Help Hurdle, yes!\"</p><p>The snow-wizened Vermling calling himself Hurdle rushes up to you with such speed that you think he might attack, but he stops short, waving his arms indignantly.</p><p>\"Tonight is soup! Jeremy hide food for soup night, but forgot hiding spots. STUPID Jeremy!\" Hurdle shouts at a tree behind you. Following his gaze you see Jeremy, a red squirrel, sitting on a branch. Jeremy chitters back angrily, clearly masking embarrassment.</p><p>\"Stupid Jeremy lost food, and now finding it is up to Hurdle. Hurdle... and greedy mer-canaries!\" Hurdle grins, sweeping his arm to indicate a nearby clearing. \"Jeremy leave food all over! I reward mer-canary who digs up most! Berries, and nuts, and eggs...\" Hurdle pauses, scrunching up his nose. \"On second thought, don't dig up eggs.\"</p>",
		"options": {
			"A": {
				"trigger": "Help Hurdle dig up Jeremy's hidden food.",
				"text": "<p>You sigh and heft your shovel. You suppose this is what they mean when they say \"No job is too small.\"</p>",
				"rewards": {
					"text": "<p>All characters each take one turn drawing as many cards as they want from the monster attack modifier deck, one at a time, until they choose to stop. If a character draws a null card, they've unearthed an old egg, and their number of drawn cards is considered O. Shuffle the entire monster attack modifier deck between each turn.</p><p>Characters are then awarded the following, based on who drew the most cards (tied characters gain the full rewards of their shared rank):</p><p>1st: Gain 12 experience.<br/>2nd: Gain 6 gold.<br/>3rd: Gain 2 [lumber].<br/>4th: Gain 1 [hide].</p><p>If you collectively drew at least Cx3 cards, Hurdle is overjoyed: add a [plus1] sticker to one [axenut] loot card (the card gives one extra [axenut] when resolved).</p>"
				}
			},
			"B": {
				"trigger": "Offer to share your own rations instead.",
				"text": "You're a sell-sword, not a sell-shovel. Still, you're happy to bail Jeremy out of an embarrassing situation, so you volunteer some of your own supplies. Hurdle snatches up your offering and scurries off in a huff, muttering that next time will be \"Jeremy soup.\"",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			}
		}
	},
	"WR-19": {
		"text": "<p>ding, diNG, dING, DING! A lone bell rings from somewhere down a crevasse. You make your way down the mountainside and find a metal vessel mostly-buried at the bottom. Attached to the top of the vessel and floating without explanation is a red canvas balloon large enough to fit a building inside.</p><p>DING! DING! DING! A brass bell clangs for your attention—sounds like someone inside needs your help. With a crank, the hatch pops open, and a hiss of air passes through.</p><p>\"Thank you!\" A stocky Quatryl woman crawls out of the hatch. \"My aeronautical hit some rough clouds, and I couldn't blow my emergency hatch. Been a while... I tell you, that bell was the best investment in this thing—I use it more than the steering wheel!\" She looks around. \"Was worried I was being rescued by a bunch of Lurkers. I'm strictly opposed to being a snack.\"</p><p>She pulls a device from her pocket and scans the horizon. \"It's actually a decent hour to get back into the sky... could I impose on you a bit more to dig out my crash landing in exchange for a ride closer to your destination?\" She gestures into the confined space of the aeronautical.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Help her dig out the remainder and set the aeronautical back into the air without you.",
				"requirement": "[trait] STRONG",
				"text": "<p>The Quatryl waves her thanks and seals the hatch as you dig out the last of the aeronautical. A burst of flame erupts from the top of the craft, inflating the red canvas balloon. Flapping metal wings unfurl and it vanishes majestically into the distance.</p><p>A few minutes later you think you hear a phantom ringing of a bell. Probably nothing.</p>",
				"rewards": {
					"text": "No effect."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Help her dig out the remainder and set the aeronautical back into the air without you.",
				"requirement": "[not] [trait] STRONG",
				"text": "You eventually pry the aeronautical free, but the effort takes its toll. By the time the Quatryl seals the hatch for takeoff the sun is setting.",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			},
			"B": {
				"trigger": "Take her up on the lift—what's the worst that could happen?",
				"text": "You dig out the aeronautical and cram into the restricted interior. The Quatryl just barely seals the hatch with you all inside and struggles to start up the machine with the extra weight. It's claustrophobic, but after it gets airborne much of the terror subsides. The descent is violent but you arrive in one piece closer to your destination.",
				"rewards": {
					"text": "All characters without [trait] QUATRYL or VERMLING start the next scenario with [impair]."
				}
			}
		}
	},
	"WR-20": {
		"text": "<p>The sky has turned a perfect, uniform gray as the snowfall of a blizzard blots out any vision more than an arms-length ahead. The flurries hide his presence until you're right on top of him, but seated in deep meditation is an Orchid. While they have a frail humanoid appearance, they gain the majority of their sustenance from direct contact with the ground as a plant would, growing beautiful crystalline structures across their skin if they remain sedentary. Judging by the length and prominence of the crystals on this Orchid's head and arms, he's been seated here meditating for a very long time—perhaps years.</p><p>Although he shows no signs of noticing, the snow has begun to accumulate on him. Unfortunately the weather has left you turned around and without a bit of help you're as likely to be heading away from your destination as towards it.</p>",
		"options": {
			"A1": {
				"id": "A",
				"trigger": "Wake the Orchid to ask directions.",
				"requirement": "[trait] ORCHID",
				"text": "You begin a low, lilting hum. Orchids use it as something ofa reverse-lullaby, a melody to gently wake someone in deep meditative slumber. The Orchid slowly rouses itself to the tune, opening one eye with a smile. After a long, dramatic stretch he's happy to provide directions to your destination",
				"rewards": {
					"text": "Gain 5 experience each."
				}
			},
			"A2": {
				"id": "A",
				"trigger": "Wake the Orchid to ask directions.",
				"requirement": "[not] [trait] ORCHID",
				"text": "You brush the snow off the Orchid, then tap gently on his crystalline head. That leads to more insistent knocking, and finally a light shake. When he finally jolts awake, he's startled and furious. You do your best to apologize, and he points you in the right direction.",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Leave the Orchid to his meditation and find your own way.",
				"requirement": "[trait] CHAOTIC or RESOURCEFUL",
				"text": "The sun is gone, and the world is a sea of white, but you are at home in the confusion and know exactly how to handle the situation. You trace your steps back the way you came and reorient yourself based on your rapidly fading footprints. It's a cold trip but you make it to your destination.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle]."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Leave the Orchid to his meditation and find your own way.",
				"text": "It can't be that difficult to find a way through this blizzard. You head back the way you came for a few steps, then strike out toward what you're sure is the right direction. It is not, and by the time you've determined where you are, you're numb with cold.",
				"rewards": {
					"text": "All characters start the next scenario with [brittle] and [damage] 2."
				}
			}
		}
	}
}