{
	"WR-11": {
		"text": "<p>For as far as the eye can see, the view is the same: nothing but Kivak, pack animals known for their rocky skin and prominent horn. Hundreds, packed in together for warmth or comfort, block the path ahead of you. As you approach, they stop their grazing in an eerie unison, their heads turning in perfect concert. They refuse to part to allow you passage.</p><p>A Quatryl shephard in muddy overalls steps forward from the crowd. \"Yep. They'll let you through, but they want something in return.\" The Kivak blink in unison. You look at him, not understanding. \"It's a Kivak hive. All linked up,\" he says, as if this clarified things.</p><p>He rolls his eyes. \"Harrowers... they's a bunch a bugs that all work as one thing. Savvas is thinking rocks. Heck, even humans're just gray worms swimming around in a skull driving a skeleton around. This here's a buncha Kivak all as one. Anyways, they want something first.\" The animals part, leaving a single member of their group staring at you in the center of the clearing.</p><p>\"That one wronged the others. They want you to kill her.\" He shrugs. \"I understand 'em, but I can't say I understand 'em.\" The Kivak waits, unblinkingly.</p>",
		"options": {
			"A": {
				"trigger": "Kill the Kivak",
				"text": "You cut the doomed Kivak down. It doesn't move or cry out, having seemingly accepted its fate. The remaining Kivak part and allow you to pass, no longer interested in the proceedings. The shepherd mumbles as you go: \"Most Kivak just want to eat dirt and grass. O'course I get the weird ones.\"",
				"rewards": {
					"text": "No effect."
				}
			},
			"B1": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals",
				"requirement": "[trait] OUTCAST",
				"text": "You don't know what this solitary Kivak did to wrong the others, but you understand rejection by your peers. You grab the Kivak and push through the herd. Once on the other side, the reject snorts in thanks before wandering off.",
				"rewards": {
					"text": "Gain 1 [checkmark] each."
				}
			},
			"B2": {
				"id": "B",
				"trigger": "Refuse and force your way through the sea of animals",
				"requirement": "[not] [trait] OUTCAST",
				"text": "You ignore the lone Kivak and the crazy shepherd, instead pushing through the herd. They stand strong, and their stone skin makes passage akin to squeezing through a tight cave. Finally, you emerge exhausted on the other side of the herd.",
				"rewards": {
					"text": "All characters start the next scenario with [impair] and [damage] 2."
				}
			}
		}
	},
	"WR-18": {
		"text": "<p>\"Mer-canaries! You help! Help Hurdle, yes!\"</p><p>The snow-wizened Vermling calling himself Hurdle rushes up to you with such speed that you think he might attack, but he stops short, waving his arms indignantly.</p><p>\"Tonight is soup! Jeremy hide food for soup night, but forgot hiding spots. STUPID Jeremy!\" Hurdle shouts at a tree behind you. Following his gaze you see Jeremy, a red squirrel, sitting on a branch. Jeremy chitters back angrily, clearly masking embarrassment.</p><p>\"Stupid Jeremy lost food, and now finding it is up to Hurdle. Hurdle... and greedy mer-canaries!\" Hurdle grins, sweeping his arm to indicate a nearby clearing. \"Jeremy leave food all over! I reward mer-canary who digs up most! Berries, and nuts, and eggs...\" Hurdle pauses, scrunching up his nose. \"On second thought, don't dig up eggs.\"</p>",
		"options": {
			"A": {
				"trigger": "Help Hurdle dig up Jeremy's hidden food.",
				"text": "<p>You sigh and heft your shovel. You suppose this is what they mean when they say \"No job is too small.\"</p>",
				"rewards": {
					"text": "<p>All characters each take one turn drawing as many cards as they want from the monster attack modifier deck, one at a time, until they choose to stop. If a character draws a null card, they've unearthed an old egg, and their number of drawn cards is considered O. Shuffle the entire monster attack modifier deck between each turn.</p><p>Characters are then awarded the following, based on who drew the most cards (tied characters gain the full rewards of their shared rank):</p><p>1st: Gain 12 experience.<br/>2nd: Gain 6 gold.<br/>3rd: Gain 2 [lumber].<br/>4th: Gain 1 [hide].</p><p>If you collectively drew at least Cx3 cards, Hurdle is overjoyed: add a [plus1] sticker to one [axenut] loot card (the card gives one extra [axenut] when resolved).</p>"
				}
			},
			"B": {
				"trigger": "Offer to share your own rations instead.",
				"text": "You're a sell-sword, not a sell-shovel. Still, you're happy to bail Jeremy out of an embarrassing situation, so you volunteer some of your own supplies. Hurdle snatches up your offering and scurries off in a huff, muttering that next time will be \"Jeremy soup.\"",
				"rewards": {
					"text": "All characters start the next scenario discarding one card."
				}
			}
		}
	}
}