{
	"loggingcamp": {
		"number": "17",
		"name": "Logging Camp",
		"levels": {
			"1": {},
			"2": {},
			"3": {},
			"4": {}
		}
	},
	"craftsman": {
		"number": "34",
		"name": "Craftsman",
		"levels": {
			"1": {},
			"2": {},
			"3": {},
			"4": {},
			"5": {},
			"6": {},
			"7": {},
			"8": {},
			"9": {}
		}
	},
	"workshop": {
		"number": "84",
		"name": "Workshop",
		"levels": {
			"1": {}
		}
	},
	"boat": {
		"name": "Boat",
		"levels": {
			"0": {
				"builtSection": { 
					"id": "139.2",
					"title": "Boat Built",
					"text": "<p>The shipyard hums with activity, somewhat literally in the case of the Harrower carpenter, who has been hired to construct your boat. As a swarm of unified insects, the Harrower has spent the last few days slicing planks of wood, then bending the pieces into shape with the help of other workers. It’s a respectable, single-mast ship with enough room for a small crew to make a brief voyage north. Until now, a part of you had hoped the carpenter wouldn’t pull it off and that you’d be saved from venturing into these frigid waters. But seeing the ship here, all properly rigged up and sealed with fresh pitch, your mood brightens. Now, all you need is a crew.</p><p>“Captain Philip Doghogger, at your service!” You turn back toward the gate. The human walking toward you is the height of a child, but the weathered look on his face makes his age clear.</p><p>“Satha mentioned ye needed an old salt,” the man continues cheerily. He seems confident that he’s already been hired. “Delighted to have a ship to captain once again. Been lookin’ fer a new steed since my own ship met an unfortunate end a few months back. I’m sure this one won’t be torn apart by a giant starfish, eh?” He laughs, but there is sadness there.</p><p>“Now, whaddya call this beauty?” The sailor brightens again, offering a bottle of brackish alcohol. “G’head, pick a name. Bad luck to set forth on an unnamed vessel!”</p><p>You smash the bottle on the hull and watch as the carpenter and their assistants launch the ship into the chilly waters. Captain Doghogger takes some time to inspect the rigging and secure a crew, but after only half a day, you’re ready to brave the icy sea and leave Frosthaven behind you.</p>",
					"rewards": "<strong><p>Open envelope B.</p><p>Place “Boat” campaign sticker on the town map at location A. You may now play scenarios with the [boat] requirement. Name your boat, then write it on the sticker and the front of B-01 and B-02 in the blanks.</p><p>Shuffle events B-01 to 13 together and use them to create the boat event deck. Store this deck in envelope B when not in use and use the card divider to separate the boat event deck from the other boat event cards.</p><p>Gain 1 prosperity.</p></strong>"
				}
			}
		}
	},
	"sled": {
		"name": "Sled",
		"levels": {
			"0": {
				"builtSection": { 
					"id": "169.2",
					"title": "Sled Built",
					"text": "<p>With the sled complete, you can now safely venture farther out into the tundra. Captain Olmstead joins you for a test run on a borrowed scouting sled from the town guard, and you can’t help but enjoy the taste of the crisp morning air. The Captain eyes the next hill and gives a wry smile.</p><p>“Your new sled might outmatch the design of mine, but there’s no substitute for experience.” He cracks his neck. “Let’s make it interesting… first to that tree line over there buys the next round.” Before you have a chance to agree—or even spot the tree line in question, Olmstead has egged his dogs on down the hill.</p><p>You push off in pursuit, but by the time you make it to the tree line your competition is nowhere to be seen. Then you spot him: seated on a log just inside the shelter of the snowy tree canopy is Captain Olmstead sharing a canteen of water with his panting sled dogs.</p><p>“Hah! Glad we understand there’s still a thing or two you mercenaries can learn from this old-timer.”</p>",
					"rewards": "<strong><p>Place “Sled” campaign sticker on the town map at location B. You may now play scenarios with the [sled] requirement.</p><p>Gain 1 prosperity.</p></strong>"
				}
			}
		}
	},
	"climbinggear": {
		"name": "Climbing Gear",
		"levels": {
			"0": {
				"builtSection": { 
					"id": "161.1",
					"title": "Climbing Gear Built",
					"text": "<p>Despite its apparent hostility, the landscape surrounding Frosthaven calls for exploration. Now that some climbing gear has been constructed, you have the means to access new horizons high up in the mountains.</p><p>Inside the shop, you encounter the Harrower carpenter hard at work. The horde of insects which makes up their shape flits around, braiding together fibers for rope. “When we’re finished,” they say in their chittery voice, “this rope will be able to withstand the weight of one hundred thousand bees.”</p><p>You must look nervous. Their shape flutters with humor. “Don’t worry. That means it will hold you, too.”</p><p>You dearly hope so, because you can’t picture one hundred thousand bees scaling a mountain anytime soon.</p>",
					"rewards": "<strong><p>Place “Climbing Gear” campaign sticker on the town map at location C. You may now play scenarios with the [climbinggear] requirement.</p><p>Gain 1 prosperity.</p></strong>"
				}
			}
		}
	},
	"carpenter": {
		"number": "85",
		"name": "Carpenter",
		"levels": {
			"1": {
				"builtSection": {
					"id": "7.3",
					"title": "Carpenter Built",
					"text": "<p>A wood-carving contest inaugurates the opening of the carpenter’s shop. You wander among booths displaying inlaid trinket boxes and cooking utensils alongside life-size replicas of Lurkers and polar bears. The pavilion is filled with the sounds of hacking and sawing.</p><p>One carpenter is a Harrower, whose undulating insect form obscures a large chunk of wood, chipping away with their collective mandibles. Once they recollect themselves into a vaguely humanoid shape, they reveal their project: a to-scale model of Frosthaven. “We will keep adding to it,” they hum at you, “as long as you keep doing so.” With the carpenters, they note, constructing buildings will now be less costly.</p><p>A few of their insects pick up small cylinders of wood, which they carve instantly into a miniature version of you. They place your model in the center of the Frosthaven replica. After all, the Harrower says, it wouldn’t have come to fruition without you.</p>",
					"rewards": "<strong>Add events SO-53 and SO-60 to the summer outpost deck.</strong>"
				}
			},
			"2": {}
		}
	},
	"wallJ": {
		"name": "Wall"
	}
}