{
	"miningcamp": {
		"number": "05",
		"name": "Mining Camp",
		"levels": {
			"1": {},
			"2": {
				"builtSections": {
					"49.2": {
						"title": "Mining Camp Upgraded",
						"text": "<p>With the mining camp expanded, more ore and minerals will be available to Frosthaven. You admire the refinery and then venture into the tunnels themselves, using a handcart to make your way deep underground, hoping to discover some veins of copper.</p><p>Chipping away at a rock, your pickaxe strikes against something as strong as Valrath steel. Your hand is suddenly seized by another, the lithic digits encasing your wrist as the rest of the Savvas emerges from the crumbling wall. As a being of the elements, its face twists between expressions like boiling lava, its body flows and then ceases flowing all at once, growing rigid with barely contained power. “Who dares disturb my slumber?” It rumbles.</p><p>Then the Savvas laughs, a crackling fire sound. “I am in jest. I sensed your presence the instant these tunnels were blasted open. I have been waiting for you to prove your fortitude since. “Now that we have met, you will allow me to join your party. To prove my mastery over the element of magma, I must put my abilities to a true test in the field.”</p><p>That doesn’t sound like much of a choice, but having a powerful ally could never be a bad thing.</p>",
						"rewards": {
							"text": "Unlock [pyroclast] class box."
						}
					}
				}
			},
			"3": {},
			"4": {}
		}
	},
	"huntinglodge": {
		"number": "12",
		"name": "Hunting Lodge",
		"levels": {
			"1": {
				"builtSections": {
					"172.3": {
						"title": "Hunting Lodge Built",
						"text": "<p>With a fire roaring in the background, the finished hunting lodge is the perfect location to exchange tales of narrow escapes from polar bears, as well as provide hides for Frosthaven. You encounter all sorts of patrons whose rugged appearances often belie a certain gruff kindness.</p><p>One of those patrons is a Vermling Trapper, who sits nearest the fire and away from the crowd, a square hat shadowing their eyes. Sitting beside their wares of lustrous, exotic furs, they are currently absorbed in constructing an intricate snare.</p><p>When you ask them to explain their process, they warm up to you. “Much of my time is spent not in action, but in observation. It’s a matter of understanding the animals, their habits. If you’re truly interested, perhaps I can show you sometime?”</p><p>You readily agree, happy for the company.</p>",
						"rewards": {
							"text": "Unlock [trapper] class box."
						}
					}
				}
			},
			"2": {},
			"3": {},
			"4": {}
		}
	},
	"loggingcamp": {
		"number": "17",
		"name": "Logging Camp",
		"levels": {
			"1": {},
			"2": {},
			"3": {},
			"4": {}
		}
	},
	"inn": {
		"number": "21",
		"name": "Inn",
		"levels": {
			"1": {
				"builtSections": {
					"151.2": {
						"title": "Inn Built",
						"text": "<p>Once the inn is complete, you can’t believe what a difference it makes to Frosthaven. Having a warm location in which to rest and gossip will invite people with diverse backgrounds and abilities. Their presence will bring in much-needed labor, promoting the production of other buildings and spurring the exchange of ideas and invention. Frosthaven no longer feels like such a remote outpost.</p><p>The inn is a sturdy timber longhouse, its evergreen-fresh scent pervading the lobby. The proprietor is a gregarious Quatryl who helped design the building, insisting on the nail-less joints and the carving of the mountain range over the fireplace. “You know you’ll always have a room here,” she greets you warmly, her long fingers handing over a key with a numbered plate. “Especially if you bring in plenty of lively tales to share with my patrons!”</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-55" }],
								"WO": [{ "id": "WO-71" }]
							}
						}
					}
				}
			},
			"2": {},
			"3": {}
		}
	},
	"garden": {
		"number": "24",
		"name": "Garden",
		"levels": {
			"1": {
				"builtSections": {
					"78.4": {
						"title": "Garden Built",
						"text": "<p>Once complete, the garden draws young and old alike to contribute to its maintenance. In the summer, it will grow arctic flowers and edible green tin-berries; in the winter months, root vegetables and squash.</p><p>Among the rows, you greet Listeritus, a Savvas who is busy tending to tea plants. Guiding you around, its rocky face tranquil, Listeritus queries you about your collection excursions outside of Frosthaven. “If you’d like to plant a sample of what you find here, you will be able to propagate more of them for your use.” Listeritus is patient with your many gardening questions and ends the day brewing you a cup of tea. As a Savvas,</p><p>Listeritus only consumes rocks, but it enjoys the scent just the same. “It is transporting,” Listeritus says, closing its eyes and leaning over the waft of steam, evidently glad for a break in a busy day.</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-57" }],
								"SR": [{ "id": "SR-46" }]
							}
						}
					}
				}
			},
			"2": {},
			"3": {},
			"4": {}
		}
	},
	"craftsman": {
		"number": "34",
		"name": "Craftsman",
		"levels": {
			"1": {},
			"2": {},
			"3": {},
			"4": {},
			"5": {},
			"6": {},
			"7": {},
			"8": {},
			"9": {}
		}
	},
	"alchemist": {
		"number": "35",
		"name": "Alchemist",
		"levels": {
			"1": {},
			"2": {},
			"3": {
				"builtSections": {
					"183.5": {
						"title": "Alchemist Upgraded",
						"text": "<p>The final stage of the alchemist’s lab is complete. With its expansion, you can now brew more advanced potions. Inside, you encounter bubbling vats and worktables covered in retorts and alembics. Among the glassware toil multiple residents of Frosthaven, including, oddly, the Savvas playwright, Eros.</p><p>You never pegged Eros as an alchemist. Eros flips its long scarf across its stony shoulder and gives you an equally stony look. “I’m researching poisons for a play where two lovers scheme to kill their enemies.” Eros sniffs at your incredulous expression. “It won’t be real poison. I simply need the actors to appear sickly enough to convince the audience.”</p><p>With a grandiose gesture, the Savvas squeezes an dropper into a vial. The potion promptly produces a puff of noxious smoke. Eros reels backward, and you quickly herd everyone out. It’s a good thing you told them to include ventilation in the building.</p>",
						"rewards": {
							"text": "Add items [item_59] to [item_65] to the random item blueprint deck."
						}
					}
				}
			}
		}
	},
	"tradingpost": {
		"number": "37",
		"name": "Trading Post",
		"levels": {
			"1": {
				"builtSections": {
					"25.2": {
						"title": "Trading Post Built",
						"text": "<p>“Guys, guys! This is all a misunderstanding!” Xain, an acquaintance who always seems down on his luck, pleads as two guards push him unceremoniously into the tent of the new trading post. Mayor Satha is waiting inside, arms crossed.</p><p>“Mayor! I was just coming to see you, actually—I’d brokered a deal, a… a fantastic deal! The Abaeli are willing to polish the town guard’s weapons for a price you wouldn’t believe. I’d just finished packing up the armory and was going to surprise everyone tomorrow morning—”</p><p>“And did you think that the Abaeli wouldn’t attack while all of our defenses were off being ‘polished’?”</p><p>“No, they were… I mean, it was really an excellent price…” Xain meekly trails off, realization settling in.</p><p>“I have put up with your harebrained schemes in Frosthaven for long enough. This here?” She gestures around the trading post tent. “This is your penance. You will put that entrepreneurial spirit to work. You will receive shipments. You will sell goods. Honest goods.”</p><p>Xain looks mortified. “But… but for how long?”</p><p>Satha brushes past him on her way out of the tent. “Until I say otherwise. And if you screw this up? I’m marching you out of Frosthaven myself.” She nods at you in passing. “Look, it’s your first customers.”</p><p>“Oh, uhm. Hello.” Xain gives you a sheepish smile. “Welcome to the trading post?”</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-61" }],
								"WO": [{ "id": "WO-80" }],
								"WR": [{ "id": "WR-41" }]
							}
						}
					}
				}
			},
			"2": {
				"builtSections": {
					"12.4": {
						"title": "Trading Post Upgraded",
						"text": "<p>“No, this isn’t right! Look! It’s supposed to have been delivered to Jhinda! I can’t sell this here!” Xain is stamping his feet and ineffectively calling after the Quatryl mail carrier as she departs. A new shipment of goods has just arrived, boxes piled high. He spots your party entering the trading post tent and immediately looks for sympathy.</p><p>“Can you believe this? I have to run this whole place by myself, and they can’t even get my shipments right. I’m shortstaffed as it is! There’s some decent things I can move, but see this? Swimsuits! In Frosthaven! Crates and crates of them! And what am I supposed to do with…” he pulls a covering off a cage, revealing a rainbow bird inside. “A parrot?”</p><p>“BWAK! Squabbles is here. Pleased to meet you. BWAK!”</p><p>Xain looks anything but amused. “A talking parrot. Great.” Xain sighs. “Well, let me know if you want to buy anything. I’m doing buy-one-get-five-free on leather sandals this week.”</p>",
						"rewards": {
							"text": "<p>Add items [item_129] to [item_137] to the available item supply.</p><p>In addition, add any of the following items you have unlocked from <em>Gloomhaven</em>: 21, 37, 53, 93, 94, 106, and 115.</p>"
						}
					}
				}
			},
			"3": {
				"builtSections": {
					"38.3": {}
				}
			},
			"4": {
				"builtSections": {
					"196.2": {}
				}
			}
		}
	},
	"jeweler": {
		"number": "39",
		"name": "Jeweler",
		"levels": {
			"1": {
				"builtSections": {
					"31.3": {
						"title": "Jeweler Built",
						"text": "<p>As the jeweler’s opens its doors, you feel particularly proud of its construction. At the worktables, craftspeople are absorbed in examining gemstones under magnifying glasses, and standing at kilns or with blowtorches, melting precious metals into fantastic shapes. Their nimble hands seem to weave an air of sophistication into Frosthaven. One Vermling jeweler approaches you, showing off a black opal he’s set into a broach.</p><p>“What do you think?” His face tucks shyly against his vest. “I’ve been scouring the coast for these opals, and now I finally have a use for them.” He tells you he plans to sell them, then send the proceeds to his family down south. You’re pleased that you’ve created many new livelihoods, and hope to see the residents of Frosthaven wearing these beautiful pieces now and again.</p>",
						"rewards": {
							"text": "Add items [item_156] to [item_159] to the available item supply.",
							"events": {
								"SR": [{ "id": "SR-37" }],
								"WO": [{ "id": "WO-77" }]
							}
						}
					}
				}
			},
			"2": {},
			"3": {}
		}
	},
	"temple": {
		"number": "42",
		"name": "Temple",
		"levels": {
			"1": {
				"builtSections": {
					"192.5": {
						"title": "Temple Built",
						"text": "<p>Even an outpost as industrious as Frosthaven needs a place of solitude. The Temple of the Great Oak has become a sanctuary for all, its sacred gardens and walkways encompassing a young oak tree which is said to distribute divine blessings—for the proper donations, of course.</p><p>You meet with the Temple’s Head Keeper, a human who folds his hands in his sleeves and will occasionally break off conversation to stare contemplatively into space. After showing you the tree, he leaves you alone to rest before the boughs.</p><p>The wind rustling the leaves moves your mind from the bustle of living to a meditative plane, where your thoughts and instincts pass by without consequence.</p><p>Once you leave, you feel refreshed, ready to face the new challenges Frosthaven may present to you next.</p>",
						"rewards": {
							"events": {
								"SR": [{ "id": "SR-43" }],
								"WO": [{ "id": "WO-73" }]
							}
						}
					}
				}
			},
			"2": {},
			"3": {}
		}
	},
	"enhancer": {
		"number": "44",
		"name": "Enhancer",
		"levels": {
			"1": {
				"builtSections": {
					"193.1": {
						"title": "Enhancer Built",
						"text": "<p>The enhancer projects an aura of mystery into Frosthaven’s streets. A tent of indigo-hued canvas on the outside and embroidered silk tapestries on the inside, the enhancer will use gold to provide enhancements to your abilities.</p><p>In the smoky enclosure, you encounter Voice-of-Eight, the unified being composed of eight different Aesthers who come and go depending upon their needs and whims. Specifically, you see Nera, studiously in the midst of preparing spell components for customers. Nera’s dark eyes sparkle with pleasure at your entrance. She seems to be settling into Frosthaven comfortably, though she and the others are certainly one of the outpost’s more unusual residents. “If you’re ever in need of a little strangeness,” she says, as if reading your mind, semitransparent teeth glinting in a smile, “you know where to find me.”</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-63" }],
								"WR": [{ "id": "WR-44" }]
							}
						},
						"sectionLinks": "If you have completed <strong><em>Forgotten Circles</em></strong>, add [section_118.3] to the calendar in three weeks."
					}
				}
			},
			"2": {
				"builtSections": {
					"157.2": {
						"title": "Enhancer Upgraded",
						"text": "<p>With the enhancer expanded, you visit Voice-of-Eight to see how they are liking the improved shop. Unsurprisingly, you find Nera embroiled in multiple tomes, the room aglow with spells, her hands weaving purple and black through the air. You wonder if you ought to leave her to it, but she signals you over, speaking excitedly.</p><p>“We have made contact with someone who may be trapped in the Void. They must have endured cruelties from the Corruption, but with that evil force gone, we should be able to pull them out to safety. Come, help me.” This sounds dangerous at best, but that’s a typical day in Frosthaven. Trusting Voice-of-Eight’s judgment, you assist Nera in setting up the spell components as the rest of the Aesther collective materializes around you. They form a circle, chanting as a portal opens at the center.</p><p>The procedure seems stable for a while as Nera scans for where the energy is strongest. “There!” She cries, and a surge of purple energy flares from the portal. A scarred hand emerges from the other side, but then the flat face of the rift cracks, and it appears the hand is stuck.</p><p>“Help!” Nera pleads, and, not knowing what else to do, you grab hold of the hand and pull. With great effort, an Aesther tumbles forth right before the portal shatters in a shower of ethereal glass.</p><p>The figure groans, shivering on the floor. “W—where is… the pain?” Their hand shoots out, grabbing a shard of the portal. You jump back in alarm, but the Aesther turns the sharp edge on themself, carving strange symbols into the translucent flesh of their leg. You feel a strange tickling sensation on your own leg.</p><p>“Ahhhh, much better,” they sigh. “Thank you for releasing me from that prison. I had been trapped there for so long, I don’t think I can live without pain.</p><p>“But,” the Aesther suddenly stares at you with fierce intensity. “I have also learned to redirect my pain, and I don’t want any other innocents to experience anything like what I have. Point me toward evil, and I will destroy it!”</p>",
						"rewards": {
							"text": "Unlock [painConduit] class box."
						}
					}
				}
			},
			"3": {},
			"4": {
				"builtSections": {
					"56.3": {}
				}
			}
		}
	},
	"hidedepot": {
		"number": "72",
		"name": "Hide Depot",
		"levels": {
			"1": {
				"builtSections": {
					"173.1": {}
				}
			},
			"2": {}
		}
	},
	"library": {
		"number": "83",
		"name": "Library",
		"levels": {
			"1": {
				"builtSections": {
					"190.3": {
						"title": "Library Built",
						"text": "<p>In light of the recent attacks, all available capable labor has been sent to support town infrastructure. You pulled some strings to get a cushy assignment helping out at the new library. Inside you find crates piled high and an elegant, puttogether Valrath stocking the shelves. She adjusts her red-rimmed glasses and eyes you with a touch of scorn.</p><p>“Hmph, this is who they sent me? Very well. I am Eddica, your resident librarian. I’ll be managing the growing collection here, and I trust you will treat these books with the same care you treat…” she looks over your party, then furrows her brow, “whatever it is you choose to treat well.”</p><p>She points to a stack of crates along the wall. “Shelve those. Follow the Damon Decimal System.” She starts walking toward the back room, and without looking back waves a finger in the air, “Except ‘Gemstones’—put that under ‘Orchid’.”</p>",
						"sectionLinks": "<strong>If [trait] EDUCATED</strong>, read [section_164.2] now. Otherwise, read [section_143.2] now."
					},
					"164.2": {
						"title": "Library Built",
						"text": "<p>You shelve the books according to the Damon Decimal System with ease, and even make sure to put “Gemstones” under “Orchid” per Eddica’s request. When she returns she makes a thorough review, then gives a small nod.</p><p>“Well done, good to see there are some individuals in this backwater who might benefit from a library. Master Scrim will be delighted to hear it in my next letter.” The edges of her lips barely curl up into a smile, but before it registers she straightens her clothes and continues, “You know, there is a matter I could use your assistance on… it might require some minor… uh, reappropriation of antiquities.” You look at her blankly.</p><p>She rolls her eyes. “What, you expect me to sit around writing the complete history of Frosthaven? Please, this town was a sleepy fishing village until a few years ago. It’d barely fill a napkin.”</p><p>She sits down behind her desk, shuffling a stack of paperwork out of the way. “Listen, there are books out there, four tomes of incredible power. The Tome of Life, the Tome of Conflict, the Tome of the Elements, and the Tome of Time. I want you to collect them for me.” The young Valrath pushes her red-rimmed glasses up the bridge of her nose.</p><p>“My research suggests the Tome of Life is in this region—it’s the whole reason I’m up here at all. No need to go out of your way, but if you do happen upon it and bring it back to me… well, I’ll make sure you’re rewarded.”</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-58" }],
								"SR": [{ "id": "SR-47" }],
								"WR": [{ "id": "WR-45" }]
							}
						}
					},
					"143.2": {
						"title": "Library Built",
						"text": "<p>You’re not even halfway through sorting the books when Eddica returns.</p><p>“What are you doing!?” She grabs a book on Vermling Psychology out of your hands. “The spines face out, so you can read them! And this,” she grabs an object off the shelf, brandishing it angrily inches from your face, “This is a block of wood! This could someday be a book, but it certainly isn’t yet! Where did you even find this?!”</p><p>She stops, gathering herself with a deep breath. She straightens her skirt and starts again, more calm: “Alright… Master Scrim would want me to spread knowledge, not animosity. So how about we make a deal?” She smiles mischievously.</p><p>“I teach you about all the library has to offer, and you collect a few, uh, items from the field for me.” She averts her gaze, unsure how to continue. “They’re just a few tomes that I’d like you to retrieve.” You look at her blankly and she rolls her eyes. “Books. Tomes are old books.” You nod.</p><p>“Somewhere out there are books of incredible power: The Tome of Life, the Tome of Conflict, the Tome of the Elements, and the Tome of Time. I want you to collect them for me. “ The young Valrath pushes her red-rimmed glasses up the bridge of her nose.</p><p>“I’m not going to spend my time up here working on some nonsense busywork—as though I should sit around writing the complete history of Frosthaven?! Please, this town was a sleepy fishing village until a few years ago. It’d barely fill a napkin!” It’s clear this is an argument she’s had in the past, and her hands are balled up in the memory of it. After a moment, she remembers you’re standing in front of her. She gives a terse smile, then takes a deep breath before continuing.</p><p>“My research suggests the Tome of Life is in this region—it’s the whole reason I’m up here at all. If you do happen upon it and bring it back to me I’ll make sure you’re rewarded. And just for keeping an eye out, I’ll provide a world-class education as only a resident librarian can offer. Sound fair?”</p>",
						"rewards": {
							"events": {
								"SR": [{ "id": "SR-47" }],
								"WR": [{ "id": "WR-45" }]
							}
						},
						"sectionLinks": "Add [section_152.3] to the calendar in two weeks"
					}
				}
			},
			"2": {
				"builtSections": {
					"116.3": {
						"title": "Library Upgraded",
						"text": "<p>“Looks like my project to bring knowledge to this backwood is finally starting to get some attention!” Eddica, the resident Valrath librarian, gestures to an Orchid as you enter the library. The Orchid is clad in shimmering armor and wields a sword that seems far too massive, even for their muscular frame.</p><p>Eddica continues: “This one is also interested in the ancient lore from around these parts. Could prove useful in our search for the tomes. Speaking of, follow me.” Eddica snaps at you, then turns and steps briskly toward a back room. You give a short greeting to the Orchid and then follow.</p><p>“Alright, exciting news!” Eddica begins immediately as you squeeze into the cramped space full of dusty parchments.</p><p>“I think my research has been paying off. If I’ve done the background research correctly—and I’m certain I have—I think I’ve located two of the Tomes of Power. The first is the Tome of the Elements…” she unfurls a map across the floor, handing you one corner to keep it from rolling back up. “Here.” She points at an area nearby where you were already intended to go on a future adventure. “Be careful, though: accounts of the Tome of the Elements make it sound a bit more volatile than the others. I wouldn’t recommend opening it in the field.”</p><p>She pushes her red-rimmed glasses up the bridge of her nose, kneeling next to the map. “The second is a bit hazier in the written record. The Tome of Conflict, like the other tomes, was penned by the spellcaster Belara—that much is clear. But something happened, and the books were scattered. If I’m reading this correctly, older maps actually reference a tower in the woods.” She points an impeccably manicured fingertip toward the tundra. “But it doesn’t show up on any newer surveys of the region. It’s just a hunch, but I think you’ll find the Tome of Conflict there. If it’s not too far out of your way, could you check it out for me?”</p>",
						"rewards": {
							"text": "Unlock [infuser] class box.",
							"events": {
								"SR": [{ "id": "SR-48" }],
								"WR": [{ "id": "WR-46" }]
							},
							"scenarios": [{ "id": "134" }]
						}
					}
				}
			},
			"3": {
				"builtSections": {
					"89.2": {
						"title": "Library Upgraded",
						"text": "<p>You walk through the crowded library past a sea of patrons from all walks of life perusing the bookshelves. Eddica the librarian has done an incredible job of educating the populace of Frosthaven. You have a suspicion there are still plenty of patrons here for a chance to see the pretty Valrath rather than a love of learning, but you can’t argue with the results. She catches your eye and you follow her into the cramped back-office.</p><p>The room feels even more claustrophobic than last time. The books have spilled out off the shelves and across the floor, and the candle-wax burned down in various sconces suggests Eddica has been taking her latest research seriously. She’s about to speak when she holds up a finger, making a final check against a scroll.</p><p>“Right, okay. Thank you for coming. I think it’s about time I shared my research on the final tome.” She pauses, barely able to contain herself. After a moment she looks frustrated. “Oh, come on! Time? It’s about time? The Tome of Time. It’s a pun!” She grumbles, stamping her foot. “Nevermind.”</p><p>Eddica shares a crude map of where the tome is located, and you promise to seek it out next time you’re in the area.</p>",
						"rewards": {
							"events": {
								"SR": [{ "id": "SR-49" }],
								"WR": [{ "id": "WR-47" }]
							}
						}
					}
				}
			}
		}
	},
	"workshop": {
		"number": "84",
		"name": "Workshop",
		"levels": {
			"1": {}
		}
	},
	"boat": {
		"name": "Boat",
		"levels": {
			"0": {
				"builtSections": { 
					"139.2": {
						"title": "Boat Built",
						"text": "<p>The shipyard hums with activity, somewhat literally in the case of the Harrower carpenter, who has been hired to construct your boat. As a swarm of unified insects, the Harrower has spent the last few days slicing planks of wood, then bending the pieces into shape with the help of other workers. It’s a respectable, single-mast ship with enough room for a small crew to make a brief voyage north. Until now, a part of you had hoped the carpenter wouldn’t pull it off and that you’d be saved from venturing into these frigid waters. But seeing the ship here, all properly rigged up and sealed with fresh pitch, your mood brightens. Now, all you need is a crew.</p><p>“Captain Philip Doghogger, at your service!” You turn back toward the gate. The human walking toward you is the height of a child, but the weathered look on his face makes his age clear.</p><p>“Satha mentioned ye needed an old salt,” the man continues cheerily. He seems confident that he’s already been hired. “Delighted to have a ship to captain once again. Been lookin’ fer a new steed since my own ship met an unfortunate end a few months back. I’m sure this one won’t be torn apart by a giant starfish, eh?” He laughs, but there is sadness there.</p><p>“Now, whaddya call this beauty?” The sailor brightens again, offering a bottle of brackish alcohol. “G’head, pick a name. Bad luck to set forth on an unnamed vessel!”</p><p>You smash the bottle on the hull and watch as the carpenter and their assistants launch the ship into the chilly waters. Captain Doghogger takes some time to inspect the rigging and secure a crew, but after only half a day, you’re ready to brave the icy sea and leave Frosthaven behind you.</p>",
						"rewards": {
							"text": "<p>Open envelope B.</p><p>Place “Boat” campaign sticker on the town map at location A. You may now play scenarios with the [boat] requirement. Name your boat, then write it on the sticker and the front of B-01 and B-02 in the blanks.</p><p>Shuffle events B-01 to 13 together and use them to create the boat event deck. Store this deck in envelope B when not in use and use the card divider to separate the boat event deck from the other boat event cards.</p><p>Gain 1 prosperity.</p>"
						}
					}
				}
			}
		}
	},
	"sled": {
		"name": "Sled",
		"levels": {
			"0": {
				"builtSections": { 
					"169.2": {
						"title": "Sled Built",
						"text": "<p>With the sled complete, you can now safely venture farther out into the tundra. Captain Olmstead joins you for a test run on a borrowed scouting sled from the town guard, and you can’t help but enjoy the taste of the crisp morning air. The Captain eyes the next hill and gives a wry smile.</p><p>“Your new sled might outmatch the design of mine, but there’s no substitute for experience.” He cracks his neck. “Let’s make it interesting… first to that tree line over there buys the next round.” Before you have a chance to agree—or even spot the tree line in question, Olmstead has egged his dogs on down the hill.</p><p>You push off in pursuit, but by the time you make it to the tree line your competition is nowhere to be seen. Then you spot him: seated on a log just inside the shelter of the snowy tree canopy is Captain Olmstead sharing a canteen of water with his panting sled dogs.</p><p>“Hah! Glad we understand there’s still a thing or two you mercenaries can learn from this old-timer.”</p>",
						"rewards": {
							"text": "<p>Place “Sled” campaign sticker on the town map at location B. You may now play scenarios with the [sled] requirement.</p><p>Gain 1 prosperity.</p>"
						}
					}
				}
			}
		}
	},
	"climbinggear": {
		"name": "Climbing Gear",
		"levels": {
			"0": {
				"builtSections": { 
					"161.1": {
						"title": "Climbing Gear Built",
						"text": "<p>Despite its apparent hostility, the landscape surrounding Frosthaven calls for exploration. Now that some climbing gear has been constructed, you have the means to access new horizons high up in the mountains.</p><p>Inside the shop, you encounter the Harrower carpenter hard at work. The horde of insects which makes up their shape flits around, braiding together fibers for rope. “When we’re finished,” they say in their chittery voice, “this rope will be able to withstand the weight of one hundred thousand bees.”</p><p>You must look nervous. Their shape flutters with humor. “Don’t worry. That means it will hold you, too.”</p><p>You dearly hope so, because you can’t picture one hundred thousand bees scaling a mountain anytime soon.</p>",
						"rewards": {
							"text": "<p>Place “Climbing Gear” campaign sticker on the town map at location C. You may now play scenarios with the [climbinggear] requirement.</p><p>Gain 1 prosperity.</p>"
						}
					}
				}
			}
		}
	},
	"carpenter": {
		"number": "85",
		"name": "Carpenter",
		"levels": {
			"1": {
				"builtSections": {
					"7.3": {
						"title": "Carpenter Built",
						"text": "<p>A wood-carving contest inaugurates the opening of the carpenter’s shop. You wander among booths displaying inlaid trinket boxes and cooking utensils alongside life-size replicas of Lurkers and polar bears. The pavilion is filled with the sounds of hacking and sawing.</p><p>One carpenter is a Harrower, whose undulating insect form obscures a large chunk of wood, chipping away with their collective mandibles. Once they recollect themselves into a vaguely humanoid shape, they reveal their project: a to-scale model of Frosthaven. “We will keep adding to it,” they hum at you, “as long as you keep doing so.” With the carpenters, they note, constructing buildings will now be less costly.</p><p>A few of their insects pick up small cylinders of wood, which they carve instantly into a miniature version of you. They place your model in the center of the Frosthaven replica. After all, the Harrower says, it wouldn’t have come to fruition without you.</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-53" }, { "id": "SO-60" }]
							}
						}
					}
				}
			},
			"2": {}
		}
	},
	"townhall": {
		"number": "90",
		"name": "Town Hall",
		"levels": {
			"1": {
				"builtSections": {
					"189.1": {
						"title": "Town Hall Built",
						"text": "<p>“Bureaucrats! Nothing but forms and stamps and a waste of my time!” An old man trudges out of the new town hall into the snow, leaving the wooden door wide open. You step inside to get a look around.</p><p>The interior is nicely appointed with the trappings of rural government: broad antlers are mounted high up the walls, and a tall countertop divides the room between visitor waiting area and employees. Behind the counter stands an Inox with a monocle on a chain, reviewing paperwork. “Close the door. Got enough cold outside, don’t need it in here,” he says, without looking up.</p><p>Eventually he sighs. “Alright, got business or just ogling? I’m Glint, the recordskeeper for Frosthaven. You must be… the janitors?” You let him know you’re mercenaries interested in work. “Eh. Slim pickin’s in the North, huh?” You’re not sure if he’s referring to the work or your group. He sorts through some paperwork on the countertop.</p><p>“Ah, here we go. Captain Olmstead told me to find someone to test out a few things next time they’re outside the walls. If you want that, you’re welcome to try until something better comes in.”</p>",
						"rewards": {
							"events": {
								"SO": [{ "id": "SO-59" }, { "id": "SO-62" }],
								"SR": [{ "id": "SR-38" }]
							}
						}
					}
				}
			},
			"2": {},
			"3": {}
		}
	},
	"barracks": {
		"number": "98",
		"name": "Barracks",
		"levels": {
			"1": {},
			"2": {},
			"3": {},
			"4": {}
		}
	},
	"wallJ": {
		"name": "Wall"
	},
	"wallK": {
		"name": "Wall"
	},
	"wallL": {
		"name": "Wall"
	}
}