{
	"blinkblade": {
		"name": "Blinkblade",
		"race": "Quatryl",
		"background": "<p>Quatryls typically don’t like being underestimated. They are smaller than the other peoples they encounter, yes, but that doesn’t mean they are worth any less. If anything, they will go out of their way to show they are worth more. Their scientific institutions on the eastern continent have developed a myriad of technological advancements-bionics and prosthetics used to enhance their own capabilities. There are even vague records that long ago, the Quatryl’s scientific research led them to the north to hunt for its secrets, but these facilities have long since fallen to ruin.</p><p>The fact of the matter is that the cold is not a forgiving climate for one so small. If a Blinkblade were to travel north, it may be because they have nowhere else to go, or because there is some quarry to be found. Blinkblades are assassins, after all. Equipped with experimental temporal drives, they can alter the flow of time, moving faster than the eye can see and striking harder than a creature ten times their size. Such actions can only be performed in short bursts however, and there is always a cost to such great power.</p>",
		"retirement": { 
			"id": "60.2",
			"text": "<p>The Blinkblade finishes reading a long letter delivered by the mail carrier, and then folds it up and tucks it in their pack.</p><p>“Well, looks like I’m needed elsewhere.” You stare at them, somewhat stunned.</p><p>“I’ve been offered a job by the Merchant’s Guild in White Oak,” the Blinkblade says. “Apparently activity of the Sin-Ra syndicate has increased recently, and they need skilled operatives to fight them back in the shadows of the capital. These Sin- Ra are insidious jerks, and if you don’t nip their machinations in the bud, well...” The Blinkblade shrugs their shoulders. “There goes your whole city.”</p><p>They slowly finish packing up their belongings and then move to leave.</p><p>“I can’t say I’ll miss this cold, but, well, I may just miss you lot.” The Blinkblade lingers at the door for a second. “Just a bit, though.” And then—ZIP—they’re gone.</p>",
			"rewards": { 
				"events": { 
					"SO": [{ "id": "SO-64" }]
				}
			}
		}
	},
	"deathwalker": {
		"name": "Deathwalker",
		"race": "Valrath",
		"background": "<p>No group is quite so ill-suited for the icy northern climates as the Valrath, who make their homes far to the south around the Red Desert. There was once a great war in that region between the Valraths and the humans, both equally interested in conquering the Stormbrew Plains for themselves. The two nations have since made peace, and the Valrath government in particular has made concerted efforts to forsake its aggressive past. In more recent times, they have focused on economic strength over the physical.</p><p>There is a saying among the Valrath: “In order to survive the ice, one must have an icy soul.” This is apt for a Deathwalker, a nomad bent on atoning for the Valrath nation’s past sins by ensuring the souls of the dead find rest. Wherever great tragedy falls, a Deathwalker is usually not far behind, and Frosthaven has seen plenty of tragedy.</p>",
		"retirement": { 
			"id": "53.3",
			"text": "<p>Ever since the Deathwalker decided to stop heading out on missions, they’ve been wandering the streets of Frosthaven, muttering to themselves about “lost souls”. You finally stop them and ask what the meaning of it all is.</p><p>“There are just so many dead who still linger,” the Deathwalker laments. “Those who have fallen in battle. Those who were taken by the cold. They must be properly put to rest, but I don’t know how.”</p><p>You mention the makeshift graveyard outside of town, and the Deathwalker shakes their head. “It is insufficient—woeful. The dead placed there don’t get the proper respect. Piled into holes like garbage. Unless...”</p><p>The Deathwalker’s expression changes. “Yes, I must go talk to Satha immediately. We must improve the graveyard! Give the dead their due respect. Oh my, there is so much work to do!” They move in the direction of Satha’s cabin faster than you’ve ever seen them move. Hopefully, something good comes from it.</p>",
			"sectionLinks": "Add [section_176.4] to the calendar in the second week of next summer."
		}
	},
	"crashingtide": {
		"name": "Crashing Tide",
		"race": "Lurker",
		"background": "<p>Lurkers, as they are called by those who dwell on the land, once reigned over a vast, underwater empire, but it fell to ruin when the source of their power—a coral crown—was destroyed and the shards scattered by the currents of the Misty Sea. The Lurkers search endlessly for the pieces of this crown, haunted by an overwhelming sense of loss. They are driven to reassemble the crown, even if they no longer understand why. The currents have brought these shards to the north, and, close to their source of power, the Lurkers have begun to grow in strength once again.</p><p>Like the ebb and flow of the Lurkers’ power throughout history, so too do the tides shift. There is a cycle to all things, and this is particularly exemplified in the Crashing Tides, guardians and protectors of their society and the natural order of things. They build their power over time, and then use it to crash against their foes in a wave of destruction. The waves must recede, of course, but then power will grow once again.</p>",
		"retirement": { 
			"id": "54.2",
			"text": "<p>You often find the Crashing Tide resting at the shore of Frosthaven, observing the waves lapping against the dock. This time, however, things feel different. When they send images of the ebb and flow of the tides into your mind, you sense the kinship they feel toward the natural cycle. They are the tides. The high water was them rising to the surface, exploring dungeons and fighting with you against that which threatened Frosthaven.</p><p>But now, the waters recede. The Crashing Tide must return to the ocean. You express sadness.</p><p>The Crashing Tide gently lays a giant claw on your shoulder in consolation. You see more images of the low tide once again surging forward, raising the water. Everything is a cycle. The Crashing Tide will return one day. But for now, it disappears beneath the waves.</p>",
			"rewards": {
				"events": {
					"B": [{ "id": "B-15" }]
				}
			}
		}
	},
	"trapper": {
		"name": "Trapper",
		"race": "Vermling",
		"background": "<p>A Vermling’s small stature makes the cold climate of the north particularly inhospitable. But when forced to choose between the harsh elements and the constant harassment of human settlers in the south, some clans have decided to risk the snow and ice. Many have found homes near Frosthaven, mostly in the Radiant Forest, which is always unseasonably warm. Malevolent forces, however, have begun to push the Vermlings out of this forest as well, once again leaving them scrambling for survival.</p><p>A major part of survival is hunting for food and hides to keep warm, and Trappers have always been good at that, giving them a strong edge in the unforgiving wilds. They have grown quite adept at not only laying a variety of snares, but also luring their prey into the deadly traps. Quick on their feet and with jaws of metal never in short supply, Trappers are prepared to bring down any quarry.</p>",
		"retirement": { 
			"id": "56.5",
			"text": "<p>“Listen, this has been great, but I still just can’t get used to all... this,” the Trapper gestures to the bustling outpost sheepishly. “I’m happy the hunting lodge convinced me to help out around here, but I just need some time to myself. Time to just be myself out in the wilderness, not worrying about who’s going to spit on me or kick me as I walk by.”</p><p>You frown and express remorse that such terrible things still happen to someone who has done so much good for the outpost.</p><p>“Ha, well, they’re sorry too when they get a footful of bear trap,” the Trapper grumbles. “But it’s not about that. I just long for the open skies and simple life the wilds provide. Don’t worry, though, I’ll still be back occasionally to trade with the hunting lodge.”</p><p>With that, the Trapper packs up their sled of contraptions and marches off into the tundra.</p>",
			"sectionLinks": "Add [section_169.1] to the calendar in six weeks."
		}
	},
	"snowdancer": {
		"name": "Snowdancer",
		"race": "Algox",
		"background": "<p>Algox are at home in the north. Their thick white fur offers great protection from the elements, and their strength and intelligence put them at the top of the fcx»d chain. They are imposing figures with three spiraling horns atop their head. This feature they share with their distant relatives, the Inox. Like their cousins, the Algox gather in clans, but these are split following one of two rival ideologies: the Snowspeakers, who believe the divine speaks to them through the falling snow; and the Icespeakers, who instead look to the ice growing up from the cold earth.</p><p>The most adept priests of the Snowspeakers are those that move with the winds and snow, using it to make others dance, as well—often against their will. It is a breathtakingly beautiful sight, watching these Snowdancers harness the raw power of their movement to bring forth the elements of the north. Their enemies soon find themselves sapped of all warmth as the wind beats them into a snowy grave.</p>",
		"retirement": {
			"id": "107.3",
			"text": "<p>“My clan needs me,” the Snowdancer says, remorse in their eyes. “I have just received word that the elder priest has succumbed to the long winter, and the burden to lead now falls on my shoulders.”</p><p>You express your condolences, but the Snowdancer shakes their head. “She lived a fulfilling life, and has now joined with Geryuu. There is nothing to be remorseful about.” They stand and stare at a small whirlwind of snow they have conjured in their palm. “And I am wrong to call leadership a burden. It is a joy, and an honor. I take it up gladly, but it does mean that you and I must now part ways. I hope our friendship has strengthened the bond between Algox and this outpost—that we have many fruitful years to come as allies.”</p><p>You extend a hand in respect, and the Snowdancer envelopes it with their own, smiling warmly. “Until we meet again.”</p>",
			"sectionLinks": "Add [section_177.4] to the calendar in the ningth week of next summer."
		}
	},
	"infuser": {
		"name": "Infuser",
		"race": "Orchid",
		"background": "<p>Orchids come from across the Misty Sea and can spend years in a peaceful state, contemplating and planning their next move while crystals grow across their skin. Orchids are largely unaffected by their environment, getting whatever warmth and sustenance they need from their meditations, so it is perfectly natural they would eventually find their way into the inhospitable north. These harsher climates provide them with new, unique perspectives on which to ruminate.</p><p>An Orchid’s contemplative nature also gives them a particular prowess over the elemental energies of the world. Some use these energies to attack their foes with raw power; however, others emit these energies into strands of elemental fabric, weaving them into physical armor and weapons. These are the Infusers, martial warriors who use the natural flow of elements to enhance their already formidable fighting skills.</p>",
		"retirement": {
			"id": "92.2",
			"text": "<p>“I feel I’ve reached my current potential.” You are sitting with the Infuser at The Crater, discussing the future. “I still feel like there is room to grow, but I’m not learning anything new by just fighting the same old monsters over and over. I think I need to return to the library.”</p><p>You nod and drink your ale. The Infuser’s drink remains untouched. “There’s just so much more knowledge out there, I know it. I’m glad I could be of some use for a while, but I’ve got to think about my own journey, and it is one of knowledge.”</p><p>The Infuser stands and gives you an uncomfortable, slightly spiky hug. “Thanks for understanding. I’m sure I’ll see you around!”</p>",
			"sectionLinks": "Add [section_42.2] to the calendar in six weeks."
		}
	},
	"pyroclast": {
		"name": "Pyroclast",
		"race": "Savvas",
		"background": "<p>The Savvas live deep under the Copperneck Mountains, largely removed from the turmoil of the surface. There, they protect their source of life, which imbues unliving rock with consciousness and thought. The Savvas have few needs, and so, most are driven to seek domination over the elements, controlling and using wind, earth, ice, and fire. Those who are able to master the elements are held in the highest regard.</p><p>Savvas go to extreme lengths to exert their power over the elements. Some cast themselves into active volcanoes, where they are either destroyed or become one with the raw power of the magma, emerging as a Pyroclast—a living embodiment of the chaotic and destructive force of flowing lava. No one can question their power then.</p>",
		"retirement": {
			"id": "51.3"
		}
	},
	"hive": {
		"name": "HIVE",
		"race": "Unfettered",
		"background": "<p>Living machines come from an era long past. Built to serve a variety of functions, then cast into dormancy during a great cataclysm, the automatons once again are waking up and spreading their influence across the north. They call themselves “Unfettered”; no longer bound by their original programming, they are now free to follow their own will.</p><p>Not all of the ancient machines were able to fold into the Unfettered cause, however. One example is the Harrower Imitative Voltaic Entity, or HIVE, an experimental model designed to mimic the swarm-like structure of a Harrower. The HIVE employs a unique processing structure that is distributed among the many different smaller automatons that make up its larger form. This structure gives it a much higher capacity for independent thought, and so, once awoken, it decided to set off on its own journey.</p>",
		"retirement": {
			"id": "148.2"
		}
	}
}