{
	"blinkblade": {
		"id": "blinkblade",
		"name": "Blinkblade",
		"race": "Quatryl",
		"background": "<p>Quatryls typically don't like being underestimated. They are smaller than the other peoples they encounter, yes, but that doesn't mean they are worth any less. If anything, they will go out of their way to show they are worth more. Their scientific institutions on the eastern continent have developed a myriad of technological advancements-bionics and prosthetics used to enhance their own capabilities. There are even vague records that long ago, the Quatryl's scientific research led them to the north to hunt for its secrets, but these facilities have long since fallen to ruin.</p><p>The fact of the matter is that the cold is not a forgiving climate for one so small. If a Blinkblade were to travel north, it may be because they have nowhere else to go, or because there is some quarry to be found. Blinkblades are assassins, after all. Equipped with experimental temporal drives, they can alter the flow of time, moving faster than the eye can see and striking harder than a creature ten times their size. Such actions can only be performed in short bursts however, and there is always a cost to such great power.</p>",
		"retirement": { 
			"id": "60.2",
			"text": "<p>The Blinkblade finishes reading a long letter delivered by the mail carrier, and then folds it up and tucks it in their pack.</p><p>“Well, looks like I’m needed elsewhere.” You stare at them, somewhat stunned.</p><p>“I’ve been offered a job by the Merchant’s Guild in White Oak,” the Blinkblade says. “Apparently activity of the Sin-Ra syndicate has increased recently, and they need skilled operatives to fight them back in the shadows of the capital. These Sin- Ra are insidious jerks, and if you don’t nip their machinations in the bud, well...” The Blinkblade shrugs their shoulders. “There goes your whole city.”</p><p>They slowly finish packing up their belongings and then move to leave.</p><p>“I can’t say I’ll miss this cold, but, well, I may just miss you lot.” The Blinkblade lingers at the door for a second. “Just a bit, though.” And then—ZIP—they’re gone.</p>",
			"rewards": { 
				"events": { 
					"SO": [{ "id": "SO-64" }]
				}
			}
		}
	},
	"deathwalker": {
		"id": "deathwalker",
		"name": "Deathwalker",
		"race": "Valrath",
		"background": "<p>No group is quite so ill-suited for the icy northern climates as the Valrath, who make their homes far to the south around the Red Desert. There was once a great war in that region between the Valraths and the humans, both equally interested in conquering the Stormbrew Plains for themselves. The two nations have since made peace, and the Valrath government in particular has made concerted efforts to forsake its aggressive past. In more recent times, they have focused on economic strength over the physical.</p><p>There is a saying among the Valrath: \"In order to survive the ice, one must have an icy soul.\" This is apt for a Deathwalker, a nomad bent on atoning for the Valrath nation's past sins by ensuring the souls of the dead find rest. Wherever great tragedy falls, a Deathwalker is usually not far behind, and Frosthaven has seen plenty of tragedy.</p>",
		"retirement": { 
			"id": "53.3",
			"text": "<p>Ever since the Deathwalker decided to stop heading out on missions, they’ve been wandering the streets of Frosthaven, muttering to themselves about “lost souls”. You finally stop them and ask what the meaning of it all is.</p><p>“There are just so many dead who still linger,” the Deathwalker laments. “Those who have fallen in battle. Those who were taken by the cold. They must be properly put to rest, but I don’t know how.”</p><p>You mention the makeshift graveyard outside of town, and the Deathwalker shakes their head. “It is insufficient—woeful. The dead placed there don’t get the proper respect. Piled into holes like garbage. Unless...”</p><p>The Deathwalker’s expression changes. “Yes, I must go talk to Satha immediately. We must improve the graveyard! Give the dead their due respect. Oh my, there is so much work to do!” They move in the direction of Satha’s cabin faster than you’ve ever seen them move. Hopefully, something good comes from it.</p>",
			"sectionLinks": "Add [section_176.4] to the calendar in the second week of next summer."
		}
	},
	"crashingtide": {
		"id": "crashingtide",
		"name": "Crashing Tide",
		"race": "Lurker",
		"background": "<p>Lurkers, as they are called by those who dwell on the land, once reigned over a vast, underwater empire, but it fell to ruin when the source of their power—a coral crown—was destroyed and the shards scattered by the currents of the Misty Sea. The Lurkers search endlessly for the pieces of this crown, haunted by an overwhelming sense of loss. They are driven to reassemble the crown, even if they no longer understand why. The currents have brought these shards to the north, and, close to their source of power, the Lurkers have begun to grow in strength once again.</p><p>Like the ebb and flow of the Lurkers' power throughout history, so too do the tides shift. There is a cycle to all things, and this is particularly exemplified in the Crashing Tides, guardians and protectors of their society and the natural order of things. They build their power over time, and then use it to crash against their foes in a wave of destruction. The waves must recede, of course, but then power will grow once again.</p>",
		"retirement": { "id": "54.2" }
	},
	"trapper": {
		"id": "trapper",
		"name": "Trapper",
		"race": "Vermling",
		"background": "<p>A Vermling's small stature makes the cold climate of the north particularly inhospitable. But when forced to choose between the harsh elements and the constant harassment of human settlers in the south, some clans have decided to risk the snow and ice. Many have found homes near Frosthaven, mostly in the Radiant Forest, which is always unseasonably warm. Malevolent forces, however, have begun to push the Vermlings out of this forest as well, once again leaving them scrambling for survival.</p><p>A major part of survival is hunting for food and hides to keep warm, and Trappers have always been good at that, giving them a strong edge in the unforgiving wilds. They have grown quite adept at not only laying a variety of snares, but also luring their prey into the deadly traps. Quick on their feet and with jaws of metal never in short supply, Trappers are prepared to bring down any quarry.</p>",
		"retirement": { "id": "56.5" }
	}
}