{
	"04": {
		"title": "Greed is Good",
		"description": "There are many high and lofty goals in life—sick grandmas and epic love. Ridiculous. Only one thing matters and that's money—getting the most of it and keeping it safe. The weight of gold in your purse is a greater feeling than anything else imaginable, grandmas be damned.",
		"requirements": "Have 80+20xL gold in your possession, where L is the prosperity level.",
		"building": { "id": "tradingpost" },
		"altBuilding": { "id": "hidedepot" }
	},
	"05": {
		"title": "Build, not Destroy",
		"description": "Sure, you've made a name for yourself as a seasoned fighter. When push comes to shove, you know how to kill a man. Still, it doesn't feel good. You long to find a new way of life. One that doesn't involve tearing something down, but rather building something up. To use your hands for a positive purpose: that would be ideal.",
		"requirements": "Experience the construction of twelve different buildings or building upgrades.",
		"building": { "id": "carpenter" },
		"altBuilding": { "id": "inn" }
	},
	"06": {
		"title": "Team Building",
		"description": "You are a people person. Sure, you've got a job to do, but would it hurt to make a few friends? Of course not. Nothing would make you happier than sitting around the hearth with some fast friends, drinking, talking, and playing games.",
		"requirements": "During eigth different outpost phases, read a person's name in an event or section.",
		"building": { "id": "carpenter" },
		"altBuilding": { "id": "inn" }
	},
	"09": {
		"title": "Life Lessons",
		"description": "Life is all about the experience. It is fleeting and really only meaningful on a very small scale—to you and those in your immediate surroundings. The best thing you can do with your life is to just go out and experience as much as possible. Have fun, find adventure, and maybe get a little blood on your face.",
		"requirements": "Gain 150 experience from ability cards.",
		"building": { "id": "townhall" },
		"altBuilding": { "id": "library" }
	},
	"10": {
		"title": "Explore the Reaches",
		"description": "Who are these people? They come all the way to this glorious wilderness and then huddle together in their drab, little buildings. It's madness. You will climb the tallest peak and go farther out into the snow plains and frozen seas than anyone else has done before. You will see the glorious sights yet unseen.",
		"requirements": "Complete five different scenarios that require [boat], [climbinggear], or [sled].",
		"building": { "id": "townhall" },
		"altBuilding": { "id": "library" }
	},
	"13": {
		"title": "End the Trickery",
		"description": "Vile little creatures, imps desire nothing more than to sow chaos. They are demons; unnatural abominations that have caused you nothing but pain. They tricked your family out of everything they owned, including their horse, which the imps ate. You loved that horse, and you simply hate imps.",
		"requirements": "Kill fifteen Imps.",
		"building": { "id": "enhancer" },
		"altBuilding": { "id": "tavern" }
	},
	"20": {
		"title": "Return to Simplicity",
		"description": "Mechanical creatures roaming the frozen north—and you thought you'd heard of everything! Who knows where they came from or what they're up to, but it can't be good, right? You prefer simplicity. Metal is used for tools, swords, and armor. Not to make strange things that move around on their own. No, these clanking things must be destroyed at all cost.",
		"requirements": "Kill fifteen Ruined Machines.",
		"building": { "id": "garden" },
		"altBuilding": { "id": "inn" }
	}
}