{
	"11.8": {
		"title": "Puzzle Solution (puzzle #8)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>You stand in the new shack that Crain must have either built or summoned through dark means, because you don’t remember seeing it before today. In front of you is Crain’s newest creation: a series of glass lenses, each coated in a different varnish and arranged around a small metal platter. On that platter, sits a vial of multicolored liquid.</p><p>Crain draws the shade on his shed’s singular window and then aims a small mining lamp at one of the lenses. As soon as he does, the contraption floods with light and then projects a strange prism onto the ceiling.</p><p>“It took some serious alchemy, but I’ve distilled the energy signature from the spire,” Crain says. “And it’s the strangest thing I’ve ever seen.” The light dances across the ceiling, composed of fifteen or twenty multi-colored ribbons that weave in and out of each other, seemingly at random.</p><p>“Now this is the energy signature from the Radiant Forest.” Crain switches out the vial for a different one full of red liquid, and the prism changes completely. Instead of twenty ribbons moving at random, there are now only seven or eight, all shaded red, and all bound together like a rope that’s swaying in the wind. “The signature from—”</p><p>Crain is interrupted by warning horns from the wall: Algox to the east. Crain’s demeanor immediately switched to one of complete rage. He grabs an empty vial and flings it against a wall. “I can’t take it!” He yells, his outburst punctuated by shattering glass. “The horns! The attacks! The... clanging of metal!” He punctuates this last bit with another vial.</p><p>“I can’t do my work like this!” He laments. “There’s too much stress—too much commotion. Can you do anything to stop the incessant Algox raids? Go out there and make some friends or something. What do I pay you for, anyway?”</p><p>You’re about to retort that Crain is most definitely not paying you, but you decide to just leave the troubled Quatryl alone instead.</p>",
		"rewards": {
			"text": "Turn to the next page in the puzzle book."
		}
	},
	"15.4": {
		"title": "The True Oak Triangulated",
		"unlockedBy": { "scenario": { "id": "069" }},
		"text": "<p>You respond to a note from Listeritus, returning to its cabin to find the place ransacked and the research stolen.</p><p>“It was the Radiant Order from White Oak,” Liseritus explains, nursing some cracks in its arm. “They said they received word we were conducting ‘blasphemous’ research up here, and that they were here to stop it. They took my notes on the location of the oak grove and then destroyed everything else.</p><p>“I—I think they’re going to go destroy it! You have to go stop them. The Radiant Forest is a treasure trove of botanical wonders, and who knows how much they’ll destroy!” Listeritus grabs some parchment and begins scribbling out a crude map. “Follow this. It should get you to what you seek. I just hope you’re not too late.”</p>",
		"rewards": {
			"scenarios": [{ "id": "070" }]
		}
	},
	"21.4": {
		"title": "Winter Arrives",
		"text": "<p>It’s been a summer of adversity, but your decision is made: this outpost at the corner of civilization won’t make it through another winter without your assistance. Of course, it’s possible they won’t make it with you, either—but at least you’ll find out together.</p><p>The Quatryl mail carrier cinches her bag and plods through the main gate. In her satchel is your final reconnaissance report to the guild at White Oak, detailing the condition of the town, the support it will need to continue, and your decision to stay.</p><p>With a sober final thump, the gates of Frosthaven seal shut. The populace barely acknowledge it, but for you it means you’ve linked your fate with that of this town.</p>",
		"rewards": { 
			"text": "Gain 1 prosperity." 
		}
	},
	"26.4": {
		"title": "Random Scenario",
		"text": "You retrieve a hand-held mirror with an elaborate silver frame, thinking, if nothing else, someone in Frosthaven should be willing to pay something for it. When you look into its reflective surface, however, you don’t see your own image staring back at you. Instead, it shows you an image of yourself walking out the main gates of Frosthaven. You watch the mirror for a while as the image treks through the wilderness, eventually arriving at a cave filled with treasure. Looks like something worth investigating.",
		"rewards": { 
			"scenarios": [{ "id": "111" }]
		}
	},
	"26.5": {
		"title": "Puzzle Solution (puzzle #4)",
		"unlockedBy": { "other": "Puzzle Book" },
		"sectionLinks": "<p><strong>If Glowing Catacombs</strong> [scenario_9] is complete, read [section_124.1] now.</p><p><strong>If Temple of Liberation</strong> [scenario_20] is complete, read [section_127.1] now.</p>"
	},
	"29.5": {
		"title": "Puzzle Solution (puzzle #1)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>You find Crain much as you left him—cloistered in his small room, surrounded by his surreptitiously begotten books and muttering to himself. However, unlike last time, he’s up and moving around.</p><p>“My pugilistic chum!” He says when you knock on his door frame, “What a pleasure to see you again so soon! Have you already cracked the cipher then?” The Quatryl clicks his tongue and examines your findings. He mutters, looks at his own notes, which are now nailed to the wall.</p><p>“Ha!” Crain shouts. “Fancy that. Look here.” He tears down one of his sheets and brings it over. On it are several lines of the ancient numerical system apparently copied directly out of the source text. Using your new system, he translates a few of the lines and ends up with a fairly basic equation that he solves without trouble.</p><p>“You’ve done it then,” Crain says with a bit of guarded surprise. “Had you marked as a fighter through and through, but seems there’s a scholar trapped beneath all those muscles.” He lets out a high, cackling laugh that carries on far too long. You wonder when the last time he got some fresh air was, and ask as much.</p><p>“Fresh air? There’s no time! We have the numbers—the numbers! Now I can get to work on the alphabet, then we’ll know what secrets hide in this book.” He holds up the musty tome and a few pages fall onto the floor.</p><p>“Which reminds me.” He retrieves another slip of parchment from the wall and hands it to you. This one is scrawled with a section of text copied in the lost language. “Let’s see how you do with this. Take note, there are some scribbles there in the corner concerning two unrelated words. Something about ancient technology. Not sure about any of it, but if you have two words that fit there, it might lead to something else.”</p>",
		"rewards": { 
			"text": "Turn to the next page in the puzzle book." 
		}
	},
	"30.6": {
		"title": "Puzzle Solution (puzzle #2)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>“It’s troubling,” Crain says. “Troubling.” You find the quatryl in his quarters, sulking behind a newly made desk, cobbled together from scraps of wood and the legs of his bed. He’s poring over your work on the cipher, but it doesn’t seem to be the breakthrough he was hoping for.</p><p>“You sorted their letters,” Crain says. “I much appreciate it, but your solution just leads to more problems. It seems the author of this tome has taken steps to shroud their work in deeper levels of obfuscation.” Crain stabs his quill into his ink pot and slouches back in his chair.</p><p>“It’s not complicated by any means, just time-intensive,” he says. “I’ve got the title at least: Project Source, by Mistress Torfi Logren. It appears to be a research journal. These Quatryl researchers were investigating some phenomena in the North. I can’t say what they were looking for, but this section here.”</p><p>He holds up the tome, open to a page with a very small, very crude map surrounded by text. “This tells of an experiment at the largest of a series of spires. They were apparently built not too far from here. But the experiment, I don’t know. All I have is this.”</p><p>Crain hands you a small scrap of paper that shows a diagram of sorts. “I’m sure you won’t have any trouble working out what it means. See if you can find this large spire and get to the bottom of it.”</p>",
		"rewards": { 
			"text": "Turn to the next page in the puzzle book." 
		}
	},
	"32.3": {
		"title": "Visiting Trader",
		"text": "<p>A carriage piled high with blankets and carpets is tucked between a snowbank and a building near the edge of town. Its old owner sees you wandering by and looks both ways before beckoning you over.</p><p>“Nice place, nice place this Frosthaven. Cold though, eh? Heh. Maybe you’re the sort of people who would like some hot items.” He chuckles a bit to himself as he pins back a blanket on his carriage, revealing assorted items in like-new condition.</p><p>“I just need a few motivated buyers. Shouldn’t be trouble up here, no… but I wouldn’t wear these out in, let’s say, uh, Gloomhaven for a while. Heh.”</p><p>You’re not planning on heading south to that decrepit city any time soon. Might as well pick up a few items at a steal of a price.</p>",
		"rewards": { 
			"text": "Each character may buy one item from the purchasable item supply for its listed price or one material resource for 7 gold." 
		}
	},
	"36.8": {
		"title": "Puzzle Solution (puzzle #6)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>You and Crain stand in the Quatryl’s study, looking down at his desk. Atop it sits a shard of ice that you took from the Prince of Frost’s realm, and next to it is Crain’s lamp. Nothing is happening. The lamp flickers green, but the ice sits stubbornly frozen and unchanging—no vapor, no energy.</p><p>“Nothing,” Crain says. “It’s not related at all to the energy we’re researching. Though, I do recognize a few things in your report.” Crain snuffs out the lamp and moves over to his small fireplace, in which he’s worked a stifling blaze. “That bit of verse I translated—which, let’s hope there’s no more of that—it mentioned an Ice Prince not unlike the creature you found. Spoke a good deal about capricious spirits and the like, beings that appear during northern storms and vanish into the air. Logren found the poem and thought the creature might be related to the energy.”</p><p>Crain tosses two handfuls of kindling onto the already roaring fire. You squint at the flames and spot a small object that he seems to be heating: a brass orb, except it can’t be brass because it hasn’t melted or changed shape.</p><p>“Her team found the Ice Prince, same as you, but their visit didn’t go as well. She ultimately ruled it out as an avenue for investigation, too dangerous and no obvious connection to the energy. I’d been hoping she made a mistake but no, she doesn’t seem to make any.” Crain takes up a pair of billows and works the flames until they’re practically scorching his face.</p><p>“In any case,” he says, head turned from the heat. “They did speak of an energy site not too far from where you were. A forest.” Crain takes a pair of tongs and removes his heated orb. It’s glowing now, a dark red ball that he immediately plunges into a bucket of water, filling the room with steam.</p><p>“That look on your face reminds me of Satha. ‘Crain stop smelting metal in your quarters, Crain stop testing elixirs on the watchmen, Crain stop trying to capture lightning in a cage.’ A bunch of worriers, the lot of you.” Crain reaches his tongs into the bucket and pulls out the cooled orb. It’s taken on a deep black color and there are faint scratches going all around its exterior that look similar to the ancient quatryl writing.</p><p>“Just go explore that forest already. Torfi’s notes say something about an energy source, and then “up, down, right”. If you can figure out what that means, then maybe I will be able to figure out this blasted experiment!” Crain says this with finality and dumps the orb unceremoniously back in the fire.</p>",
		"rewards": {
			"text": "Do not turn to the next page in the puzzle book. Instead write the solution to the next puzzle on the same page."
		}
	},
	"41.1": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>Captain Olmstead, head of the town guard, brings you out of the cold and into the warm barracks. By the fire is a shivering Inox girl wrapped in heavy pelts. The rest of the normally lively barracks is empty, cleared out at the Captain’s orders. He speaks quietly to you, out of earshot of the girl.</p><p>“Patrol found her outside the wall, frozen half to death. Claims someone called ‘The Collector’ has been holding her and her brothers for a few weeks now. I don’t have the troops to spare, but I’m not letting this one languish over at the town hall. Someone has to do something.”</p><p>You draw closer to the girl as nonthreateningly as you can. She tries to put on a brave face when she sees you, but the façade doesn’t last long. After a few deep breaths she speaks. “I… I think I can tell you where. He has my brothers. The Collector…” She sobs, and Captain Olmstead puts a reassuring hand on her shoulder. “Promise me you’ll stop him.”</p>",
		"rewards": { 
			"scenarios": [{ "id": "087" }]
		}
	},
	"42.2": {
		"title": "Request from Infuser",
		"unlockedBy": { "section": { "id": "92.2" }},
		"text": "<p>You’re crossing one of Frosthaven’s busiest lanes when you spot your friend the Infuser, their Orchid nose buried in a book, about to step into the path of an oncoming Kivak. You seize their crystalline shoulder to pull them back to safety.</p><p>They look up at you, bemused, hardly noticing the rescue. “The Radiant Forest!” they exclaim, and eagerly display the book. “I may have found a way to increase the power of my infusions, do you see?” The ancient leather tome depicts botanical illustrations of specimens collected from the forest. Writing in the margins speculates over their odd alchemical properties. The language is indecipherable to you, but the Infuser seems to know it, perhaps by virtue of their vast lifespan and experience.</p><p>“This writer couldn’t grasp the full significance of their findings,” the Infuser says, frowning. “Plants, more than anything, absorb the energy around them. The entire forest could be latently magical. I must investigate further!”</p><p>Flipping to the index of the book, the Infuser shows you an old map of the Radiant Forest with various notes and markings. “How do you feel about an adventure? Excellent! We can set out straight away!” They launch off, and you have to seize them again before they collide with a cart full of cabbages.</p>",
		"rewards": {
			"scenarios": [{ "id": "119" }]
		}
	},
	"43.5": {
		"title": "Puzzle Solution (puzzle #3)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>Crain’s room is empty. The books, the papers—everything is still here, but the Quatryl himself is missing. Given you’ve never seen him outside his room, you find it a bit odd and set out to find him.</p><p>Nearly half an hour later, you spot the Quatryl shuffling between cabins. In one hand, he’s carrying a half-used torch and in the other, a pot of pine pitch. As you approach, you notice he’s shaking his head and talking, as if stuck in an argument with himself. It isn’t until you’re a few feet away that he notices you.</p><p>“Ah ha,” he says, a bit surprised. “It’s nice to see you again. And what’s that?” You hand him your notes on the diagram and explain what happened in the spire, but the Quatryl seems distracted.</p><p>“Yes, it’s troubling. Good work, but troubling.” He pockets the note. “Listen, I have some news as well, but I’m in the middle of an experiment so you’ll have to walk with me while I explain.” The Quatryl starts moving without waiting for a response.</p><p>“The book, Project Source,” he rattles on, gesturing with his charred stick. “I’ve made some more progress with the translation, but in order to move any further I need you to verify some of the—er—findings.” The two of you snake between cabins and Crain pauses to sift through a pile of junk, pulling from it a piece of ruined cloth which he wraps around the used torch. Satisfied, he keeps moving.</p><p>“According to their notes, the researchers concluded the energy source at the spire was too dangerous to work with and so it was ultimately abandoned—a very grim account, I assure you. Though it sounds like you know exactly what they mean.” He stops at a section of the palisade wall and, using a metal spoon, scrapes out a bit of clay from between the logs. He crumbles the clay into his pitch pot and keeps walking. “But their account did help me crack one of their thornier words in their dialect—death.</p><p>“It would seem these researchers were very interested in the concept. After the incident at the spire complex, they went on to investigate a new location, one they only refer to as the ‘death site.’ I need you to find it and tell me what’s inside. Torfi’s journal contains a sketch of some device at the site. If you come across it in your travels—should be in a temple or crypt of some kind—hopefully her notes will prove useful.”</p><p>Crain comes to a sudden halt. He’s brought you to one of the guard stations, right next to one of the iron braziers they use to keep warm. The guards themselves watch from their post as Crain, without any ceremony or explanation, Crain dunks his stick into the pitch pot and then shoves the gloopy thing into the guard’s fire, which bursts into a violent blue flame.</p><p>“Ach, all wrong.” Crain holds up his torch, the flame burning a brilliant sky blue. He scoffs, drops it into the snow, and walks off.</p>",
		"rewards": { 
			"text": "Turn to the next page in the puzzle book." 
		}
	},
	"44.4": {
		"title": "Tome of Elements",
		"unlockedBy": { "event": { "id": "SR-48" }},
		"text": "<p>“I really enjoyed the, uh, the ending, Miss Eddica. A great twist!” A fresh-faced soldier is finishing up a conversation with the Valrath librarian as you enter. Eddica gives a smile from behind her desk as she checks in the book. Two more dockworkers wait in line for recommendations on additional literature from the young librarian—they’re nearly tripping over themselves for a chance to talk to her. She spots you and politely shoos them out the door, finally settling to a seat on the edge of her desk.</p><p>“I expected running a library to be more like Master Scrim’s… he had so much more uninterrupted time than I seem to have. In any case… do you have what I hope you have?” She purses her lips in anticipation, and when you pull the citrine-studded hide tome you found from your satchel she rushes over to snatch it from your hands, looking over it with wide eyes. “The Tome of the Elements! It’s true!”</p><p>She pushes up her red-rimmed glasses and collects herself. “Now, this is supposed to be the most volatile of the tomes. Let’s see if I can deactivate it…” She traces a sigil in arcane white light on the cover before bracing herself and gingerly cracking it open. No sparks, no explosions.</p><p>“There we go!” The pages splay out and Eddica hums a happy tune as she looks through the tome, punctuated with little “a-ha”s and lots of nodding. After a moment she sets the book down, looking up at you with a wide smile. “They’re actually in here! And I have heard very few accounts of these spells being painful.” She lays out the materials on the desk beside her.</p><p>“So, which will it be?”</p>",
		"sectionLinks": "<p>If you offer to test the fire spell, read [section_104.3] now.</p><p>If you offer to test the cold spell, read [section_163.1] now.</p>"
	},
	"46.2": {
		"title": "Puzzle Solution (puzzle #7)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>You hear about the fire from the first moment you pass back through Frosthaven’s gates. By the time you arrive, the smoke has long since stopped, but you find the Quatryl himself, dressed in a borrowed shirt and pants, picking through the charred remains of his study.</p><p>“Look,” Crain says, propping up the charred slab that used to be his desk, “I know what you’re going to say, and I assure you it isn’t anything Satha hasn’t already told me at length.” He eases the slab against the wall but it cracks in the middle and the two pieces fall back to the ground. “At length.”</p><p>You offer the scholar your condolences but he is clearly more interested in the stone you brought back from the Radiant Forest.</p><p>“As reliable as ever, my friend!” He says and takes it, still warm in its carrying cage. He leads you back outside the smoldering mess to where his intact belongings are stacked up in a pile. Much of his gear and books survived the fire, thankfully, but with no place to go just yet, Crain begins the experiment right there on the snowy road. He lights the green lantern and sets it down next to the radiant stone and it immediately draws a reaction. Thick orange vapor steams off the rock and envelopes the lamp, not as a whirlwind but as a bulging, smoky plume. Crain, muttering something about not wanting to hear Mayor Satha lecture again, turns out the lamp before the vapor builds any more.</p><p>“That’s three energy sources, now,” he says, with new vigor. “That means I can finally move on from fiddling with these little fireplace experiments and get on to the real work.” He laughs and a sinking feeling grows in your stomach. “Which reminds me, before the incident, I’d been translating a new section of the book and I wanted to run it by you.” Crain hands you a strip of parchment that’s next to impossible to read in the dark.</p><p>“It’s an alchemical chart from the book but it’s only partly filled out. I believe the energies from our three sites can be combined, but I can’t do it without a proper alchemist who understands all this. See if you can recruit one, then we should be able to put this puzzle together.</p><p>“In the meantime,” Crain heaves his pack over his shoulder and picks up his lamp. “I need to find a new room.”</p>",
		"rewards": {
			"text": "Turn to the next page in the puzzle book."
		}
	},
	"47.1": {
		"title": "Lurker Rumors",
		"unlockedBy": { "event": { "id": "WO-07" }},
		"text": "<p>“Big as a wagon, I swears it!” The Quatryl sailor’s eyes are dim with drink, but she continues undaunted. “A giant Lurky, all green and red. Claws bigger than a horse. Passed right by my boat, I was lucky to escape with my life!”</p><p>Tall tales at The Crater are just one more thing you’ll miss about summer once the final ships heave away and the Biting Sea becomes once again impassable with ice. You turn back to your drinks as one of the Quatryl’s companions begins his own tale in the age-old ritual of one-upmanship, “Well, I saw one bigger than a ship! Ten times the size of your’n…”</p>",
		"rewards": {
			"text": "If Uniting the Crown <span class=\"fw-normal\">[scenario_60]</span> is complete, gain 2 morale.",
			"events": {
				"WO": [{ "id": "WO-70" }]
			}
		}
	},
	"52.3": {
		"title": "Puzzle Solution (puzzle #5)",
		"unlockedBy": { "other": "Puzzle Book" },
		"text": "<p>“But why does it always have to be so damned cold?” Crain shouts, his voice half-stolen by the wind. Honestly, you never thought to ask.</p><p>You’re standing on a seaside cliff, one of the many that line the northern coast. To your right is the Biting Sea, that stretches into a wide, churning horizon, while to your left lie the frozen plains. Each inspires a certain threatening respect, but you’re not here for either of them—you’re here for the fjords. The long, jagged scars cut through the seaside cliffs, sinking down perhaps two hundred feet to the ocean below. At first glance they appear like any other rocky chute, but when you look near the top of one, you can see several large gouges in the stone that couldn’t have been made by any natural force. You told Crain about them back at Frosthaven, and he demanded to see them at once. His enthusiasm has dampened somewhat since then.</p><p>Grumbling, Crain lights his lamp and, just like last time, several strings of ghostly vapor rise from the ground to collect around it, though this time they are a deep purplish color. They only collect for a moment and then Crain snuffs the light and nods.</p><p>“Confirmed,” he says. “And judging by the other markings you found along these cliffs, and the notes left in Project Source, I’d say there was a series of battles up and down this coast. Must have been quite the, em—” Crain goes quiet for a moment, staring down into the fjord below. Several long seconds pass and when you ask if he’s alright, the Quatryl jumps as if woken from a dream. “Of course! Yes, perfectly fine. Just something I read. As I was saying: a series of battles. But there should be another site somewhere up here, one that’s quite a bit different than this. Keep searching further to the north and see what you can find. I don’t have much direction other than that. Truth be told, I’ve been avoiding the next section of translation.” His eyes narrow and his lip curls, exposing sharp teeth. “It’s all poetry.”</p>",
		"rewards": {
			"text": "Turn to the next page in the puzzle book."
		}
	},
	"54.3": {
		"unlockedBy": { "scenario": { "id": "019" }}
	},
	"57.3": {
		"title": "Harvest Festival",
		"unlockedBy": [{ "event": { "id": "SO-36" }}, { "event": { "id": "WO-61" }}],
		"text": "<p>The populace has an electrifying energy running through them this morning— today is the Harvest Festival, a day to celebrate the success of this stubborn outpost in the middle of such an inhospitable region.</p><p>Mayor Satha gives her customary words of wisdom, walking the fine line of a leader who both bolsters the town’s success and must acknowledge the souls lost in that endeavor. The town waits for the two most important words of the day, and after teasing the end of her speech several times, she finally gets down to it with a smile: “Let’s eat!”</p><p>Piles of grain-cherry custards, tin-berry tarts, crusty meat pies, and flavored ice swirled with sugar supplement the free-flowing axenut ale. The party-goers’ constitution runs out well before the drinks, and while there’s some blanks in your memory the next morning, there isn’t anything in this world you’d trade for the bits you do remember.</p>",
		"rewards": {
			"text": "Gain 2 morale."
		}
	},
	"62.2": {
		"title": "Bathysphere Plans",
		"unlockedBy": { "scenario": { "id": "022" }},
		"text": "<p>A high, nasal voice reaches you at the back of The Crater, Frosthaven’s recently rebuilt canteen.</p><p>“I have it, ach, I have it!” This is Pinter Droman, the outpost’s best and only tinkerer, and he’s pushing his way through the smoky gloom to find your group at your usual table. When he arrives, you see that Pinter’s eyes are raw and his skin has a waxy shine, which means he hasn’t been sleeping again.</p><p>“The seawater, I have a way around it! Or, rather…” Pinter unrolls a scroll of parchment on your table, pushing aside your drink. The parchment shows a diagram of some sort of armored ball. “Through it! In a bathysphere!”</p><p>The tinkerer goes on to explain that with this “bathysphere” you could safely descend deep into the Biting Sea for short periods of time. But that only solves the problem of the pressure; you still need to avoid freezing. “I have a plan for that too!” Pinter exclaims, his bleary eye twitching. “All I need is a very, very powerful heat source.” As luck would have it, Pinter believes you might be able to find such a thing somewhere in the middle of the Radiant Forest.</p><p>“The whole forest is unfrozen, even in the winter, so something must be heating it!” Pinter says. “I can’t be certain what it will look like, but I’m certain it’s there, yes. Ah, and with your particular skills, finding it should be no problem.”",
		"rewards": { 
			"scenarios": [{ "id": "033" }]
		}
	},
	"66.2": {
		"title": "The Pass is Ready",
		"unlockedBy": { "scenario": { "id": "115" }},
		"text": "<p>“It’s ready!” Pinter Droman shouts as he bursts into Satha’s cabin, interrupting your meeting on the latest building projects. The excitable tinkerer opens his mouth as if to continue speaking, but only gasps for breath.</p><p>Satha leans back in her chair and winks at you. “What’s wrong, Pinter, did you run all the way here from the Frozen Pass?” she asks with a smirk.</p><p>“No,” Pinter wheezes, “I had to stop a couple times. But it’s ready! The shortcut through the Frozen Pass is complete! I call it… Droman’s Path!”</p><p>You helped Droman with this project on a couple of occasions, but you hadn’t expected it to be done so soon. Thanks to a lucky landslide, Pinter’s ingenuity, and weeks of backbreaking work, this shortcut could shave days off the dangerous trek through the Frozen Pass. Satha explained why this was so important: A shorter trip means more traveling merchants coming to Frosthaven, which in turn means more life-saving supplies for the beleaguered outpost.</p><p>Satha laughs in delight, clapping the breathless Quatryl on the back. “Great work, Droman! We’ll send for some of the braver merchants to give this a test run as soon as we’re able.” She turns to you with a smile. “You helped build this path as much as anyone; you should be there to celebrate when the first caravan rolls through!”</p><p>The mayor’s grin doesn’t falter, but you’re pretty certain you detect an edge in her voice, and you understand the unspoken end to her sentence: “—in case anything goes wrong.”</p>",
		"rewards": {
			"scenarios": [{ "id": "116" }]
		}
	},
	"68.1": {
		"title": "Xain's Gambit",
		"unlockedBy": { "event": { "id": "WO-10" }},
		"text": "<p>Sure enough, Lurkers show extreme interest in polar bear meat. The proposition spreads by word of claw and Xain finds you on the street to deliver your gains, minus his fee.</p><p>“What did I tell you? Lurkers can’t get enough of that fatty polar bear steak!” A realization crosses the Orchid’s face. “I wonder if I can get the Algox interested in bottled seawater somehow…”</p>",
		"rewards": {
			"text": "Gain 50 collective gold."
		}
	},
	"86.1": {
		"title": "Protect the Pass",
		"unlockedBy": { "scenario": { "id": "114" }},
		"text": "<p>The Crater is as lively as you’ve seen it all season. You signal for a drink as you push through the customers and make your way to a table at the back, where the Quatryl tinkerer Pinter Droman fiddles with a small spherical gadget, deep in thought. You sit down, interrupting his trance.</p><p>“OH! Hello again, thank you for coming! VERY exciting news to share!” The boisterous Quatryl tears his focus from the trinket. “We are on the next phase of our little shortcut through the mountains. A big portion of the path needs to pass under a dangerous overhanging cliff. The work crew is already installing pylons to support the cliff and hold back the rock wall, but…” he hesitates. “It seems our path inadvertently cuts too close to Algox territory, and they’re not taking kindly to our construction project.”</p><p>He raises his hand, cutting off the expected suggestion. “Diplomacy isn’t an option, I’m afraid,” the tinkerer sighs, “The Algox who are attacking belong to a group of bandits—the Horns of Ruin, they call themselves—and they are exclusively interested in destroying and looting our hard work.”</p><p>“There’s a big attack coming, and the project is in a very vulnerable state. I need you to go protect the pylons we’ve installed. If you can stop them, it might buy us enough time to get the whole structure pieced together. Once that happens, it will be nearly impossible to destroy!</p>",
		"rewards": {
			"scenarios": [{ "id": "115" }]
		}
	},
	"91.4": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>A knock at your longhouse reveals a guard you recognize from the battlements, hat in hand. You invite him in to get out of the cold night air.</p><p>“I’m not sure where else to turn. My wife is expecting. But the baby hasn’t arrived yet, and… and I think I know why.” The guard looks fragile without his armor. With a hitch in his voice he mumbles, “Do you believe in being cursed?”</p><p>A sigh heaves through his chest. “I was at my post in the guard tower last month and I looked out into the forest. There was a woman out there… I could barely make her out against the snow. Transparent, dressed all in white, looked almost like a ghostly Aesther, if you’d believe that.” He grips his hat tightly, refusing to look at you.</p><p>“She didn’t have a face, just pits where her eyes could’ve been, and this trickle of blood ran out of them.” He shudders. “She floated right up, tapped my forehead, and was gone.”</p><p>“I told the other guards, but they didn’t believe me. But I can feel it. She cursed me. And my wife and my child are going to pay the price.” He pulls out a satchel of gold coins. “I don’t have much, but I’ll give you all I have to lift this curse and save my family before it’s too late.”</p>",
		"rewards": {
			"scenarios": [{ "id": "086" }]
		}
	},
	"94.4": {
		"title": "Sneak Past the Lurkers",
		"unlockedBy": { "section": { "id": "114.2" }},
		"text": "No matter how dangerous this army, you share Sun in Shallows’ feelings of despair at this outcome. You tell Droman to hold off. Maybe you can find another way through the army.",
		"rewards": {
			"text": "<p>Place map overlay sticker Z on the map in location Z (F2).</p><p>Do not resolve an outpost event this week.</p>",
			"scenarios": [{ "id": "049" }]
		}
	},
	"100.3": {
		"title": "Business Proposal",
		"unlockedBy": { "scenario": { "id": "128" }},
		"text": "<p>“I’m glad we were finally able to meet.” You sit in The Crater across from Derrick Windmere, the noble you met with those two drunken brothers some weeks ago. “I have a business proposition. See, my family, well, they’re quite influential down south, and they’ve always had high expectations of me—expectations that have been very difficult to live up to. I’ve come to the north to get away from their constant disapproval, but I think I’ve actually managed to stumble upon an opportunity that could change all that.”</p><p>At this, Derrick unrolls a bundle of cloth, sending a beautiful yellow gem clattering across the table. “Sun agates. Very fragile, but those Oak zealots, the Radiant Order, go absolutely bonkers over them. Embed them in all their stuff, claiming they help them commune with the Great Oak to strengthen their holy powers. But that’s not important. What’s important is that the Radiant Order is very rich, and I just discovered a source of these gems up here in the north.</p><p>“Seems the Algox mine them for their own purposes—possibly religious too,” Derrick says, shaking his head with exasperation. “But they’re not too keen on negotiating, so we’ll need to take their mine by force. Don’t worry, though. I’m not asking you to take on that many Algox. I can get a private militia up here to do that, but before I bring this to my family, I need solid proof that it’s worth the investment.</p><p>“Not one crystal,” he says, pointing to the gem in your hands, “But a cartful. I’ve got a few men out in the field already, and they’re reporting that the Algox are preparing to make another shipment of agates from the mine. So all I need you to do is ambush that shipment and bring it back to me.”</p>",
		"rewards": {
			"scenarios": [{ "id": "129" }]
		}
	},
	"103.2": {
		"title": "Lumber Shipment",
		"unlockedBy": { "event": { "id": "SO-10" }},
		"text": "<p>A stern knock on your longhouse door reveals a man with skin as thick as leather. He tips his hat, then asks you to sign for a delivery as two men unload his wagon.</p><p>“Told you I’d come back around with those materials you ordered. The pass is brutal, but the gains are sweet.”</p>",
		"rewards": {
			"text": "Gain 5 collective [lumber] and 2 collective [metal]."
		}
	},
	"104.1": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>You’re walking by the docks when you spot the seafaring Captain Doghogger trying to round up a crew. He approaches you with urgency.</p><p>“I just got word there’s an abandoned ship full of supplies in the bay. No crew, going to be at the bottom of the sea soon.” Captain Doghogger takes a sip from a metal canteen and swishes the liquid around his mouth before swallowing. He’s seen some hard times in his past—much like anyone who has made their way to Frosthaven—and he isn’t one to turn down the opportunity for some easy loot.</p><p>“Fishing crew told me they spotted it out there. Sounds like it’s barely above the waterline, just waiting for someone to help lighten its load. Easy job, in and out and we salvage whatever we can. Probably not a thing to fear, just need a team with strong backs to grab as much treasure as we can carry. Eh? What do you say we head over and take a look?”</p>",
		"rewards": {
			"scenarios": [{ "id": "092" }]
		}
	},
	"104.3": {
		"title": "Tome of Elements",
		"unlockedBy": { "section": { "id": "44.4" }},
		"text": "<p>Eddica runs her finger down the page of the Tome of the Elements. She utters something under her breath, dips her finger at the melted base of a wax candle, and traces something on your foreheads.</p><p>“That should do it—ouch!” She quickly sucks her fingertip into her mouth. She looks back at you with a shrug. “Got hot.”</p>",
		"rewards": {
			"text": "<p>During the next scenario, the element [fire] token does not move from the waning column to the inert column at the end of any round.</p><p>Gain “Tome of Elements” [item_216].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"107.2": {
		"title": "Tome of Time",
		"unlockedBy": { "section": { "id": "181.1" }},
		"text": "<p>Eddica reviews the tome and is impressed with the technique description. “This really makes the positioning clear, I’ll have to make note of this format for my own writings.” She taps the page a couple times, mouthing the words, then looks up to your companion and speaks with a flick of her wrist: “Temporialius wrinklae!”</p><p>A haze wraps around the subject and Eddica’s lips turn up in a smile. “Lovely.”</p>",
		"rewards": {
			"text": "<p>In the next scenario, the selected player returns any number of ability cards in their discard pile to their hand at the end of the second round.</p><p>Gain “Tome of Time” [item_217].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"114.2": {
		"title": "Attacking the Lurkers",
		"unlockedBy": { "scenario": { "id": "042" }},
		"text": "<p>You sit at your regular table in The Crater, trying to enjoy your mugs of ale as the inexhaustible tinkerer Pinter Droman chatters ceaselessly. He has been at your side constantly since the bathysphere mission, peppering you with questions… which is exactly why you decided you needed a drink.</p><p>“Now, on a scale of one to ten, how many fires occurred onboard during your dive? I theorized only a small probability that the air tanks would explode, and—”</p><p>Pinter’s questions are cut short as an Orchid guard runs breathlessly up to your table. “You have a, uh… a visitor… at the dock gate…” she pants. “It’s a… Lurker. And it, uh, wants to see you, I think?”</p><p>You put your drinks down and head toward the docks, where you see a lone Lurker sitting patiently. You recognize Sun in Shallows, the Lurker who first told you about the shards and the fate of its people. Archers line the walls, plucking nervously at their bowstrings as you wave for the gate to open and go out to meet your caller.</p><p>It’s clear that Sun in Shallows has seen combat since you last met; new cracks run like spiderwebs over her shell and the Lurker leans to one side as she sits, favoring a few injured legs. The giant crustacean perks up as you approach, her psychic singsong greeting echoing in your minds. You wonder what could compel this creature to risk the wrath of the Frosthaven guards, but you realize you already know—the shards. They, and the crown they form, compel Sun in Shallows and her awakened brethren as much as they compel you.</p><p>Your suspicions are confirmed as Sun in Shallows delivers her message, a stream of images and emotions running like a tapestry through your minds:</p><p>Huge coral structures reach upward like claws from the edges of a crater in the ocean floor, creating the impression of an enormous flower in mid-bloom. You feel the presence of a shard there, but the vision is obscured by an inky swirl of fear and darkness. The swirl expands as you watch, an unnatural aura attaching to the shard, guarding it, and drawing the Lurkers in the area under its influence, turning their already clouded minds to its purpose. They swarm around the shard hundreds strong: a horde, gathering to protect and spread the ever-growing corruption.</p><p>You see Sun in Shallows leading a group of Lurkers on an ill-fated attack to unseat the source of the corruption and retake the shard. From the intense sorrow accompanying the vision, you don’t need to see the fight to know that Sun in Shallows was the only one to escape alive.</p><p>The Lurker’s vision fades from your mind, but you see the stakes quite clearly: the crown can never be reunited until you get that shard, but more than that, this source of evil is gathering more beneath the waves, and it will continue to attack you—to attack Frosthaven—to corrupt as many shards as it can. But what can you do against such might?</p><p>“A psychic blast.” A voice from behind startles you. You hadn’t realized Pinter Droman had followed you from The Crater, much less that he’d been privy to the Lurker’s bleak vision. The tinkerer continues, almost to himself. “Too many to fight, even with a hundred bathyspheres. Yes, yes, but with their psychic attunement… it’s possible we could take advantage of that…stun them, perhaps…” He starts pacing, speaking more and more quickly as he gets excited about his idea. “I’d need to study this Lurker, of course; run some tests. Maybe even get a better look at one of those shards and find a way to harness its psychic energy… It’ll take some time, but I’m sure I could come up with a device to do the trick!”</p><p>Your response is cut short by a wave of sorrow washing over you. You don’t think Sun in Shallows can understand the words, but the Lurker can clearly sense the tinkerer’s intent, and her distress is palpable. The prospect of using the coral shards—her symbols of hope—to do harm to her confused brethren fills her with despair. The intensity fades quickly, though, as you feel Sun in Shallows accept that this may be the only way to reunite the crown and save her people from whatever foul thing is taking them. You feel a release, a resignation, and now a vision of the crown floats in front of you, coming to rest in your hands. Sun in Shallows leaves the decision to you.</p><p>“Just to be clear,” Pinter warns, “we’ll detonate this device right on top of where the shard is located. If I do my job right, it should knock out all the Lurkers in the area, but I can’t guarantee there won’t be some collateral damage at the epicenter.” You nod in understanding.</p>",
		"sectionLinks": "If you give Droman the order to prepare a psychic bomb, read [section_168.2] now. Otherwise, read [section_94.4] now."
	},
	"115.1": {
		"title": "Mysterious Crate",
		"unlockedBy": { "event": { "id": "WO-17" }}
	},
	"118.3": {
		"title": "A Call for Help",
		"unlockedBy": { "section": { "id": "193.1" }},
		"text": "<p>You are awoken in the middle of the night by the glowing apparition of an unfamiliar Aesther woman. “This is a call for help,” she says. “Several weeks ago, I sent my dearest friends your way, but I am afraid they may now be in danger. A storm is brewing. Find them before it is too late.”</p><p>In your mind, you see a location: rocky terrain somewhat west of the Frozen Pass, in the Imperial Mountains. It is the center of a massive snowstorm, and you realize you must head there immediately.</p>",
		"rewards": {
			"scenarios": [{ "id": "082" }]
		}
	},
	"119.3": {
		"title": "Random Scenario",
		"text": "<p>You hold the curiously fragile bit of machinery in your hand, and it suddenly comes to life, projecting some sort of illusory, three-dimensional map in the empty space above it. You try to touch this projection with your other hand, but it just passes right through the light, blanking out anything above it. Very strange indeed.</p><p>The map itself appears to be of some sort of ancient building that constructs machines, you wonder whether it is still operational and whether it may be beneficial to visit. After a considerable amount of tinkering, you discover a way to make the map zoom out, and there it is: a blinking dot on a very recognizable landscape. Shouldn’t be too hard to find.</p>",
		"rewards": { 
			"scenarios": [{ "id": "109" }]
		}
	},
	"120.5": {
		"title": "Great Dallum",
		"unlockedBy": { "section": { "id": "180.1" }},
		"text": "Something is off here. This description of the Great Dallum, even accounting for mistaken observations, isn’t even close. This is an impostor! You raise the alarm and soon others in the crowd take notice. The impostor’s handlers start exchanging nervous glances, and it doesn’t take long before the crowd turns into a mob, grabbing back the offerings and driving the charlatans out of town.",
		"rewards": { 
			"text": "<p>Gain 2 morale.</p><p>Do not resolve an outpost event this week.</p>" 
		}
	},
	"122.3": {
		"unlockedBy": { "scenario": { "id": "018" }}
	},
	"122.4": {
		"title": "Great Dallum",
		"unlockedBy": { "section": { "id": "180.1" }},
		"text": "The Great Dallum accepts your generous gift, whispering words of kindness into your ear. It’s not perfectly applicable, but as a metaphor there really is something to what he says. Yes, you get it now… this has some very practical applications, really. This changes everything.",
		"rewards": { 
			"text": "<p>Lose any 3 collective resources.<br/>Gain 2 inspiration.</p><p>Do not resolve an outpost event this week.</p>" 
		}
	},
	"124.1": {
		"title": "Puzzle Solution (puzzle #4)",
		"unlockedBy": { "section": { "id": "26.5" }},
		"text": "<p>“Splendid,” Crain says without any hint of irony. You are standing several dozen feet below ground in a nearly lightless crypt and all around lie piles of recently slain undead. “Really marvelous.”</p><p>When you returned to Crain to make a report on this “death site”, the Quatryl asked so many questions that you decided it was easier to just show him. Ten minutes down here, and the Quatryl has already pocketed a hunk of stone wall, two vials of dirt, a glob of imp residue, a square of matted fur, and a handful of loose teeth. Only once his pockets are bulging with dusty remains does the scholar stop and explain.</p><p>“These bodies,” he says, “confirm Logren’s theory about this place. Now, I simply need to repeat her experiment and we’ll know for certain.” Crain unties a small storm lantern from his pack and, after adding a dram of odd-smelling oil to the reservoir, lights it. The flame catches and burns an eerie green and, the instant it’s lit, several wisps of greenish vapor rise from the stonework and coalesce around the lamp.</p><p>“There,” Crain says. “This is what the researchers were investigating, a divergent energy that lingered—still lingers, apparently—in certain parts of the North. I’m still working through the notes but, from what I’ve read, this energy always reacts to the burning of a particular solution and it always triggers certain,” he nods at the pile of undead bodies, “unusual phenomenon.” Crain puts his lamp down and the green vapor begins to build, swirling around it like a tiny storm.</p><p>“Logren and her team theorized that the energy was the result of war fought long ago in the North. This crypt lies on one of the major battlegrounds.” The green storm circling his lamp gets bigger by the second.</p><p>“In order to understand the nature of the energy, we’ll need to investigate the other sites. There should be a few more points along the northern coast. I’ll give you a set of coordinates for a place to start.” He hands you a note that simply reads 3M-1L-7A.</p><p>You then watch as Crain pulls on a thick, oversized leather glove and, moving quickly, tries to snuff the lamp. However, when he reaches down, the green vapor attacks his gloved hand and tears at it with angry spectral teeth, taking out several visible chunks. As soon as the light is out, Crain rips the glove off and flings it to the far corner of the room, where it smolders a greenish smoke.</p><p>“Satha might be needing a new pair of gloves soon.”</p>",
		"rewards": {
			"text": "Do not turn to the next page in the puzzle book. Instead write the solution to the next puzzle on the same page.",
			"scenarios": [{ "id": "017" }]
		}
	},
	"127.1": {
		"title": "Puzzle Solution (puzzle #4)",
		"unlockedBy": { "section": { "id": "26.5" }},
		"text": "<p>“Oh how things change,” Crain says. You’re back at the abandoned temple, standing in the hall of worship, the floor full of broken glass and cold, split metal. Crain bends down, picks up a severed mechanical hand, then a foot, and stuffs both into his pack.</p><p>“Research,” he says and wanders off. When you returned to Crain to make a report on this “death site”, the Quatryl asked so many questions that you decided it was easier to just show him.</p><p>“So besides trying to kill you,” Crain asks, “were the machines doing anything strange?” He’s moving between the four darkened pillars, plucking up little bits of broken machinery.</p><p>When you can’t think of anything, Crain pours a dram of odd-smelling oil into his lamp and, using a torch and a bit of kindling, lights the lantern, but its flame is a bright emerald green. As soon as it flickers to life, the room begins to react. Thin wisps of yellow vapor, much like what was in the central orb, leak from the temple walls and coalesce around the lantern, whirling like a miniature storm.</p><p>“There’s your bit of strange,” Crain says. “And it confirms Logren’s notes. This is a death-site.” He steps back and the both of you watch the vapor build.</p><p>“This is what the researchers were investigating, a divergent energy that lingered—still lingers, apparently—in certain parts of the North. I’m still working through the notes but, from what I’ve read, this energy always reacts to the burning of a particular solution and it always triggers certain,” he clears his throat, “unusual phenomenon.” The Quatryl digs in his pack and pulls out a heavy, oversized leather glove.</p><p>“Logren and her team theorized that the energy was the result of a great war fought long ago in the North. This temple, or the mountain the temple was built in, was the site of a major battle.” The yellow storm circling his lamp gets bigger by the second.</p><p>“In order to understand the nature of the energy, we’ll need to investigate the other sites. There should be a few more points along the northern coast. I’ll give you a set of coordinates for a place to start.” He hands you a note that simply reads 3M-1L- 7A.</p><p>You then watch as Crain pulls on the glove and, moving quickly, tries to snuff the lamp. However, when he reaches down, the green vapor attacks his gloved hand and tears at it with angry spectral teeth, taking out several visible chunks. As soon as the light is out, Crain rips the glove off and flings it to the far corner of the room, where it smolders a greenish smoke.</p><p>“Satha might be needing a new pair of gloves soon.”</p>",
		"rewards": {
			"text": "Do not turn to the next page in the puzzle book. Instead write the solution to the next puzzle on the same page.",
			"scenarios": [{ "id": "031" }]
		}
	},
	"128.2": {
		"title": "Crain's Recovery",
		"unlockedBy": { "scenario": { "id": "025" }},
		"text": "<p>You have been lucky—luckier than most—to have never spent more than a few nights inside a gaoler’s cage. Of course, there have been times when your temper’s gotten the better of you, when you’ve indulged more than was wise, but you’ve never been forced to spend night after night, month after month sleeping on a stone floor with nothing to look forward to but a glimmer of morning light through iron-bars. So you can’t really fathom what it’s like to finally be free from prison or what a person would do when they finally got out, but you doubt they would do this.</p><p>Crain Tallengyr, the Quatryl scholar you rescued from the Unfettered catacombs, has transformed his previously clean, albeit sparse, room into the cluttered, cramped nest of an academic. Somehow between last night and this morning, the Quatryl has gathered several books and a large stack of parchment and he’s arranged everything on the floor around him like a flimsy mosaic. Behind him is a plate of half-eaten eggs and hard biscuits and several empty teacups. The bed is still made but the top sheet has been confiscated to sop up a large puddle of ink on the floor. His door is open and when you knock on the frame, his face lifts into a manic smile.</p><p>“My stalwart friend!” He bows without getting up. “Come to check on your rescued ward? What chivalry! And perfect timing, I might add. As you can tell, I’ve managed to get in a full night’s work.” Crain tries to pull out a book of notes, but you stop him, asking him about his ominous warning concerning the Unfettered.</p><p>“Oh, yes, them,” Crain waves his hands dismissively. “Certainly a problem. I suppose we are the ones best equipped to intervene. I’ve had plenty of time to study them, you see, and I am confident that if you bring me back into their facility to scavenge for some materials, I can create a device that will deactivate the Unfettered.</p><p>“But that,” Crain says pointedly, pulling out his book again, “is not the exciting part.” The Quatryl clearly wants to move on from those memories, so you take the hint and ask what he’s working on.</p>",
		"rewards": {
			"scenarios": [{ "id": "035" }]
		},
		"sectionLinks": "Read [section_190.4] now."
	},
	"129.3": {
		"title": "The Second Year",
		"text": "<p>While life on the tundra is anything but easy, your time in Frosthaven has earned you a pedigree few could ever touch. You’ve survived in the place where life is so hostile to your existence that some battered wooden walls are all that stand between you and an icy death. But today, with the sun cresting over the mountains and the promise of summer stretching before you, you can’t help but feel hopeful.</p><p>You’ve tested your strength against countless enemies, but you’ve made some friends in this pocket of life, too. While you don’t know what the next year holds, you know this place has earned its name: “home.”</p>",
		"rewards": {
			"text": "Gain 2 soldiers.",
			"events": {
				"SO": [{ "id": "SO-21" }, { "id": "SO-22" }, { "id": "SO-23" }, { "id": "SO-24" }, { "id": "SO-25" }, { "id": "SO-26" }, { "id": "SO-27" }, { "id": "SO-28" }, { "id": "SO-29" }, { "id": "SO-30" }, { "id": "SO-31" }, { "id": "SO-32" }, { "id": "SO-33" }, { "id": "SO-34" }, { "id": "SO-35" }],
				"SR": [{ "id": "SR-21" }, { "id": "SR-22" }, { "id": "SR-23" }, { "id": "SR-24" }, { "id": "SR-25" }, { "id": "SR-26" }, { "id": "SR-27" }, { "id": "SR-28" }, { "id": "SR-29" }, { "id": "SR-30" }, { "id": "SR-31" }, { "id": "SR-32" }],
				"WO": [{ "id": "WO-21" }, { "id": "WO-22" }, { "id": "WO-23" }, { "id": "WO-24" }, { "id": "WO-25" }, { "id": "WO-26" }, { "id": "WO-27" }, { "id": "WO-28" }, { "id": "WO-29" }, { "id": "WO-30" }, { "id": "WO-31" }, { "id": "WO-32" }, { "id": "WO-33" }, { "id": "WO-34" }, { "id": "WO-35" }, { "id": "WO-36" }, { "id": "WO-37" }, { "id": "WO-38" }, { "id": "WO-39" }, { "id": "WO-40" }, { "id": "WO-41" }, { "id": "WO-42" }, { "id": "WO-43" }, { "id": "WO-44" }, { "id": "WO-45" }, { "id": "WO-46" }, { "id": "WO-47" }],
				"WR": [{ "id": "WR-21" }, { "id": "WR-22" }, { "id": "WR-23" }, { "id": "WR-24" }, { "id": "WR-25" }, { "id": "WR-26" }, { "id": "WR-27" }, { "id": "WR-28" }, { "id": "WR-29" }, { "id": "WR-30" }]
			}
		}
	},
	"130.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>On the docks, you notice a Vermling peering down into the water. In one hand she carries a travel bag; she probably came to Frosthaven on the Lucky Lady, the ship that just docked. She introduces herself as Rattusca, and gestures down at the water, where a corpse is tangled in a line that hangs down from the ship’s bowsprit. The body looks like it’s been dead for some time; its clothing and armor are rotted through. The only thing intact are the wide gold bracelets around its bony wrists.</p><p>“Help me haul the body out of the water,” she tells you, “and if you’re interested in getting more of those wristbands, I can tell you where to find some, so long as you cut me in on the profits.”</p><p>You haul out the body of an Algox. It looks mummified, and has several chunks torn out of it, as if some hungry creature tried to feed on its leathery flesh.</p><p>Rattusca slips the wristbands off the corpse. “Just before we reached port, the ship struck an iceberg,” she tells you. “Fortunately it was a small one, and it broke apart. That’s where the body came from. I saw several more dark shapes inside the ice that may have been more bodies.”</p>",
		"rewards": {
			"scenarios": [{ "id": "090" }]
		}
	},
	"131.1": {
		"title": "Xain's Gambit",
		"unlockedBy": { "event": { "id": "WO-10" }},
		"text": "<p>When the third day passes without Xain turning up at The Crater with your investment proceeds, you know you’ve got a problem. You finally corner him at his home by the docks.</p><p>“Oh, right—I am so glad that you came by! I’ve been looking everywhere for you guys.” He wipes his brow nervously. “So, a little bit of a mixup with the polar bear meat. Turns out Lurkers? Really into it. But not as into paying with, uh… things of traditional value.”</p><p>He hands you an ill-looking flask.</p><p>“Good news is you’re now the proud owner of… that. They assured me it’s super healthy.”</p>",
		"rewards": {
			"text": "Gain “Unhealthy Mixture” [item_098]."
		}
	},
	"135.1": {
		"title": "Bathysphere Ready",
		"unlockedBy": { "scenario": { "id": "033" }},
		"text": "<p>Pinter Droman, the premiere tinkerer of Frosthaven, leads you to the large storehouse situated just behind his workshop. He collects himself for a moment, then throws open the doors with a flourish, announcing: “A bathysphere, my friends!”</p><p>What you see looks like a tiny, spherical prison. A glass-and-metal orb lies on a pallet in front of you, equipped with two crude propellers and a pair of clockwork arms. Inside it sit a number of rubber suits with glass fishbowl helmets. These suits are connected to the complicated machinery of the orb through tubes in their head and are meant to be deployed from the main bathysphere, “when more maneuverability is required,” Droman explains.</p><p>You’re not sure what to make of it all, but Pinter’s enthusiasm more than makes up for your reaction. He runs you through the machine’s functions, explaining how to adjust the internal environment, how to draw in air through a small outboard port and store it inside. All in all, it looks sturdy, but that does little to calm your nerves.</p><p>You pay the Tinkerer the rest of his fee, and shortly after, the bathysphere is mounted onto the ship. It’s time to set sail once again.</p>",
		"rewards": { 
			"scenarios": [{ "id": "042" }]
		}
	},
	"142.4": {
		"title": "Random Scenario",
		"text": "<p>You find an ornate letter sealed in wax. The stamp is a royal crest you don’t recognize. Upon breaking the seal and opening the letter, you find exquisite calligraphy and decorative touches flaked in gold dust. It appears to be an invitation of some sort:</p><p><em>My esteemed friends,</em></p><p><em>This letter has found its way to you, and by that alone I know that you are fated for grand things!</em></p><p><em>Since you are of quality (unlike most of the other rabble I’ve seen in these blasted lands), I extend a warm, open invitation to join me and my court for a Midwinter Ball. I’m sure you’ve heard of my soirées! I can assure you that it will be just as unforgettable as the rumors grace them to be. There will be dancing, merriment, and excitement unparalleled.</em></p><p><em>I’ve enclosed a map to my estate that I trust you will hold in confidence. Come—alone—when the winds howl and the winter sun drags in the sky in the bleakest way. We shall share a toast and the warmth of a roaring fire.</em></p><p><em>-His Grace, Emperor Ventillion</em></p>",
		"rewards": { 
			"scenarios": [{ "id": "107" }]
		}
	},
	"146.4": {
		"title": "Random Scenario",
		"text": "As you look down, you hear a tiny squeak. Well, isn’t this wolf cub just a little treasure? Its tail thumps happily as you reach down to pick it up, and it lunges to lick your face. The tiny, adorable pup is too young to survive on its own, and you decide to take it back to Frosthaven with you.",
		"rewards": { 
			"scenarios": [{ "id": "112" }]
		}
	},
	"151.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>You’re polishing off a round of ale before bed when the door opens with a light creak. With near-imperceptible slowness enters the oldest orchid you’ve ever seen; were it not for the lumbering walk you’d take her too-large crystals to be a fallen chandelier, not a sentient being.</p><p>By the time she’s made her way over to your table your party is in the midst of exchanging goodnight wishes. She settles into an open chair with a rattling thump.</p><p>“My, what fortuitous provenance! Just the merry band I was hoping to see.” She speaks slowly and deliberately, a light hint of an accent you can’t place dotting her speech. “I’ve been told you are the choice for matters outside the typical. And my, this matter is far from typical.”</p><p>She pauses for dramatic effect, but her timetable is skewed much too far. By the time she resumes speaking your party is exchanging concerned glances: did she die at the table?</p><p>“The matter, of course, touches the very core of a group like you.” The ponderous crystals obscuring her mouth twist and rattle against each other. Is she… smiling?</p><p>“But we will get to that, I understand the protocol. I may be old, but I imagine my gold is still good?” She shifts and her slow hand drops a sack of gold on the table. It’s clear these are not typical coinage: despite their excellent condition they’re of an antiquated design. Gold is gold, though.</p><p>She takes the look on your faces as sufficient. “Wonderful! I look forward to our adventure!”</p>",
		"rewards": {
			"scenarios": [{ "id": "099" }]
		}
	},
	"152.3": {
		"title": "Library Lesson",
		"unlockedBy": { "section": { "id": "143.2" }},
		"text": "<p>Eddica, the resident librarian, wraps up the last of her weekly lessons. “And that’s why a week is just ten days long.” She checks off the final item on a long checklist, then sets her red-rimmed glasses down on the table beside her. “Well, that settles my end of the bargain. If there’s more to learn in this world, it certainly won’t be from me.”</p><p>She stands from behind her desk, straightening her skirt. “So that leaves your part. It’s time you find those books of power—” she stops herself, wagging a finger, “—no, those tomes of power, and help me get on with my research.”</p>",
		"rewards": {
			"events": {
				"SO": [{ "id": "SO-58" }]
			}
		}
	},
	"155.2": {
		"title": "Xain's Gambit",
		"unlockedBy": { "event": { "id": "WO-10" }},
		"text": "<p>When the third day passes without Xain turning up at The Crater with your investment proceeds, you know you’ve got a problem. You finally corner him at his home by the docks.</p><p>“Oh, right—I am so glad that you came by! I’ve been looking everywhere for you guys.” He wipes his brow nervously. “So, a little bit of a mixup with the polar bear meat. Turns out Lurkers? Really into it. But not as into paying with, uh… things of traditional value.”</p><p>He hands you an ill-looking flask.</p><p>“Good news is you’re now the proud owner of… that. They assured me it’s super healthy.”</p>",
		"rewards": {
			"text": "Gain “Unhealthy Mixture” [item_098]."
		}
	},
	"156.1": {
		"title": "Opening the Pass",
		"unlockedBy": { "scenario": { "id": "004" }},
		"text": "<p>“Fascinating, yes… a fascinating challenge… Oh, and an opportunity for the outpost, of course!”</p><p>A Quatryl wrapped in a thick green cloak paces the floor of Satha’s cabin, lost in thought as the mayor looks on from her seat by a map-strewn table.</p><p>Satha raises a hand in greeting as you open the door, and the Quatryl whirls toward you, startled. “OH! Yes, perfect, perfect, you must be the ones Satha mentioned. Pinter Droman, tinkerer extraordinaire, at your service.” He bows with a flourish.</p><p>Satha clears her throat, cutting Pinter’s introduction short. “A recent landslide changed the landscape of the Frozen Pass,” the mayor explains, “Between the rocks that fell out of the way and the valleys they filled up, we think we can create a shortcut through the Coppernecks that could save days for supply teams and merchants coming across the mountains.”</p><p>You recall your own recent journey over the pass, and agree you’d have appreciated a shortcut.</p><p>“That’s the spirit!” Satha continues, “A shortcut means more merchants bringing goods, and more goods means more outposters survive the winter. Pinter here is in charge of the engineering.”</p><p>“Yes!” Pinter jumps back in, unable to contain his excitement. “The place we’re looking to build,” he points to a map on the table, “is a landslide area that’s almost clear of rocks. I’ve created explosive devices to help remove the rest, but the fauna of the area are quite aggressive, and I can’t get a team close enough to plant the charges.”</p><p>“That’s where you come in,” Satha explains. “I told Pinter you’re the only ones I trust to get those bombs where they need to be and handle yourself against the local animals. We’ll have the charges packed and ready to go at dawn.”</p><p>You nod and turn to go prepare your own supplies, but Pinter interjects. “And not to worry, the charges are completely safe!” he says, unprompted. “I’ve learned so much since my, er, unfortunate incident in Gloomhaven.” Somehow his assurance does not increase your confidence.</p>",
		"rewards": { 
			"scenarios": [{ "id": "114" }]
		}
	},
	"157.3": {
		"title": "Job Posting",
		"text": "<p>The Crater, the burned-out dent where a tavern used to be, has been seeing some action the past few nights. The community has taken to the limited warmth it provides, huddling around the mismatched donated furniture and sharing fermented liquids from their personal pantries. Gatherings tend to last until the small hours of the morning or until the cold settles in. While there are tarps strung to keep off falling snow, the lack of walls makes visitors easy targets for wind whipping through.</p><p>You’re just about to call it for the night when a Vermling you haven’t seen before steps up to the overturned dresser you’re using as a table. “I’m Scabwit, nice to meet me. My people are negotiating with some Algox for a spot to call our own and it’d be best if we had some brutes like you to keep the peace.” Scabwit adjusts a crystaltopped walking stick, turning it absentmindedly. “You’re the scariest-looking people here, so I’ll offer a trade: come be scary for me out in the Whitefire Woods and I’ll make it worth your time.”</p>",
		"rewards": {
			"scenarios": [{ "id": "093" }]
		}
	},
	"158.3": {
		"title": "Xain's Gambit",
		"unlockedBy": { "event": { "id": "WO-10" }},
		"text": "<p>Sure enough, Lurkers show extreme interest in polar bear meat. The proposition spreads by word of claw and Xain finds you on the street to deliver your gains, minus his fee.</p><p>“What did I tell you? Lurkers can’t get enough of that fatty polar bear steak!” A realization crosses the Orchid’s face. “I wonder if I can get the Algox interested in bottled seawater somehow…”</p>",
		"rewards": {
			"text": "Gain 30 collective gold."
		}
	},
	"161.3": {
		"title": "High Morale",
		"unlockedBy": { "other": "Morale reaches 20" },
		"text": "<p>The guard tower is crowded on this clear Frosthaven dawn. Every outposter able to make the climb has braved the snow-slick steps and packed each gate house to get a view of the morning’s events.</p><p>”It’s a waste of resources, I kept telling ’em.” Captain Olmstead grumbles as yet more people pack the overlook, causing the floorboards to groan under the excited chatter. You follow his eye toward the courtyard, where a monolith stands concealed by a tarp of stitched hides.</p><p>For weeks a secretive scaffold has occupied the town square as artisans carted stone, steel, and wood behind a curtain under the supervision of a scarfclad Savvas. Now the scaffold has been disassembled, and only the thin sheet blocks the finished monument from view.</p><p>Satha strides to center of the square and addresses the crowds with a bullhorn. “I’m not much for speeches,” the mayor begins. “And I’m not usually one for, uh, sentiment, either. But this place, these people… you make me proud.”</p><p>Finished, the mayor lowers her bullhorn and nods, and the Savvas signals its crew to pull the hide tarp.</p><p>A giant of stone and steel emerges: a human figure stands mid-stride on its way north, its determined gaze unflinching against the wind whipping in from the bay. Like the town of Frosthaven, the statue isn’t the most beautiful thing in the world. It wouldn’t be on display in any garden on the more civilized side of the Copperneck mountains. But it isn’t south of the mountains; it’s here, like Frosthaven, in a place it shouldn’t be able to exist, defying the cruel landscape that would spell death to anything of weaker stock.</p><p>A thundering cheer rises from the gathered outposters, echoing off the mountains and over the choppy waters of the harbor.</p><p>”Still a waste,” Captain Olmstead repeats, but even the surly guard captain can’t suppress a grin amid the victorious roar.</p>",
		"rewards": {
			"text": "<p>Gain 2 prosperity.</p><p>Place “Statue” campaign sticker on the town map at location F.</p>"
		}
	},
	"163.1": {
		"title": "Tome of Elements",
		"unlockedBy": { "section": { "id": "44.4" }},
		"text": "<p>Eddica the Librarian runs her finger down the page of the Tome of the Elements. She half-whispers something arcane, then scoops a fistful of ice out of a bowl, tracing a sigil with the melted water on your foreheads.</p><p>“Brr!” She shivers, rubbing her hands up and down her arms. “You feel that?”</p>",
		"rewards": {
			"text": "<p>During the next scenario, the element [ice] token does not move from the waning column to the inert column at the end of any round.</p><p>Gain “Tome of Elements” [item_216].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"163.3": {
		"title": "Joseph the Lion Returns",
		"unlockedBy": { "event": { "id": "WO-80" }},
		"text": "A couple of days ago, Joseph the Lion finally opened his ice-cream stand. After a modest turn out on opening day the stand was shut soon after. You figure there must be a good reason for such immediate closure and decide to pay Joseph a visit in hopes that the merchant is once again in need of assistance and willing to part with a few coins.",
		"rewards": {
			"scenarios": [{ "id": "126" }]
		}
	},
	"167.2": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>DING. DING. DINGdingDING!</p><p>“Hello? Helloooo?” A thin man bundled up in a trench coat is adamantly ringing the desk bell at the town hall. Glint, the Inox records-keeper, is pretending to nap a few feet away. “I see you there. I need help!”</p><p>Glint shouts without opening his eyes, adjusting his chair to face away from the disruption. “I’m on break! Come back later.”</p><p>The man slaps a gloved palm on the countertop, leaving behind a puddle of water. “I am running out of wat— er, patience! Yes, I am running out of patience!” The man returns to ringing the bell with intensity, covering the countertop with moisture with each thump. Glint begrudgingly gets out of his seat to respond when he spots your group.</p><p>“Right, well, I was just waiting for the best mercenaries in town to show up. And here they are, look at that. Take it up with them. And stop sweating on my counter!” Glint drops back into his chair, done with the whole affair.</p><p>The man sizes you up, looking a bit nervous. “Yes, it’s sweat! I am merely sweating! Because of the warmth. Of this room. It is very warm, correct?” It’s tough to make out the man’s eyes hidden between the assorted scarves wrapped around his face. His boots look new, but much too large for someone of his stature, and the trench coat he’s wearing is nearly soaked through. The man dabs at his face with a wet handkerchief, then pushes aside the scarves to take a long swig from a canteen. You can’t help but notice there’s another three containers hanging empty off his belt.</p><p>He taps the bottom of the canteen to extract the last few drops, then remembers you standing there. “Right… Lurkers, they killed my family, and I need you to… uh, revenge. I would explain more, but it’s very important I leave right now—er, for an appointment! Here’s directions,” he sets a wet wad of paper into your hand. “I’ll explain later! Thank you! Good bye.”</p><p>With that, he waddles out the door and into the street in a panic, tripping several times and leaving a trail of water behind him.</p>",
		"rewards": {
			"scenarios": [{ "id": "078" }]
		}
	},
	"168.2": {
		"title": "Blast the Lurkers",
		"unlockedBy": { "section": { "id": "114.2" }},
		"text": "The Quatryl seems confident, and you trust his evaluation. You give him the go ahead to prepare the device as Sun in Shallows returns to the sea.",
		"rewards": {
			"text": "<p>Place map overlay sticker Z on the map in location Z (F2).</p><p>Do not resolve an outpost event this week.</p>",
			"scenarios": [{ "id": "050" }]
		}
	},
	"169.1": {
		"title": "Trapper Returns",
		"text": "<p>Unlike Frosthaven’s wintery landscape, the hunting lodge has entered a season of abundance, thrumming from an influx of ice fishers and fur traders. Drinks and tall tales are shared, prices for goods haggled over. You almost overlook the familiar, forlorn Vermling sitting by the roaring fire.</p><p>Discomfited in crowds, as usual, the Trapper fidgets with their tailcoat draped in their lap. You approach, surprised at their presence. You didn’t notice their furpiled sled outside.</p><p>“The empty one is mine,” the Trapper admits miserably. They have been residing in the Whitefire Wood, a region usually known for its diverse fauna. Lately, however, the population of small animals like snow foxes has been waning. This is due to a new predator: polar bears.</p><p>“When I decided to track the bears,” the Trapper says, “I discovered a local Vermling colony was overhunting them, pushing them out of their usual habitat in the barrens. I tried speaking to these other Vermlings.” The Trapper removes their bush hat, revealing a lump between their ears, likely from a slingshot. “Diplomatic lot,” they say ruefully.</p><p>The Trapper wants your help relocating the bears away from the tribe. “They need the chance to repopulate in an environment more suited to them.” Eager to escape town for a while, you readily agree. The Trapper provides a map for you, marking the spot where you shall meet.</p>",
		"rewards": {
			"scenarios": [{ "id": "117" }]
		}
	},
	"169.3": {
		"title": "Crain's Recovery",
		"unlockedBy": { "scenario": { "id": "026" }},
		"text": "<p>You have been lucky—luckier than most—to have never spent more than a few nights inside a gaoler’s cage. Of course, there have been times when your temper’s gotten the better of you, when you’ve indulged more than was wise, but you’ve never been forced to spend night after night, month after month sleeping on a stone floor with nothing to look forward to but a glimmer of morning light through iron bars. So you can’t really fathom what it’s like to finally be free from prison or what a person would do when they finally got out, but you doubt they would do this.</p><p>Crain Tallengyr, the Quatryl scholar you rescued from the Unfettered catacombs, has transformed his previously clean, albeit sparse, room into the cluttered, cramped nest of an academic. Somehow between last night and this morning, the Quatryl has gathered several books and a large stack of parchment and he’s arranged everything on the floor around him like a flimsy mosaic. Behind him is a plate of half-eaten eggs and hard biscuits and several empty teacups. The bed looks unused, except the top sheet has been confiscated to sop up a large puddle of ink on the floor. His door is open and when you knock on the frame, his face lifts into a manic smile.</p><p>“My stalwart friends!” He bows without getting up. “Come to check on your rescued ward? What chivalry! And perfect timing, I might add. As you can tell, I’ve managed to get in a full night’s work.”</p><p>Crain pulls out a hefty book with an excited look. You ask if that will help you get to the center of the Unfettered facility, and the Quatryl frowns. “Oh, fine, I suppose we could talk about that first.”</p><p>Crain unfolds a set of building schematics in front of you and shows you two paths from the library that will take you to the core of the facility. One is through the duct system, bypassing the bulk of the Unfettered workers by sneaking above them [scenario_36]. The other is a long, narrow path deep in the facility that Crain says is an unfinished transportation system the Unfettered have abandoned [scenario_37]. Both lead to the central chamber, but there’s no knowing which one will yield the easier path.</p><p>“Now,” Crain says pointedly, pulling out his book again, “If we could get back to this…” The Quatryl clearly wants to move on from his memories of the Unfettered facility, so you take the hint and ask what he’s so excited about.</p>",
		"rewards": {
			"scenarios": [{ "id": "036" }, { "id": "037" }]
		},
		"sectionLinks": "Read [section_190.4] now."
	},
	"171.2": {
		"title": "Random Scenario",
		"text": "You look down at an ancient sheet of stone—hardly the riches and jewels you were expecting. But there on the stone, faded, yet still complete, is a painting: a landscape, as if painted using the tip of a stick or a claw. And despite the crudeness, the details look familiar to you. You could probably find the place this painting depicts if you searched long enough.",
		"rewards": {
			"scenarios": [{ "id": "108" }]
		}
	},
	"176.4": {
		"title": "Funeral for the Winter Fallen",
		"unlockedBy": { "section": { "id": "53.3" }},
		"text": "<p>Ever since the Deathwalker decided to improve the graveyard, they work on it tirelessly, expanding the grounds to make room for each body individually and making headstones to properly commemorate the fallen. The work slowed significantly in the winter as the ground froze solid, and now that the weather is beginning to thaw a bit, there is a lot of time to make up for.</p><p>The Deathwalker organizes a service to inter all of those who fell over the course of the winter, and you decide to attend. You fear that the morose proceedings will just worsen the mood on an otherwise nice and sunny day. But, as the burials commence, the guards begin sharing warming anecdotes about those who passed, and the mood turns almost celebratory.</p><p>“Remember that time Deke tried to light his fire arrow and ended up setting his trousers on fire instead? That boy knew nothing when he got here, but by the time the end came for him, fighting off three Lurkers at once, he had grown into quite the admirable warrior.”</p><p>And then somebody brings out the alcohol, and pretty soon the whole town is singing and crying and laughing together until the sun sets. It is quite the cathartic experience, and when people finally start shuffling home, still telling each other their favorite anecdotes, the Deathwalker still sits among the graves, smiling softly.</p><p>“They’re finally at peace.”</p>",
		"rewards": {
			"text": "Gain 2 morale."
		}
	},
	"177.4": {
		"title": "Care Package from Snowdancer",
		"unlockedBy": { "section": { "id": "107.3" }},
		"text": "<p>As you enter the main gates of Frosthaven, you can’t help but notice the giant pile of food sitting just outside in the snow.</p><p>“A group of Algox brought it by,” a guard explains. “Said they was friends of yours, but Olmstead was suspicious. He said to wait until you got back.”</p><p>You inspect the pile and find a crudely written note from the Snowdancer on a bark parchment.</p><p>“Friends,” the note says. “My tribe had a bountiful harvest this year, praise Geryuu. I remembered how difficult the winters could be in Frosthaven, and so decided to share some of our crop with you. Be well, and stay safe.”</p>",
		"rewards": {
			"text": "Gain 3 morale."
		}
	},
	"178.1": {
		"title": "Mysterious Crate",
		"unlockedBy": { "event": { "id": "SO-41" }},
		"text": "<p>The alarm bell rings in the middle of the night. An attack?</p><p>You rush out of your longhouse and down to the dock, strapping on weapons as you run. There, just past the craftsman’s shop and butting up against the jetty, is an unknown ship with tattered sails. Two dockworkers are wrestling the lines to keep it from being pulled back into the bay.</p><p>A roar erupts from the ship—Ice Wraiths are swelling around the mast. The whole ship pulses with demonic energy.</p><p>And then you spot them: there, on the deck. Crates, sealed with thick black tar.</p>",
		"rewards": {
			"text": "You must play this scenario next.",
			"scenarios": [{ "id": "127" }]
		}
	},
	"179.5": {
		"title": "Metal Shipment",
		"unlockedBy": { "event": { "id": "SO-10" }},
		"text": "<p>A stern knock on your longhouse door reveals a man with skin as thick as leather. He tips his hat, then asks you to sign for a delivery as two men unload his wagon.</p><p>“Told you I’d come back around with those materials you ordered. The pass is brutal, but the gains are sweet.”",
		"rewards": {
			"text": "Gain 2 collective [lumber] and 5 collective [metal]."
		}
	},
	"180.1": {
		"title": "Great Dallum",
		"unlockedBy": { "event": { "id": "SO-03" }},
		"text": "<p>Frosthaven is bubbling over with excitement. The streets are cleared, the feast prepared, and the citizenry has shown up in their best clothes to meet the Great Dallum, the most powerful seer the world has ever known.</p><p>He arrives right on time, stepping through the gate with a small entourage at his side, to cheering, music, and fanfare. The crowd bunches up around him and it’s some time before you can even get a look at anything more than his bald head. People offer numerous gifts: painted hides, fine woods, and, of course, gold. Each is graciously accepted then spirited away by the Great Dallum’s handlers into a wagon for transport.</p><p>When it’s finally your turn he sets a soft hand on your shoulder and looks at you with piercing green eyes. “What’s your name, mercenary?” His booming voice carries and he speaks at a quick clip, as though he’s rushing to get through his duties. Before you have a chance to answer, he asks if there’s a donation you’d like to make for his blessing of sight.</p>",
		"sectionLinks": "If you make a donation to the Great Dallum, read [section_122.4] now. Otherwise, read [section_120.5] now."
	},
	"180.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>Glint, the Inox records-keeper at the town hall, is leaning back in his chair and throwing a rubber ball against the wall. He sees you and rises with all of the speed of a bureaucrat who knows no one else would be willing to take this job in the middle of the frozen north. He flips open a ledger.</p><p>“Name?” He knows your names, he’s just difficult. You comply, which does little more than get a raised eyebrow. “Really? Huh, could’ve sworn you were taller. Unless you’re shrinking.” Glint licks a finger, revealing a golden tooth as he turns the page.</p><p>He shuffles some papers, further wasting your time. After what feels like an unacceptable wait, he passes a bounty across the table. “Three reports of oozes.” You reach to grab the paper, but he holds it down with his thumb, looking you in the eye. “Unreliable. Don’t get your hopes up. The report says it ate a sheep, probably just a lazy farmer who miscounted.” Glint releases the page and goes back to his rubber ball, settling into his chair with a thump.</p><p>As you take the bounty details you steal a glance at the original report—it doesn’t say the ooze ate “a sheep”, it says it ate “a herd of sheep”. This might be more than you bargained for.</p>",
		"rewards": {
			"scenarios": [{ "id": "084" }]
		}
	},
	"181.1": {
		"title": "Tome of Time",
		"unlockedBy": { "event": { "id": "SR-49" }},
		"text": "<p>You walk into the crowded library carrying the book with a metal cover and an embedded hourglass you found in a far-off cave. The eager resident librarian Eddica locks eyes with you, then looks to it, then back to you. She uncontrollably blurts, “EVERYBODY OUT! Magic time!” The patrons look startled and confused.</p><p>Eddica looks surprised at her own outburst and straightens her skirt nervously. She pushes her red-rimmed glasses up her face and starts again, much more calmly: “Ahem. Sorry… what I meant to say is that the library is closing a bit early today as I have some research work to do.” She assists a few final citizens with checking out books and hurries them out the door.</p><p>With the metal-clad book in hand she dives right in: “A time manipulation spell. Ingenious… it hitches you to an earlier point in time, allowing the benefits of the past without being winded!” Sure, whatever that means. “Looks like it has finite power, how would you like me to cast it?”</p>",
		"sectionLinks": "<p>If you ask her to cast all of the spell’s power on a single party member, choose the character and read [section_107.2] now.</p><p>If you ask her to cast it on the entire party, read [section_191.1] now.</p>"
	},
	"183.3": {
		"title": "Visiting Trader",
		"text": "“Ah, my best customers! Heh.” It’s the old traveling merchant and his carriage full of items of suspicious origins. He invites you to poke through his inventory. “Same price as before, but even better value. No one’s going to come looking for these. Heh.” He doesn’t elaborate, and you think better than to press the issue.",
		"rewards": { 
			"text": "Each character may buy one item from the purchasable item supply for its listed price or one material resource for 7 gold." 
		}
	},
	"184.1": {
		"title": "The Third Year",
		"text":  "<p>Whereas this was once a job for some quick gold, something has changed for your party over the last two years. Members have come and gone. Friends have found their dreams and retired from the hard life of a mercenary. Who among you remains? Are you even really the same mercenary group at all?</p><p>Somehow, through all the adventures, the wins, the devastating losses... it feels like there’s still some core that has remained constant. That core camaraderie doesn’t just extend to your party, but flows to all the rag-tag peoples of Frosthaven toughing it out together. Perhaps it’s stubbornness. Perhaps it’s the drive toward what the next page in your story will bring, or the promise of just one more triumph. One thing is certain, though...</p><p>You wouldn’t have it any other way.</p>",
		"rewards": {
			"text": "Gain 3 soldiers",
			"events": {
				"SR": [{ "id": "SR-52" }],
				"WO": [{ "id": "WO-48" }, { "id": "WO-49" }, { "id": "WO-50" }, { "id": "WO-51" }, { "id": "WO-52" }, { "id": "WO-53" }, { "id": "WO-54" }, { "id": "WO-55" }, { "id": "WO-56" }],
				"WR": [{ "id": "WR-31" }]
			}
		}	
	},
	"190.4": {
		"title": "Puzzle Book",
		"unlockedBy": [{ "section": { "id": "128.2" }}, { "section": { "id": "169.3" }}],
		"text": "<p>Crain grins and lifts up a large decaying book, one you recognize from the catacombs. “Of all the texts I had a chance to peruse in those tunnels, this one fascinated me the most, and I understand absolutely none of it.”</p><p>The book doesn’t look like much. It’s bound in thin, tanned leather that’s so worn that the corners have begun to peek through. On the front cover are two words inscribed in faint, black ink. You raise a skeptical eyebrow.</p><p>“Yes! I’m excited as well,” Crain says. “That’s why I spent all night deciding on the best method to begin the translation. The numerical system, that’s what I’ve landed on. It’s quite different from any I’ve studied, but once I untangle it, I should be able to move on to the letters.” He pauses to consider something, then nods enthusiastically, convinced of it. “And how about you, friends? Care to take your luck with the old pen and paper?”</p><p>He riffles through the mosaic of parchment and snaps up a small leaf. On it, is a series of dots and dashes, a code if you were to guess. “It’s their numerals. Or could they be ordinals? No no, definitely numerals. Anyway, how about you give it a shot. A puzzle to fill the time between slaying and whatnot.”</p>",
		"rewards": {
			"text": "Open the puzzle book to the first page."
		}
	},
	"191.1": {
		"title": "Tome of Time",
		"unlockedBy": { "section": { "id": "181.1" }},
		"text": "<p>Eddica requests the party group together in the center of the hardwood floor, away from the shelves, “just in case.” She does a dry-run of the casting making heavy reference to the page, then looks up to you. “Here goes! Temporialius wrinklae!”</p><p>She’s visibly excited and you can’t help but feel that the flourish in her hand movements isn’t strictly necessary. After a moment of stillness a haze wraps around the party—the sensation is almost as though you exist both now and a few seconds ago. She smiles and grabs a pen: “Tell me everything, how does it feel?”</p>",
		"rewards": {
			"text": "<p>In the next scenario, each character returns any number of ability cards in their discard pile to their hand at the end of the first round.</p><p>Gain “Tome of Time” [item_217].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"192.1": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>“Alright, yes, I understand!” Satha, the mayor of Frosthaven, is surrounded by a group of a dozen people clamoring for her attention outside her cabin. Most unusually, they’re still dressed in their nightclothes, oblivious to the weather. Satha catches your eye and waves you over. With an exasperated sigh, she asks the crowd to fill you in.</p><p>A young woman in a nightgown with bloodshot eyes speaks up. “We had a dream. A bad one, all together. Cogs, spinning… the fog of darkness mixed with the pull of fear. It’s all jumbled up, but the machine is calling. It needs someone to go there, out on the ice. To free the Relic.</p><p>To carve away the cold and pull it from its bed. Retrieve the Relic.”</p><p>The others speak in eerie unison: “Free the Relic. Retrieve the Relic.” Satha narrows her gaze in uncharacteristic concern.</p><p>Another townsperson speaks up, a nervousness about him. “It said… it said it wouldn’t let us sleep until we freed it. You have to help us. You’ll help us, won’t you?”</p>",
		"rewards": {
			"scenarios": [{ "id": "079" }]
		}
	},
	"194.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>The Crater is a burned-out pit where the old tavern used to stand. The building and its proprietor met their ends in the attack that happened when your band of mercenaries first arrived in Frosthaven, and despite the resources now being available to rebuild, no one seems to be in much of a hurry. A few tarps have been strung up between the remaining studs of the building and the environment has shifted from an actual business into a gathering spot for the populace. Extra furniture, mis-matched glassware, and an expectation you bring enough drink to share has made it into a friendly place to unwind, for as long as you can stand the wind and cold.</p><p>Tonight’s visit has a few people swapping stories around a metal drum full of coal, a Quatryl unhitching barrels of thick brown liquid off a donkey, and an old man wrapped tightly in a dirty cloak scribbling furiously in a journal. As you walk by, he flips it quickly shut.</p><p>“Trade a drink for a legend?” He taps two withered fingers on the table, encouraging you to join him. Intriguing enough. You pass your canteen over to him and he takes a long pull.</p><p>“The name’s Mulbrynn, but the story is about a group of explorers not unlike yourselves. Found an idol stronger than they were, something dark and powerful.” A wind whips through The Crater, and he pulls his cloak up to protect his neck. “Started talking to them, telling them to go up to the Imperial Mountains, that it would grant them their dreams and then some. Never made it, as best as I can tell.”</p><p>He pauses, getting a far-off look in his eye. “But I miss them. Maybe it’s the drink, or maybe it’s the cold, but it’s about time someone finished what they started.” He tears a page out of his journal and pushes it across the table, dropping your canteen on top of it as a paperweight. “That’s a map. Follow it or not, but I’m done mourning.”</p>",
		"rewards": {
			"scenarios": [{ "id": "132" }]
		}
	}
}