{
	"21.4": {
		"title": "Winter Arrives",
		"text": "<p>It’s been a summer of adversity, but your decision is made: this outpost at the corner of civilization won’t make it through another winter without your assistance. Of course, it’s possible they won’t make it with you, either—but at least you’ll find out together.</p><p>The Quatryl mail carrier cinches her bag and plods through the main gate. In her satchel is your final reconnaissance report to the guild at White Oak, detailing the condition of the town, the support it will need to continue, and your decision to stay.</p><p>With a sober final thump, the gates of Frosthaven seal shut. The populace barely acknowledge it, but for you it means you’ve linked your fate with that of this town.</p>",
		"rewards": { 
			"text": "Gain 1 prosperity." 
		}
	},
	"32.3": {
		"title": "Visiting Trader",
		"text": "<p>A carriage piled high with blankets and carpets is tucked between a snowbank and a building near the edge of town. Its old owner sees you wandering by and looks both ways before beckoning you over.</p><p>“Nice place, nice place this Frosthaven. Cold though, eh? Heh. Maybe you’re the sort of people who would like some hot items.” He chuckles a bit to himself as he pins back a blanket on his carriage, revealing assorted items in like-new condition.</p><p>“I just need a few motivated buyers. Shouldn’t be trouble up here, no... but I wouldn’t wear these out in, let’s say, uh, Gloomhaven for a while. Heh.”</p><p>You’re not planning on heading south to that decrepit city any time soon. Might as well pick up a few items at a steal of a price.</p>",
		"rewards": { 
			"text": "Each character may buy one item from the purchasable item supply for its listed price or one material resource for 7 gold." 
		}
	},
	"44.4": {
		"title": "Tome of Elements",
		"unlockedBy": { "event": { "id": "SR-48" }},
		"text": "<p>“I really enjoyed the, uh, the ending, Miss Eddica. A great twist!” A fresh-faced soldier is finishing up a conversation with the Valrath librarian as you enter. Eddica gives a smile from behind her desk as she checks in the book. Two more dockworkers wait in line for recommendations on additional literature from the young librarian—they’re nearly tripping over themselves for a chance to talk to her. She spots you and politely shoos them out the door, finally settling to a seat on the edge of her desk.</p><p>“I expected running a library to be more like Master Scrim’s… he had so much more uninterrupted time than I seem to have. In any case... do you have what I hope you have?” She purses her lips in anticipation, and when you pull the citrine-studded hide tome you found from your satchel she rushes over to snatch it from your hands, looking over it with wide eyes. “The Tome of the Elements! It’s true!”</p><p>She pushes up her red-rimmed glasses and collects herself. “Now, this is supposed to be the most volatile of the tomes. Let’s see if I can deactivate it...” She traces a sigil in arcane white light on the cover before bracing herself and gingerly cracking it open. No sparks, no explosions.</p><p>“There we go!” The pages splay out and Eddica hums a happy tune as she looks through the tome, punctuated with little “a-ha”s and lots of nodding. After a moment she sets the book down, looking up at you with a wide smile. “They’re actually in here! And I have heard very few accounts of these spells being painful.” She lays out the materials on the desk beside her.</p><p>“So, which will it be?”</p>",
		"sectionLinks": "<p>If you offer to test the fire spell, read [section_104.3] now.</p><p>If you offer to test the cold spell, read [section_163.1] now.</p>"
	},
	"62.2": {
		"title": "Bathysphere Plans",
		"unlockedBy": { "scenario": { "id": "022" }},
		"text": "<p>A high, nasal voice reaches you at the back of The Crater, Frosthaven’s recently rebuilt canteen.</p><p>“I have it, ach, I have it!” This is Pinter Droman, the outpost’s best and only tinkerer, and he’s pushing his way through the smoky gloom to find your group at your usual table. When he arrives, you see that Pinter’s eyes are raw and his skin has a waxy shine, which means he hasn’t been sleeping again.</p><p>“The seawater, I have a way around it! Or, rather…” Pinter unrolls a scroll of parchment on your table, pushing aside your drink. The parchment shows a diagram of some sort of armored ball. “Through it! In a bathysphere!”</p><p>The tinkerer goes on to explain that with this “bathysphere” you could safely descend deep into the Biting Sea for short periods of time. But that only solves the problem of the pressure; you still need to avoid freezing. “I have a plan for that too!” Pinter exclaims, his bleary eye twitching. “All I need is a very, very powerful heat source.” As luck would have it, Pinter believes you might be able to find such a thing somewhere in the middle of the Radiant Forest.</p><p>“The whole forest is unfrozen, even in the winter, so something must be heating it!” Pinter says. “I can’t be certain what it will look like, but I’m certain it’s there, yes. Ah, and with your particular skills, finding it should be no problem.”",
		"rewards": { 
			"scenarios": [{ "id": "033" }]
		}
	},
	"66.2": {
		"title": "The Pass is Ready",
		"unlockedBy": { "scenario": { "id": "115" }},
		"text": "<p>“It’s ready!” Pinter Droman shouts as he bursts into Satha’s cabin, interrupting your meeting on the latest building projects. The excitable tinkerer opens his mouth as if to continue speaking, but only gasps for breath.</p><p>Satha leans back in her chair and winks at you. “What’s wrong, Pinter, did you run all the way here from the Frozen Pass?” she asks with a smirk.</p><p>“No,” Pinter wheezes, “I had to stop a couple times. But it’s ready! The shortcut through the Frozen Pass is complete! I call it... Droman’s Path!”</p><p>You helped Droman with this project on a couple of occasions, but you hadn’t expected it to be done so soon. Thanks to a lucky landslide, Pinter’s ingenuity, and weeks of backbreaking work, this shortcut could shave days off the dangerous trek through the Frozen Pass. Satha explained why this was so important: A shorter trip means more traveling merchants coming to Frosthaven, which in turn means more life-saving supplies for the beleaguered outpost.</p><p>Satha laughs in delight, clapping the breathless Quatryl on the back. “Great work, Droman! We’ll send for some of the braver merchants to give this a test run as soon as we’re able.” She turns to you with a smile. “You helped build this path as much as anyone; you should be there to celebrate when the first caravan rolls through!”</p><p>The mayor’s grin doesn’t falter, but you’re pretty certain you detect an edge in her voice, and you understand the unspoken end to her sentence: “—in case anything goes wrong.”</p>",
		"rewards": {
			"scenarios": [{ "id": "116" }]
		}
	},
	"68.1": {
		"unlockedBy": { "event": { "id": "WO-10" }}
	},
	"86.1": {
		"title": "Protect the Pass",
		"unlockedBy": { "scenario": { "id": "114" }},
		"text": "<p>The Crater is as lively as you’ve seen it all season. You signal for a drink as you push through the customers and make your way to a table at the back, where the Quatryl tinkerer Pinter Droman fiddles with a small spherical gadget, deep in thought. You sit down, interrupting his trance.</p><p>“OH! Hello again, thank you for coming! VERY exciting news to share!” The boisterous Quatryl tears his focus from the trinket. “We are on the next phase of our little shortcut through the mountains. A big portion of the path needs to pass under a dangerous overhanging cliff. The work crew is already installing pylons to support the cliff and hold back the rock wall, but...” he hesitates. “It seems our path inadvertently cuts too close to Algox territory, and they’re not taking kindly to our construction project.”</p><p>He raises his hand, cutting off the expected suggestion. “Diplomacy isn’t an option, I’m afraid,” the tinkerer sighs, “The Algox who are attacking belong to a group of bandits—the Horns of Ruin, they call themselves—and they are exclusively interested in destroying and looting our hard work.”</p><p>“There’s a big attack coming, and the project is in a very vulnerable state. I need you to go protect the pylons we’ve installed. If you can stop them, it might buy us enough time to get the whole structure pieced together. Once that happens, it will be nearly impossible to destroy!</p>",
		"rewards": {
			"scenarios": [{ "id": "115" }]
		}
	},
	"91.4": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>A knock at your longhouse reveals a guard you recognize from the battlements, hat in hand. You invite him in to get out of the cold night air.</p><p>“I’m not sure where else to turn. My wife is expecting. But the baby hasn’t arrived yet, and… and I think I know why.” The guard looks fragile without his armor. With a hitch in his voice he mumbles, “Do you believe in being cursed?”</p><p>A sigh heaves through his chest. “I was at my post in the guard tower last month and I looked out into the forest. There was a woman out there... I could barely make her out against the snow. Transparent, dressed all in white, looked almost like a ghostly Aesther, if you’d believe that.” He grips his hat tightly, refusing to look at you.</p><p>“She didn’t have a face, just pits where her eyes could’ve been, and this trickle of blood ran out of them.” He shudders. “She floated right up, tapped my forehead, and was gone.”</p><p>“I told the other guards, but they didn’t believe me. But I can feel it. She cursed me. And my wife and my child are going to pay the price.” He pulls out a satchel of gold coins. “I don’t have much, but I’ll give you all I have to lift this curse and save my family before it’s too late.”</p>",
		"rewards": {
			"scenarios": [{ "id": "086" }]
		}
	},
	"94.4": {
		"title": "Sneak Past the Lurkers",
		"unlockedBy": { "section": { "id": "114.2" }},
		"text": "No matter how dangerous this army, you share Sun in Shallows’ feelings of despair at this outcome. You tell Droman to hold off. Maybe you can find another way through the army.",
		"rewards": {
			"text": "<p>Place map overlay sticker Z on the map in location Z (F2).</p><p>Do not resolve an outpost event this week.</p>",
			"scenarios": [{ "id": "049" }]
		}
	},
	"104.3": {
		"title": "Tome of Elements",
		"unlockedBy": { "section": { "id": "44.4" }},
		"text": "<p>Eddica runs her finger down the page of the Tome of the Elements. She utters something under her breath, dips her finger at the melted base of a wax candle, and traces something on your foreheads.</p><p>“That should do it—ouch!” She quickly sucks her fingertip into her mouth. She looks back at you with a shrug. “Got hot.”</p>",
		"rewards": {
			"text": "<p>During the next scenario, the element [fire] token does not move from the waning column to the inert column at the end of any round.</p><p>Gain “Tome of Elements” [item_216].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"114.2": {
		"title": "Attacking the Lurkers",
		"unlockedBy": { "scenario": { "id": "042" }},
		"text": "<p>You sit at your regular table in The Crater, trying to enjoy your mugs of ale as the inexhaustible tinkerer Pinter Droman chatters ceaselessly. He has been at your side constantly since the bathysphere mission, peppering you with questions… which is exactly why you decided you needed a drink.</p><p>“Now, on a scale of one to ten, how many fires occurred onboard during your dive? I theorized only a small probability that the air tanks would explode, and—”</p><p>Pinter’s questions are cut short as an Orchid guard runs breathlessly up to your table. “You have a, uh… a visitor... at the dock gate…” she pants. “It’s a… Lurker. And it, uh, wants to see you, I think?”</p><p>You put your drinks down and head toward the docks, where you see a lone Lurker sitting patiently. You recognize Sun in Shallows, the Lurker who first told you about the shards and the fate of its people. Archers line the walls, plucking nervously at their bowstrings as you wave for the gate to open and go out to meet your caller.</p><p>It’s clear that Sun in Shallows has seen combat since you last met; new cracks run like spiderwebs over her shell and the Lurker leans to one side as she sits, favoring a few injured legs. The giant crustacean perks up as you approach, her psychic singsong greeting echoing in your minds. You wonder what could compel this creature to risk the wrath of the Frosthaven guards, but you realize you already know—the shards. They, and the crown they form, compel Sun in Shallows and her awakened brethren as much as they compel you.</p><p>Your suspicions are confirmed as Sun in Shallows delivers her message, a stream of images and emotions running like a tapestry through your minds:</p><p>Huge coral structures reach upward like claws from the edges of a crater in the ocean floor, creating the impression of an enormous flower in mid-bloom. You feel the presence of a shard there, but the vision is obscured by an inky swirl of fear and darkness. The swirl expands as you watch, an unnatural aura attaching to the shard, guarding it, and drawing the Lurkers in the area under its influence, turning their already clouded minds to its purpose. They swarm around the shard hundreds strong: a horde, gathering to protect and spread the ever-growing corruption.</p><p>You see Sun in Shallows leading a group of Lurkers on an ill-fated attack to unseat the source of the corruption and retake the shard. From the intense sorrow accompanying the vision, you don’t need to see the fight to know that Sun in Shallows was the only one to escape alive.</p><p>The Lurker’s vision fades from your mind, but you see the stakes quite clearly: the crown can never be reunited until you get that shard, but more than that, this source of evil is gathering more beneath the waves, and it will continue to attack you—to attack Frosthaven—to corrupt as many shards as it can. But what can you do against such might?</p><p>“A psychic blast.” A voice from behind startles you. You hadn’t realized Pinter Droman had followed you from The Crater, much less that he’d been privy to the Lurker’s bleak vision. The tinkerer continues, almost to himself. “Too many to fight, even with a hundred bathyspheres. Yes, yes, but with their psychic attunement... it’s possible we could take advantage of that...stun them, perhaps…” He starts pacing, speaking more and more quickly as he gets excited about his idea. “I’d need to study this Lurker, of course; run some tests. Maybe even get a better look at one of those shards and find a way to harness its psychic energy... It’ll take some time, but I’m sure I could come up with a device to do the trick!”</p><p>Your response is cut short by a wave of sorrow washing over you. You don’t think Sun in Shallows can understand the words, but the Lurker can clearly sense the tinkerer’s intent, and her distress is palpable. The prospect of using the coral shards—her symbols of hope—to do harm to her confused brethren fills her with despair. The intensity fades quickly, though, as you feel Sun in Shallows accept that this may be the only way to reunite the crown and save her people from whatever foul thing is taking them. You feel a release, a resignation, and now a vision of the crown floats in front of you, coming to rest in your hands. Sun in Shallows leaves the decision to you.</p><p>“Just to be clear,” Pinter warns, “we’ll detonate this device right on top of where the shard is located. If I do my job right, it should knock out all the Lurkers in the area, but I can’t guarantee there won’t be some collateral damage at the epicenter.” You nod in understanding.</p>",
		"sectionLinks": "If you give Droman the order to prepare a psychic bomb, read [section_168.2] now. Otherwise, read [section_94.4] now."
	},
	"115.1": {
		"unlockedBy": { "event": { "id": "WO-17" }}
	},
	"118.3": {
		"unlockedBy": { "section": { "id": "193.1" }}
	},
	"119.3": {
		"title": "Random Scenario",
		"text": "<p>You hold the curiously fragile bit of machinery in your hand, and it suddenly comes to life, projecting some sort of illusory, three-dimensional map in the empty space above it. You try to touch this projection with your other hand, but it just passes right through the light, blanking out anything above it. Very strange indeed.</p><p>The map itself appears to be of some sort of ancient building that constructs machines, you wonder whether it is still operational and whether it may be beneficial to visit. After a considerable amount of tinkering, you discover a way to make the map zoom out, and there it is: a blinking dot on a very recognizable landscape. Shouldn’t be too hard to find.</p>",
		"rewards": { 
			"scenarios": [{ "id": "109" }]
		}
	},
	"120.5": {
		"title": "Great Dallum",
		"unlockedBy": { "section": { "id": "180.1" }},
		"text": "Something is off here. This description of the Great Dallum, even accounting for mistaken observations, isn’t even close. This is an impostor! You raise the alarm and soon others in the crowd take notice. The impostor’s handlers start exchanging nervous glances, and it doesn’t take long before the crowd turns into a mob, grabbing back the offerings and driving the charlatans out of town.",
		"rewards": { 
			"text": "<p>Gain 2 morale.</p><p>Do not resolve an outpost event this week.</p>" 
		}
	},
	"122.4": {
		"title": "Great Dallum",
		"unlockedBy": { "section": { "id": "180.1" }},
		"text": "The Great Dallum accepts your generous gift, whispering words of kindness into your ear. It’s not perfectly applicable, but as a metaphor there really is something to what he says. Yes, you get it now... this has some very practical applications, really. This changes everything.",
		"rewards": { 
			"text": "<p>Lose any 3 collective resources.<br/>Gain 2 inspiration.</p><p>Do not resolve an outpost event this week.</p>" 
		}
	},
	"129.3": {
		"title": "The Second Year",
		"text": "<p>While life on the tundra is anything but easy, your time in Frosthaven has earned you a pedigree few could ever touch. You’ve survived in the place where life is so hostile to your existence that some battered wooden walls are all that stand between you and an icy death. But today, with the sun cresting over the mountains and the promise of summer stretching before you, you can’t help but feel hopeful.</p><p>You’ve tested your strength against countless enemies, but you’ve made some friends in this pocket of life, too. While you don’t know what the next year holds, you know this place has earned its name: “home.”</p>",
		"rewards": {
			"text": "Gain 2 soldiers.",
			"events": {
				"SO": [{ "id": "SO-21" }, { "id": "SO-22" }, { "id": "SO-23" }, { "id": "SO-24" }, { "id": "SO-25" }, { "id": "SO-26" }, { "id": "SO-27" }, { "id": "SO-28" }, { "id": "SO-29" }, { "id": "SO-30" }, { "id": "SO-31" }, { "id": "SO-32" }, { "id": "SO-33" }, { "id": "SO-34" }, { "id": "SO-35" }],
				"SR": [{ "id": "SR-21" }, { "id": "SR-22" }, { "id": "SR-23" }, { "id": "SR-24" }, { "id": "SR-25" }, { "id": "SR-26" }, { "id": "SR-27" }, { "id": "SR-28" }, { "id": "SR-29" }, { "id": "SR-30" }, { "id": "SR-31" }, { "id": "SR-32" }],
				"WO": [{ "id": "WO-21" }, { "id": "WO-22" }, { "id": "WO-23" }, { "id": "WO-24" }, { "id": "WO-25" }, { "id": "WO-26" }, { "id": "WO-27" }, { "id": "WO-28" }, { "id": "WO-29" }, { "id": "WO-30" }, { "id": "WO-31" }, { "id": "WO-32" }, { "id": "WO-33" }, { "id": "WO-34" }, { "id": "WO-35" }, { "id": "WO-36" }, { "id": "WO-37" }, { "id": "WO-38" }, { "id": "WO-39" }, { "id": "WO-40" }, { "id": "WO-41" }, { "id": "WO-42" }, { "id": "WO-43" }, { "id": "WO-44" }, { "id": "WO-45" }, { "id": "WO-46" }, { "id": "WO-47" }],
				"WR": [{ "id": "WR-21" }, { "id": "WR-22" }, { "id": "WR-23" }, { "id": "WR-24" }, { "id": "WR-25" }, { "id": "WR-26" }, { "id": "WR-27" }, { "id": "WR-28" }, { "id": "WR-29" }, { "id": "WR-30" }]
			}
		}
	},
	"130.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>On the docks, you notice a Vermling peering down into the water. In one hand she carries a travel bag; she probably came to Frosthaven on the Lucky Lady, the ship that just docked. She introduces herself as Rattusca, and gestures down at the water, where a corpse is tangled in a line that hangs down from the ship’s bowsprit. The body looks like it’s been dead for some time; its clothing and armor are rotted through. The only thing intact are the wide gold bracelets around its bony wrists.</p><p>“Help me haul the body out of the water,” she tells you, “and if you’re interested in getting more of those wristbands, I can tell you where to find some, so long as you cut me in on the profits.”</p><p>You haul out the body of an Algox. It looks mummified, and has several chunks torn out of it, as if some hungry creature tried to feed on its leathery flesh.</p><p>Rattusca slips the wristbands off the corpse. “Just before we reached port, the ship struck an iceberg,” she tells you. “Fortunately it was a small one, and it broke apart. That’s where the body came from. I saw several more dark shapes inside the ice that may have been more bodies.”</p>",
		"rewards": {
			"scenarios": [{ "id": "090" }]
		}
	},
	"131.3": {
		"unlockedBy": { "event": { "id": "WO-10" }}
	},
	"135.1": {
		"title": "Bathysphere Ready",
		"unlockedBy": { "scenario": { "id": "033" }},
		"text": "<p>Pinter Droman, the premiere tinkerer of Frosthaven, leads you to the large storehouse situated just behind his workshop. He collects himself for a moment, then throws open the doors with a flourish, announcing: “A bathysphere, my friends!”</p><p>What you see looks like a tiny, spherical prison. A glass-and-metal orb lies on a pallet in front of you, equipped with two crude propellers and a pair of clockwork arms. Inside it sit a number of rubber suits with glass fishbowl helmets. These suits are connected to the complicated machinery of the orb through tubes in their head and are meant to be deployed from the main bathysphere, “when more maneuverability is required,” Droman explains.</p><p>You’re not sure what to make of it all, but Pinter’s enthusiasm more than makes up for your reaction. He runs you through the machine’s functions, explaining how to adjust the internal environment, how to draw in air through a small outboard port and store it inside. All in all, it looks sturdy, but that does little to calm your nerves.</p><p>You pay the Tinkerer the rest of his fee, and shortly after, the bathysphere is mounted onto the ship. It’s time to set sail once again.</p>",
		"rewards": { 
			"scenarios": [{ "id": "042" }]
		}
	},
	"146.4": {
		"title": "Random Scenario",
		"text": "As you look down, you hear a tiny squeak. Well, isn’t this wolf cub just a little treasure? Its tail thumps happily as you reach down to pick it up, and it lunges to lick your face. The tiny, adorable pup is too young to survive on its own, and you decide to take it back to Frosthaven with you.",
		"rewards": { 
			"scenarios": [{ "id": "112" }]
		}
	},
	"151.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>You’re polishing off a round of ale before bed when the door opens with a light creak. With near-imperceptible slowness enters the oldest orchid you’ve ever seen; were it not for the lumbering walk you’d take her too-large crystals to be a fallen chandelier, not a sentient being.</p><p>By the time she’s made her way over to your table your party is in the midst of exchanging goodnight wishes. She settles into an open chair with a rattling thump.</p><p>“My, what fortuitous provenance! Just the merry band I was hoping to see.” She speaks slowly and deliberately, a light hint of an accent you can’t place dotting her speech. “I’ve been told you are the choice for matters outside the typical. And my, this matter is far from typical.”</p><p>She pauses for dramatic effect, but her timetable is skewed much too far. By the time she resumes speaking your party is exchanging concerned glances: did she die at the table?</p><p>“The matter, of course, touches the very core of a group like you.” The ponderous crystals obscuring her mouth twist and rattle against each other. Is she… smiling?</p><p>“But we will get to that, I understand the protocol. I may be old, but I imagine my gold is still good?” She shifts and her slow hand drops a sack of gold on the table. It’s clear these are not typical coinage: despite their excellent condition they’re of an antiquated design. Gold is gold, though.</p><p>She takes the look on your faces as sufficient. “Wonderful! I look forward to our adventure!”</p>",
		"rewards": {
			"scenarios": [{ "id": "099" }]
		}
	},
	"152.3": {
		"title": "Library Lesson",
		"unlockedBy": { "section": { "id": "143.2" }},
		"text": "<p>Eddica, the resident librarian, wraps up the last of her weekly lessons. “And that’s why a week is just ten days long.” She checks off the final item on a long checklist, then sets her red-rimmed glasses down on the table beside her. “Well, that settles my end of the bargain. If there’s more to learn in this world, it certainly won’t be from me.”</p><p>She stands from behind her desk, straightening her skirt. “So that leaves your part. It’s time you find those books of power—” she stops herself, wagging a finger, “—no, those tomes of power, and help me get on with my research.”</p>",
		"rewards": {
			"events": {
				"SO": [{ "id": "SO-58" }]
			}
		}
	},
	"155.2": {
		"unlockedBy": { "event": { "id": "WO-10" }}
	},
	"156.1": {
		"title": "Opening the Pass",
		"unlockedBy": { "scenario": { "id": "004" }},
		"text": "<p>“Fascinating, yes... a fascinating challenge... Oh, and an opportunity for the outpost, of course!”</p><p>A Quatryl wrapped in a thick green cloak paces the floor of Satha’s cabin, lost in thought as the mayor looks on from her seat by a map-strewn table.</p><p>Satha raises a hand in greeting as you open the door, and the Quatryl whirls toward you, startled. “OH! Yes, perfect, perfect, you must be the ones Satha mentioned. Pinter Droman, tinkerer extraordinaire, at your service.” He bows with a flourish.</p><p>Satha clears her throat, cutting Pinter’s introduction short. “A recent landslide changed the landscape of the Frozen Pass,” the mayor explains, “Between the rocks that fell out of the way and the valleys they filled up, we think we can create a shortcut through the Coppernecks that could save days for supply teams and merchants coming across the mountains.”</p><p>You recall your own recent journey over the pass, and agree you’d have appreciated a shortcut.</p><p>“That’s the spirit!” Satha continues, “A shortcut means more merchants bringing goods, and more goods means more outposters survive the winter. Pinter here is in charge of the engineering.”</p><p>“Yes!” Pinter jumps back in, unable to contain his excitement. “The place we’re looking to build,” he points to a map on the table, “is a landslide area that’s almost clear of rocks. I’ve created explosive devices to help remove the rest, but the fauna of the area are quite aggressive, and I can’t get a team close enough to plant the charges.”</p><p>“That’s where you come in,” Satha explains. “I told Pinter you’re the only ones I trust to get those bombs where they need to be and handle yourself against the local animals. We’ll have the charges packed and ready to go at dawn.”</p><p>You nod and turn to go prepare your own supplies, but Pinter interjects. “And not to worry, the charges are completely safe!” he says, unprompted. “I’ve learned so much since my, er, unfortunate incident in Gloomhaven.” Somehow his assurance does not increase your confidence.</p>",
		"rewards": { 
			"scenarios": [{ "id": "114" }]
		}

	},
	"158.3": {
		"title": "Xain's Gambit",
		"unlockedBy": { "event": { "id": "WO-10" }},
		"text": "<p>Sure enough, Lurkers show extreme interest in polar bear meat. The proposition spreads by word of claw and Xain finds you on the street to deliver your gains, minus his fee.</p><p>“What did I tell you? Lurkers can’t get enough of that fatty polar bear steak!” A realization crosses the Orchid’s face. “I wonder if I can get the Algox interested in bottled seawater somehow...”</p>",
		"rewards": {
			"text": "Gain 30 collective gold."
		}
	},
	"161.3": {
		"title": "High Morale",
		"unlockedBy": { "other": "Morale reaches 20" },
		"text": "<p>The guard tower is crowded on this clear Frosthaven dawn. Every outposter able to make the climb has braved the snow-slick steps and packed each gate house to get a view of the morning’s events.</p><p>”It’s a waste of resources, I kept telling ’em.” Captain Olmstead grumbles as yet more people pack the overlook, causing the floorboards to groan under the excited chatter. You follow his eye toward the courtyard, where a monolith stands concealed by a tarp of stitched hides.</p><p>For weeks a secretive scaffold has occupied the town square as artisans carted stone, steel, and wood behind a curtain under the supervision of a scarfclad Savvas. Now the scaffold has been disassembled, and only the thin sheet blocks the finished monument from view.</p><p>Satha strides to center of the square and addresses the crowds with a bullhorn. “I’m not much for speeches,” the mayor begins. “And I’m not usually one for, uh, sentiment, either. But this place, these people... you make me proud.”</p><p>Finished, the mayor lowers her bullhorn and nods, and the Savvas signals its crew to pull the hide tarp.</p><p>A giant of stone and steel emerges: a human figure stands mid-stride on its way north, its determined gaze unflinching against the wind whipping in from the bay. Like the town of Frosthaven, the statue isn’t the most beautiful thing in the world. It wouldn’t be on display in any garden on the more civilized side of the Copperneck mountains. But it isn’t south of the mountains; it’s here, like Frosthaven, in a place it shouldn’t be able to exist, defying the cruel landscape that would spell death to anything of weaker stock.</p><p>A thundering cheer rises from the gathered outposters, echoing off the mountains and over the choppy waters of the harbor.</p><p>”Still a waste,” Captain Olmstead repeats, but even the surly guard captain can’t suppress a grin amid the victorious roar.</p>",
		"rewards": {
			"text": "<p>Gain 2 prosperity.</p><p>Place “Statue” campaign sticker on the town map at location F.</p>"
		}
	},
	"163.1": {
		"title": "Tome of Elements",
		"unlockedBy": { "section": { "id": "44.4" }},
		"text": "<p>Eddica the Librarian runs her finger down the page of the Tome of the Elements. She half-whispers something arcane, then scoops a fistful of ice out of a bowl, tracing a sigil with the melted water on your foreheads.</p><p>“Brr!” She shivers, rubbing her hands up and down her arms. “You feel that?”</p>",
		"rewards": {
			"text": "<p>During the next scenario, the element [ice] token does not move from the waning column to the inert column at the end of any round.</p><p>Gain “Tome of Elements” [item_216].</p><p>Do not resolve an outpost event this week.</p>"
		}
	},
	"168.2": {
		"title": "Blast the Lurkers",
		"unlockedBy": { "section": { "id": "114.2" }},
		"text": "The Quatryl seems confident, and you trust his evaluation. You give him the go ahead to prepare the device as Sun in Shallows returns to the sea.",
		"rewards": {
			"text": "<p>Place map overlay sticker Z on the map in location Z (F2).</p><p>Do not resolve an outpost event this week.</p>",
			"scenarios": [{ "id": "050" }]
		}
	},
	"169.3": {
		"title": "Crain's Recovery",
		"unlockedBy": { "scenario": { "id": "026" }},
		"text": "<p>You have been lucky—luckier than most—to have never spent more than a few nights inside a gaoler’s cage. Of course, there have been times when your temper’s gotten the better of you, when you’ve indulged more than was wise, but you’ve never been forced to spend night after night, month after month sleeping on a stone floor with nothing to look forward to but a glimmer of morning light through iron bars. So you can’t really fathom what it’s like to finally be free from prison or what a person would do when they finally got out, but you doubt they would do this.</p><p>Crain Tallengyr, the Quatryl scholar you rescued from the Unfettered catacombs, has transformed his previously clean, albeit sparse, room into the cluttered, cramped nest of an academic. Somehow between last night and this morning, the Quatryl has gathered several books and a large stack of parchment and he’s arranged everything on the floor around him like a flimsy mosaic. Behind him is a plate of half-eaten eggs and hard biscuits and several empty teacups. The bed looks unused, except the top sheet has been confiscated to sop up a large puddle of ink on the floor. His door is open and when you knock on the frame, his face lifts into a manic smile.</p><p>“My stalwart friends!” He bows without getting up. “Come to check on your rescued ward? What chivalry! And perfect timing, I might add. As you can tell, I’ve managed to get in a full night’s work.”</p><p>Crain pulls out a hefty book with an excited look. You ask if that will help you get to the center of the Unfettered facility, and the Quatryl frowns. “Oh, fine, I suppose we could talk about that first.”</p><p>Crain unfolds a set of building schematics in front of you and shows you two paths from the library that will take you to the core of the facility. One is through the duct system, bypassing the bulk of the Unfettered workers by sneaking above them [scenario_36]. The other is a long, narrow path deep in the facility that Crain says is an unfinished transportation system the Unfettered have abandoned [scenario_37]. Both lead to the central chamber, but there’s no knowing which one will yield the easier path.</p><p>“Now,” Crain says pointedly, pulling out his book again, “If we could get back to this...” The Quatryl clearly wants to move on from his memories of the Unfettered facility, so you take the hint and ask what he’s so excited about.</p>",
		"rewards": {
			"scenarios": [{ "id": "036" }, { "id": "037" }]
		},
		"sectionLinks": "Read [section_190.4] now."
	},
	"176.4": {
		"title": "Funeral for the Winter Fallen",
		"unlockedBy": { "section": { "id": "53.3" }},
		"text": "<p>Ever since the Deathwalker decided to improve the graveyard, they work on it tirelessly, expanding the grounds to make room for each body individually and making headstones to properly commemorate the fallen. The work slowed significantly in the winter as the ground froze solid, and now that the weather is beginning to thaw a bit, there is a lot of time to make up for.</p><p>The Deathwalker organizes a service to inter all of those who fell over the course of the winter, and you decide to attend. You fear that the morose proceedings will just worsen the mood on an otherwise nice and sunny day. But, as the burials commence, the guards begin sharing warming anecdotes about those who passed, and the mood turns almost celebratory.</p><p>“Remember that time Deke tried to light his fire arrow and ended up setting his trousers on fire instead? That boy knew nothing when he got here, but by the time the end came for him, fighting off three Lurkers at once, he had grown into quite the admirable warrior.”</p><p>And then somebody brings out the alcohol, and pretty soon the whole town is singing and crying and laughing together until the sun sets. It is quite the cathartic experience, and when people finally start shuffling home, still telling each other their favorite anecdotes, the Deathwalker still sits among the graves, smiling softly.</p><p>“They’re finally at peace.”</p>",
		"rewards": {
			"text": "Gain 2 morale."
		}
	},
	"180.1": {
		"title": "Great Dallum",
		"unlockedBy": { "event": { "id": "SO-03" }},
		"text": "<p>Frosthaven is bubbling over with excitement. The streets are cleared, the feast prepared, and the citizenry has shown up in their best clothes to meet the Great Dallum, the most powerful seer the world has ever known.</p><p>He arrives right on time, stepping through the gate with a small entourage at his side, to cheering, music, and fanfare. The crowd bunches up around him and it’s some time before you can even get a look at anything more than his bald head. People offer numerous gifts: painted hides, fine woods, and, of course, gold. Each is graciously accepted then spirited away by the Great Dallum’s handlers into a wagon for transport.</p><p>When it’s finally your turn he sets a soft hand on your shoulder and looks at you with piercing green eyes. “What’s your name, mercenary?” His booming voice carries and he speaks at a quick clip, as though he’s rushing to get through his duties. Before you have a chance to answer, he asks if there’s a donation you’d like to make for his blessing of sight.</p>",
		"sectionLinks": "If you make a donation to the Great Dallum, read [section_122.4] now. Otherwise, read [section_120.5] now."
	},
	"183.3": {
		"title": "Visiting Trader",
		"text": "“Ah, my best customers! Heh.” It’s the old traveling merchant and his carriage full of items of suspicious origins. He invites you to poke through his inventory. “Same price as before, but even better value. No one’s going to come looking for these. Heh.” He doesn’t elaborate, and you think better than to press the issue.",
		"rewards": { 
			"text": "Each character may buy one item from the purchasable item supply for its listed price or one material resource for 7 gold." 
		}
	},
	"190.4": {
		"title": "Puzzle Book",
		"unlockedBy": { "section": { "id": "169.3" }},
		"text": "<p>Crain grins and lifts up a large decaying book, one you recognize from the catacombs. “Of all the texts I had a chance to peruse in those tunnels, this one fascinated me the most, and I understand absolutely none of it.”</p><p>The book doesn’t look like much. It’s bound in thin, tanned leather that’s so worn that the corners have begun to peek through. On the front cover are two words inscribed in faint, black ink. You raise a skeptical eyebrow.</p><p>“Yes! I’m excited as well,” Crain says. “That’s why I spent all night deciding on the best method to begin the translation. The numerical system, that’s what I’ve landed on. It’s quite different from any I’ve studied, but once I untangle it, I should be able to move on to the letters.” He pauses to consider something, then nods enthusiastically, convinced of it. “And how about you, friends? Care to take your luck with the old pen and paper?”</p><p>He riffles through the mosaic of parchment and snaps up a small leaf. On it, is a series of dots and dashes, a code if you were to guess. “It’s their numerals. Or could they be ordinals? No no, definitely numerals. Anyway, how about you give it a shot. A puzzle to fill the time between slaying and whatnot.”</p>",
		"rewards": {
			"text": "Open the puzzle book to the first page."
		}
	},
	"194.3": {
		"title": "Job Posting",
		"unlockedBy": { "other": "Town Guard Perk" },
		"text": "<p>The Crater is a burned-out pit where the old tavern used to stand. The building and its proprietor met their ends in the attack that happened when your band of mercenaries first arrived in Frosthaven, and despite the resources now being available to rebuild, no one seems to be in much of a hurry. A few tarps have been strung up between the remaining studs of the building and the environment has shifted from an actual business into a gathering spot for the populace. Extra furniture, mis-matched glassware, and an expectation you bring enough drink to share has made it into a friendly place to unwind, for as long as you can stand the wind and cold.</p><p>Tonight’s visit has a few people swapping stories around a metal drum full of coal, a Quatryl unhitching barrels of thick brown liquid off a donkey, and an old man wrapped tightly in a dirty cloak scribbling furiously in a journal. As you walk by, he flips it quickly shut.</p><p>“Trade a drink for a legend?” He taps two withered fingers on the table, encouraging you to join him. Intriguing enough. You pass your canteen over to him and he takes a long pull.</p><p>“The name’s Mulbrynn, but the story is about a group of explorers not unlike yourselves. Found an idol stronger than they were, something dark and powerful.” A wind whips through The Crater, and he pulls his cloak up to protect his neck. “Started talking to them, telling them to go up to the Imperial Mountains, that it would grant them their dreams and then some. Never made it, as best as I can tell.”</p><p>He pauses, getting a far-off look in his eye. “But I miss them. Maybe it’s the drink, or maybe it’s the cold, but it’s about time someone finished what they started.” He tears a page out of his journal and pushes it across the table, dropping your canteen on top of it as a paperweight. “That’s a map. Follow it or not, but I’m done mourning.”</p>",
		"rewards": {
			"scenarios": [{ "id": "132" }]
		}
	}
}