{
	"id": "001",
	"name": "A Town in Flames",
	"questLine": "Introduction",
	"coordinates": "FR",
	"complexity": 1,
	"location": "Frosthaven",
	"goals": "The scenario is complete when all enemies in it are dead. At the end of that round, read [section_9.1].",

	"sections": {
		"main": {
			"introduction": "<p>The sounds greet you first: muffled metallic pangs, a voice howling. It’s difficult to make anything out with the wind rushing past your ears, but you’d know that tune anywhere: there’s a fight up ahead.</p><p>But a fight means people, and if there are people, then the town must be close. You hear more: a scream; the crash of steel against stone; a deep, earthy growl.</p><p>You’re running now. Your legs are wasted from the hike, your shoulders ache from your gear, but the sounds are close now and up ahead you see gauzy orange light blooming in the air. With one last push, you round the final bend in the trail and you see it—Frosthaven—engulfed in flame.</p><p>Great petals of fire burst from windows and crawl over roofs. People stream from the town’s ruined gate, their faces bent in panic. A moment later, you see the object of their terror: a massive creature with two legs and two hulking arms covered entirely in thick white fur, three gnarled horns crowning its head.</p><p>“Algox raiders! We’re doomed!” cries an elderly porter beside you. “They’re stronger than anything else alive. We’ve come all this way for nothing!” As if to prove the point, the Algox you’ve been watching catches a fleeing outposter with one hand and hurls him backward as if he weighed nothing.</p><p>Ten days you’ve been hiking. Ten days and this is what you find. You breathe out a thick plume of foggy air and hoist your weapon high. Time to get to work.</p>",
			"specialRules": "All City Guards are allies to you and enemies to all other monster types. City Guards do not perform turns but instead gain an additional innate [shield] 1 (for a total of [shield] 2 at level 1) and [retaliate] 2, and have an initiative of 50 for the purpose of focusing.",
			"sectionLinks": "When door [one] is opened, read [section_5.3]."
		},
		"5.3": {
			"trigger": "Door [one] is opened",
			"text": "You run inside the gate and the breadth of destruction becomes quickly apparent. The town has been sacked. Smoke burns your eyes. What structures still stand are bright with fire, and the rest smolder, their frames like black, torched skeletons. And all about the wreckage howl the Algox, celebrating their victory in an unrecognizable language."
		},
		"9.1": {
			"trigger": "All enemies are dead",
			"conclusion": "<p>You lower your weapon and breathe as the remaining Algox retreat, scurrying from Frosthaven like giant white mice. They’ll be back, you’re certain of it, but for now, you can rest. You wipe the soot from your face and take stock.</p><p>Frosthaven is almost exactly what you imagined: a knot of gray stone and timber surrounded by sharpened palisade walls—a place where mere survival is an everyday concern and where only the desperate could feel at home. Thankfully though, the townsfolk are tough. They’re already on their feet, dousing fires and picking through rubble. In fact, one of those townspeople is marching right for you; a sharp-featured human woman with a fighter’s muscular build, close-cropped hair and dark skin, approaches and offers a gauntleted hand in greeting.“The sea be praised,” she says, crushing your fingers with enthusiasm. “We wouldn’t have held out much longer without you.”</p><p>You nod and ask what happened.</p><p>“Oh, just life up north is all,” she chuckles. “I’m Satha, mayor of this fort now that my predecessor and his lieutenant have fallen. As for the Algox, they’ve been at us all winter. Took them months to break through, but they finally did. Killed a dozen or so of my people... and would’ve done worse if you hadn’t shown up.”</p><p>You explain who you are, that you’ve been sent from White Oak. At the mention of the capital, her face scrunches up in displeasure.</p><p>“It’s about time they sent someone to help fix this mess they made,” she says, then tries to lighten her mood. “I don’t mean to be ungrateful. I am overjoyed to still be among the living, but a lot more people would be alive if your employers, the Merchant’s Guild, never stuck their noses in our business.</p><p>“I’ve spent my whole life here in what was once a fishing village, living and letting live with the Algox. Until last summer, that is, when the Merchant’s Guild sent some garrisons and bureaucratic-types up here to see how Frosthaven could ‘be of more use to the empire’. One of their expeditions proceeded to muck about in an Algox burial site, and the next thing we know, righteously angry Algox are attacking us. The ink-stains immediately high-tailed it out of here, leaving just a handful of soldiers behind to keep us safe.”</p><p>Satha clenches her gauntlet tighter and tighter as she tells the story, but now releases her grip. “I’ve had to learn a lot of things in the last year. The hard truth is that the Algox refuse to be reasoned with, and the only way to stay alive and keep this place I call home is to win the fight, regardless of who started it.”</p><p>Her face softens and she clasps your shoulder, hard. “There’s not many of you, but I’ll take what I can get, especially now that our garrison’s been thinned. And as it happens, I have an idea.”</p><p>She turns and gestures to the town’s smoldering walls.</p><p>“We took a beating in that fight, so if we’re going to survive much longer, we’ll have to do more than just sit around and wait for the next attack.” She sizes you up carefully. “I’ve already sent a scout to track the Algox back home to the mountains. Drop your gear at any longhouse that’s still standing and rest up. As soon as you’re ready, I want you to get over there and find a way to slow these attacks.”</p><p>The bunks in the remaining longhouses are all occupied by the injured, but you find a dry stretch of floor to lay your heads on your packs. You doubt you can sleep after the horror that greeted you in this little outpost, but before you know it a young Valrath man is nudging you awake: Satha’s scout has returned with his report.</p><p>He tracked the attackers to the foothills of the Copperneck mountains, where they entered a cave at the base of Snowscorn Mountain [scenario_3]. Interestingly, a smaller band split from the main group before they reached the cave and hiked around to the mountain’s deadly eastern face [scenario_2]. The scout didn’t see where they went, but he suspects a secret entrance to the Algox stronghold.</p><p>“One last thing,” the Valrath says as you wipe the final dregs of sleep from your eyes. “Another group is moving toward Snowscorn. They were Algox, no doubt, but they’re dressed differently than the ones who attacked us. They carried long sticks and had some wild animals with them. I don’t know if they’re going to attack the mountain or reinforce it, but either way, you’d better get there quick.”</p>",
			"rewards": {
				"text": "Set your morale to 2+X, where X is the number of City Guards still on the map.",
				"scenarios": [{ "id": "002" }, { "id": "003" }]
			}
		}
	},
	"path": ["main", "5.3", "9.1"]
}