{
	"id": "002",
	"name": "Algox Scouting",
	"questLine": "Introduction",
	"coordinates": "K8",
	"unlockedBy": { "scenario": { "id": "001" }},
	"complexity": 1,
	"location": "Copperneck Mountains",
	"goals": "The scenario is complete when all enemies in it are dead and ice sheet [a] has been destroyed. At the end of that round, read [section] <strong>77.3</strong>.",

	"sections": {
		"main": {
			"introduction": "<p>“They’ll be tired from the raid, so this is your moment.” Satha had explained, pointing you toward the foothills of the Copperneck Mountains where her scout tracked the Algox attackers. “I doubt you’ll be able to fight them all on your own, but maybe you can find another way to subdue them if you get close. On the other hand, they’ll be worn out after this little battle, so feel free to test your luck. Just remember, even a tired Algox is strong enough to rip someone in two.”</p><p>You head to the area indicated by the scout, following the Algox’s trail toward a wicked-looking mountain. As you draw nearer you see that the trail splits: the main force returned to the near side of the mountain, but a smaller group peeled off to hike around to the eastern face. The scout told you he suspected there was a back door to the Algox settlement, and you follow the smaller group’s trail hoping he was right.</p><p>The path narrows as you approach the steep eastern face, winding up to an overlook high above. Peering upward, you make out the faintest glimmer of light, but then a shape blots it out. A body, large and white, tumbles over the rocky ledge like a boulder, slamming against the jutting rocks. A dead Algox brawler, just like the ones who attacked Frosthaven, lies at your feet. Judging by its injuries, the rocks weren’t its only problem—there’s a fight up above. You scramble toward the top, hoping to make it before the battle is through. When you’re halfway up, another furry shape appears over the ledge.</p><p>“More intruders,” she scoffs. “You will never open the Skyhall. This place belongs to the Ice!” Your shock at the fact that an Algox just spoke your tongue is quelled as the speaker lifts a huge boulder and hurls it down at you. Time to move.</p>",
			"sectionLinks": "When door [one] is opened, read [section] <strong>27.1</strong>."
		},
		"27.1": {
			"trigger": "Door [one] is opened",
			"text": "<p>Dodging boulders on the side of a mountain wasn’t quite how you imagined spending the morning, but you make it to the overlook without getting crushed. However, just before you pull yourself over the final ledge, a voice carries over the wind, stopping you.</p><p>“Foul ice-pissers!” It shouts in a deep, commanding cry. “You’re nothing but petty blasphemers twiddling in your caves.”</p><p>You make it over the ledge and see the owner of the voice pinned between two boulders: she’s clearly an Algox, but she is dressed much differently from the brutes who were just hurling boulders at you. Larger than her male opponents, she wears ornate battle garb that marks her as a prominent member of a different faction. She turns to you with snarling hatred, but softens when she realizes you’re not friends of her enemies.</p><p>“Quickly then, warm-bloods—help me fight these dirt-lovers. Aid me, and I swear to aid you.” Her hand, though pinned, glows with a crackling blue energy.</p>",
			"specialRules": "The Algox Priest is an ally to you and an enemy to all other monsters. If all revealed enemies are dead, the Algox Priest focuses on moving toward and opening door [two]. If the Algox Priest dies, the scenario is lost.",
			"sectionLinks": "When door [two] is opened, read [section] <strong>6.1</strong>."
		},
		"6.1": {
			"trigger": "Door [two] is opened",
			"text": "<p>Finally you make it inside the mountain, but your victory is short-lived. Just past the cave opening huddles another group of defenders: musclebound Algox with icy fists. They’ve gathered in a circle, positioned like a lord’s private guard around some person of value, except all they seem to be protecting is an icecovered gap in the floor.</p><p>“They guard the Skyhall,” your Algox companion whispers. “We must break through that barrier if we are to end this fight.”</p><p>The guards, noticing your approach, turn and shout.</p><p>“You cannot pass, intruders! The Skyhall is closed to your kind!” They move quickly, uncrossing their arms and stepping forward. Your body is worn and your lungs still burn from the climb, while these guards are fresh to the battle, wholly rested and prepared to brawl. But it matters little. There is no other way forward.</p>",
			"specialRules": "Ice sheet [a] has Cx(L+2) hit points. It is an enemy to both you and the Algox Priest and an ally to all other monsters."
		},
		"77.3": {
			"trigger": "All enemies are dead and ice sheet [a] has been destroyed",
			"conclusion": "<p>The ice barrier shatters with a great earsplitting crack and you look down through the hole to a chamber far below. A stone floor covered in strange runic symbols and a spiral of pedestals radiating out from its center—Skyhall, it would seem. However, it’s much too far to simply jump.</p><p>“Ha! Finally it’s open.” You turn to see the Algox you rescued staring forward. She nods with a confident, satisfied frown. “Those foul Icespeakers cannot hope to keep this mountain now.”</p><p>She bends down and grabs a handful of snow, testing it between her fingers. Satisfied, she brings it to her face and whispers. The white powder flies from her hand and swirls around her. Whirling like a miniature storm, the snow lifts her off the ground and carries her gently down through the hole.</p><p>“Ah,” the Algox calls to you from below, “Are you not coming? Plenty more Icespeakers to kill.”</p><p>On cue, the snow around you swirls into a great eddy of white and lifts you like a leaf, carrying you down through the opening just like the Algox. As you float down, you get a grand view of the majestic open cavern that must be the Skyhall. It is a circular layout of stone seats with a raised platform in the center that holds an ornate altar.</p><p>The priest is doing something at the altar—perhaps praying—when you land, but she quickly turns and introduces herself as Lanprul, explaining the situation.</p><p>According to her, this mountain— Snowscorn—is a site of great religious significance to all Algox. However, the clans in the area are divided into two rival factions who disagree violently over how to communicate with their god. The Snowspeakers—led by the priest in front of you—believe their god speaks to them through the snow falling from the heavens, while the Icespeakers—or “dirtlovers”— claim to commune with divinity through ice that emerges from the ground below.</p><p>Currently, the Icespeakers inhabit the mountain, but when their war party went out to attack Frosthaven and returned battle-weary, the Snowspeakers used the opening to launch an attack of their own.</p><p>“But there is no more time for speech,” she says decisively. “The battle must be raging in the mountain’s heart, so if you want my help, we must head there with all haste.” With that, the Snowspeaker chieftain turns and moves to a tunnel leading deeper into the mountain.</p><p>You’re not sure which side you should take here, but you know this information is valuable. If you can help turn the tide in the Snowspeakers’ favor, you might be able to broker a truce with the victors. You follow the priest deeper into the mountain, wondering whether this is what Satha had in mind.</p>",
			"rewards": "<p><strong>Gain 1 [checkmark] each.<br/>Place map overlay sticker W on the map in location W (M7).</strong></p><p>New Scenario:<br/><strong>Heart of Ice</strong> <span class=\"scenarioNumber\">(4)</span> [linkForced]</p><p>Locked Out Scenario:<br/><strong>Algox Offensive</strong> <span class=\"scenarioNumber\">(3)</span></p>"
		}
	},
	"path": ["main", "27.1", "6.1", "77.3"]
}