{
	"id": 2,
	"coordinates": "K8",
	"name": "Algox Scouting",
	"complexity": 1,
	"location": "Copperneck Mountains",

	"goals": "The scenario is complete when all enemies in it are dead and ice sheet [a] has been destroyed. At the end of that round, read [section] <strong>77.3</strong>.",

	"introduction": "<p>“They’ll be tired from the raid, so this is your moment.” Satha had explained, pointing you toward the foothills of the Copperneck Mountains where her scout tracked the Algox attackers. “I doubt you’ll be able to fight them all on your own, but maybe you can find another way to subdue them if you get close. On the other hand, they’ll be worn out after this little battle, so feel free to test your luck. Just remember, even a tired Algox is strong enough to rip someone in two.”</p><p>You head to the area indicated by the scout, following the Algox’s trail toward a wicked-looking mountain. As you draw nearer you see that the trail splits: the main force returned to the near side of the mountain, but a smaller group peeled off to hike around to the eastern face. The scout told you he suspected there was a back door to the Algox settlement, and you follow the smaller group’s trail hoping he was right.</p><p>The path narrows as you approach the steep eastern face, winding up to an overlook high above. Peering upward, you make out the faintest glimmer of light, but then a shape blots it out. A body, large and white, tumbles over the rocky ledge like a boulder, slamming against the jutting rocks. A dead Algox brawler, just like the ones who attacked Frosthaven, lies at your feet. Judging by its injuries, the rocks weren’t its only problem—there’s a fight up above. You scramble toward the top, hoping to make it before the battle is through. When you’re halfway up, another furry shape appears over the ledge.</p><p>“More intruders,” she scoffs. “You will never open the Skyhall. This place belongs to the Ice!” Your shock at the fact that an Algox just spoke your tongue is quelled as the speaker lifts a huge boulder and hurls it down at you. Time to move.</p>"
}