{
	"id": "004",
	"coordinates": "M8",
	"name": "Heart of Ice",
	"unlockedBy": { "scenario": { "id": "002" }},
	"complexity": 2,
	"location": "Copperneck Mountains",
	"goals": "The scenario is complete when only one boss is dead and characters and character summons have collectively dealt damage to that boss equal to at least half its maximum hit point value (rounded up). At the end of that round, if the Snowdancer is dead, read [section] <strong>15.2</strong>; if the Frozen Fist is dead, read [section] <strong>22.1</strong>.",
	"effects": "Each character adds two [minus1] cards to their attack modifier deck.",

	"sections": {
		"mainA": {
			"introduction": "<p>The battle is near. Sounds of it echo off the tunnel’s icy walls: metal crashing against stone, thunder ripping the air, the chestshaking howls of Algox. Your breath is heavy as you follow your guide. Closer. Closer. And then you arrive.</p><p>The central chamber opens like a cavernous maw, ice and blood and bodies writhing in battle. In the center of the room hangs an enormous shard of pearlescent ice, and for a moment, you simply stare at it. The shard rotates slowly in the air, held aloft by some otherworldly means. Clearly, a great power does reign here.</p><p>But the middle of battle is no time to stand around. The Algox around you are locked in bitter combat, spells shooting out with terrible quickness and heavy fists swinging.</p><p>Your Algox companion shakes off his injuries and steps forward. From the cheers that rise from the combatants when he enters the room, you gather he must be some sort of leader to the Icespeakers. He concentrates and a thick whorl of ice collects on his fists, solidifying into jagged, brutal-looking gauntlets. His weapons ready, the chieftain tilts his head up and releases a howl so loud and terrible that it cools the blood in your veins.</p><p>Another terrifying howl tears through the air in response, and from the other side of the chamber a blistering bolt of blue energy shoots out and crashes against the wall next to you. It’s the Snowspeaker chieftain, standing almost a head taller than even your enormous companion, and she’s wielding the snow itself as a weapon.</p><p>The two chiefs charge and crash near the center of the room, blasting open a gap in the battle. Both are clearly more skilled than the other fighters, and each moves with a surety gained from authority. Thunder cracks around the Snowspeaker, and the Icespeaker bludgeons the air and ground with brutal strikes.</p><p>But then the sea of Algox condenses back around you, all of them looking angry and suspicious. If you want to get to the main, fight, you’ll have to fight your way through these combatants first.</p>",
			"specialRules": "<p>Do not set up or connect tile 11-B.</p><p>Door [1] is locked and will unlock when all revealed enemies are dead.</p><p>All Algox Scouts are allies to each other and enemies to all other figures. Likewise, all Algox Guards are allies to each other and enemies to all other figures. Use the [ally] attack modifier deck for the Algox Scouts, though they are still considered enemies to you.</p><p>Instead of using standees for the bosses, use the miniatures in tuck boxes [frozenfist] (Frozen Fist) and [snowdancer] (Snowdancer).</p>",
			"sectionLinks": "When door [1] is opened, read [section] <strong>75.1</strong>."
		},
		"mainB": {
			"introduction": "<p>The battle is near. Sounds of it echo off the tunnel’s icy walls: metal crashing against stone, thunder ripping the air, the chestshaking howls of Algox. Your breath is heavy as you follow your guide. Closer. Closer. And then you arrive.</p><p>But the middle of battle is no time to stand around. The Algox around you are locked in bitter combat, spells shooting out with terrible quickness and heavy fists swinging. Immediately before you stands a final cluster of guards. Their faces twist in fury at the sight of your party, realizing from which direction you’ve just come.</p><p>“Doomed whelps,” they shout, “we will destroy you for this intrusion!”</p>",
			"specialRules": "<p>Do not set up or connect tile 16-B.</p><p>Door [1] is locked and will unlock when all revealed enemies are dead.</p><p>Instead of using standees for the bosses, use the miniatures in tuck boxes [frozenfist] (Frozen Fist) and [snowdancer] (Snowdancer).</p>",
			"sectionLinks": "When door [1] is opened, read [section] <strong>75.1</strong>."
		},
		"75.1A": {
			"id": "75.1",
			"trigger": "Door [1] is opened",
			"text": "You move up into the main chamber to see the two chieftains locked in mortal combat around the massive crystal of ice in the center of the room. The Algox behind you no longer give chase. They are waiting to see what you do, but you can afford to wait no longer. If you’re going to buy security for Frosthaven, you’ll have to help finish this fight. It’s time to pick a side.",
			"specialRules": "The Frozen Fist and Snowdancer are enemies to both you and each other. Draw a separate Boss monster ability card for each one each round. All other monsters cannot focus on or target either boss in any way, and vice versa. If either boss dies and the scenario goal is not fulfilled, the scenario is lost."
		},
		"75.1B": {
			"id": "75.1",
			"trigger": "Door [1] is opened",
			"text": "<p>With the final group of guards dispatched, you move forward into the heart of the mountain. The central chamber opens like a cavernous maw, ice and blood and bodies writhing in battle. In the center of the room hangs an enormous shard of pearlescent ice, and for a moment, you simply stare at it. The shard rotates slowly in the air, held aloft by some otherworldly means. Clearly, a great power does reign here.</p><p>Your Algox companion steps forward, drawing looks of both terror and relief from those already in combat. Their eyes move over the chamber floor and lock onto a large figure standing on the other side: a huge Algox who has just emerged from another passage—the other chieftain, who tilts their head back and releases a long, angry roar.</p><p>Your companion roars back and the two chiefs charge and crash near the center of the room, blasting open a gap in the battle. Both are clearly more skilled than the other fighters, and each moves with a surety gained from authority. Thunder cracks around the Snowspeaker, and the Icespeaker bludgeons the air and ground with brutal strikes.</p><p>You only get a few moments to observe the fight before you notice that several of the combatants are waiting to see what you do, but you can afford to wait no longer. If you’re going to buy security for Frosthaven, you’ll have to help finish this fight. It’s time to pick a side.</p>",
			"specialRules": "The Frozen Fist and Snowdancer are enemies to both you and each other. Draw a separate Boss monster ability card for each one each round. All other monsters cannot focus on or target either boss in any way, and vice versa. If either boss dies and the scenario goal is not fulfilled, the scenario is lost."
		},
		"15.2": {
			"trigger": "The Snowdancer is dead",
			"conclusion": "<p>A blood-curdling howl, a bitter shift in the air, one last fading flurry from the Snowspeaker, and the battle is over. The aged Snowspeaker chief collapses to the ground, lifeless, and the chamber grows still. Sweat evaporates from your forehead and all around the battle-worn Icespeakers look on and the surviving Snowspeakers flee. A low voice rises up.</p><p>“A good fight, warm-bloods,” the voice says, resounding off the icy walls. It’s the Icespeaker chief, looking much worse for wear. He grasps his ribs, most of his weight settled on one leg. His face, though, shows not pain, but curiosity. “You helped us defeat these invaders, and for that, I am thankful. But why did you do it? Why would you set foot in our sacred mountain and risk the wrath of our god Geryuu?”</p><p>It’s the first chance you’ve really had to think about it, but you figure honesty is the best option here. You explain that you’ve been sent from Frosthaven on a mission to secure the town’s safety, and that you’d hoped by fighting in the battle that you might forge some sort of treaty with his tribe.</p><p>“No, Chief Elland! The humans defiled the Sacred Clearing!” One of the Algox roars, incredulous.</p><p>“These are their strongest warriors,” shouts a priest. “We can kill them easily.”</p><p>“Geryuu has brought them to us to help defend our home,” Elland shouts back at his surviving kin. “To kill them now would be to go against His will! In return for their aid, we will allow their town to stand for now.”</p><p>At this proclamation, the entire mountain rumbles, and a fear crosses Elland’s face.</p><p>“They are at the summit!” An Algox scout rushes into the cavern in a pure panic. “A powerful Snowspeaker is performing a ritual—they intend to bring down the whole mountain!”</p><p>Elland turns to you. “This clan is not on your side, but with continued help, maybe they can be.</p><p>“So you must climb,” the chief growls. “You must go up to the peak and find this Snowspeaker. Cast them down so the wolves may eat their flesh. It will take them some time, so you may leave and prepare. We will stop them from leaving the peak until you return to prove your friendship.” He nods at the rightness of his words and then, considering you for a moment longer, decides on something else. He claps an enormous hand down on your shoulder, nearly bringing you to the ground.</p><p>“And I shall send a champion to aid in this trial,” he says, his eyes wide and fiery, “to ensure it is successful.”</p>",
			"rewards": "<p><strong>Unlock [frozenfist] class box.</strong></p><p>New Scenario:<br/><strong>Avalanche</strong> <span class=\"scenarioNumber\">(6)</span></p>",
			"sectionLinks": "Immediatly read [section] <strong>63.1</strong>."
		},
		"22.1": {
			"trigger": "The Frozen Fist is dead",
			"conclusion": "<p>The Icespeaker chief, his body immense and heavy, finally crashes into the ground. His frozen fists shatter like glass. For a moment there is silence.</p><p>“You have helped us reclaim what is rightfully ours,” a voice says. It’s the Snowspeaker chief, her brow bleeding. “Now you must tell me why you did it.”</p><p>Seeing no alternative, you opt for honesty: You say that you’ve come here in response to the Icespeaker attack on Frosthaven on a mission to secure the town’s safety. You’d hoped that by helping the Snowspeakers, you’d be able to broker some sort of alliance, or at least a truce. You’re not sure how sincere this all sounds with so much blood covering your clothes, but you do your best to put on a straight face.</p><p>“We have no quarrel with the human town,” the Snowspeaker chief says. “In return for your aid, for now you will have no trouble from our tribe. Yet we cannot predict what the Icespeakers will do. If you wish for safety, help us do away with these blasphemers once and for all. Before we came here, we spotted a group of Icespeakers north of the Whitefire Wood. What they’re doing there, we do not know, but they will launch a counterattack if we do not intervene. I charge you then: kill those who wish us harm, and we will see about this peace.”</p><p>Seeing peace within your grasp, you agree to the terms.</p><p>“Chief Lanprul,” one of the Snowspeakers yells from the restless crowd. “We do not need these soft, tiny creatures to defeat the Icespeakers! Geryuu is on our side!”</p><p>The chief wordlessly raises her chin, a menacing blue light grows around the tips of her fingers, and the grumbles stop. She considers you again, and comes to another decision.</p><p>“These warriors are here by the will of Geryuu, and it would be foolish not to use their aid. But one of our champions will aid them in this fight,” she says, “as any good alliance requires both sides to be tested.”</p>",
			"rewards": "<p><strong>Unlock [snowdancer] class box.</strong></p><p>New Scenario:<br/><strong>Frozen Crypt</strong> <span class=\"scenarioNumber\">(5)</span></p>",
			"sectionLinks": "Immediatly read [section] <strong>63.1</strong>."
		},
		"63.1": {
			"conclusion": "<p>Finished with the Algox mountain, you head back to Frosthaven to plan your next move. There you find Satha speaking with a downtrodden populace, still reeling from the latest attack they barely survived. “A few new support beams here and there, patch up some of the walls, and we’ll be sure as snow in no time. You’ll see,” she says with a wink. “No frost or fire in the world’ll keep us down for long!” Her enthusiasm is met with minimal recognition as the residents continue to sift through the rubble. You grab the mayor long enough to make a report of your time with the Algox.</p><p>“The sea have mercy,” she snorts, slightly surprised, “this internal struggle with the Algox explains a lot. But at least it sounds like you’ve made strong progress towards getting at least one group to stop attacking us, so that’s something.”</p><p>“We’ve had some troubling developments of our own while you’ve been gone,” the mayor continues. “Some of the watchmen have reported Lurkers, of all things, on the outskirts of the territory <span class=\"scenarioNumber\">(7)</span>.”</p><p>“I reckon since you made it safely back to town, you might go out and check on those damned crabs for me. Better to get a handle on them before they show up at our door.” She punches you on the arm and then begins to walk away.</p><p>“Oh, actually,” she stops and turns back, “there was one more thing. A scouting party came back recently and reported seeing some strange metal constructs marching through the wastes. The scouts tracked them east through the Whitefire Wood and then into some frozen valley, but couldn’t follow beyond that, so you might as well have a look at that too <span class=\"scenarioNumber\">(8)</span>.”</p><p>You rub some of your bruises from the Algox altercation, and nod.</p><p>“Good,” Satha chirps. “And while you’re doing that, we’ll keep rebuilding the town. I’m sure you can already tell, but the north isn’t exactly hospitable, so we need to get Frosthaven back on its feet as soon as we can. That means we need all the resources we can find. So while you’re out there, see if you can collect some lumber, metal, and hides to help us out. Sea willing, we’ll be able to rebuild this outpost before winter, because if we don’t, then there’s no hope for any of us.”</p>",
			"rewards": "<p><strong>Gain 1 morale and 1 prosperity.</strong></p><p>New Scenarios:<br/><strong>Edge of the World</strong> <span class=\"scenarioNumber\">(7)</span><br/><strong>Crystal Trench</strong> <span class=\"scenarioNumber\">(8)</span></p>",
			"sectionLinks": "Add [section] <strong>156.1</strong> to the calendar in four weeks."
		}
	}
}