{
	"id": "007",
	"name": "Edge of the World",
	"questLine": "Lurker",
	"coordinates": "K3",
	"unlockedBy": { "scenario": { "id": "004" }},
	"complexity": 1,
	"goals": "The scenario is complete when the Coral Corpse is dead. At the end of that round, read [section_3.3].",
	"effects": "Each character adds one [minus1] card to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>Following up on Satha’s “crab problem,” you find yourself standing at the edge of the Biting Sea, an ice-choked gauntlet whose frigid waters have granted a swift death to many an overconfident mariner. You hike west, hugging the coast while hunting for signs of the enormous crustaceans. Frosthaven is visible in the southern distance, little more than a vague outline. Seeing it, you feel isolated, like someone looking back from the very edge of the world.</p><p>Another half hour of diligent tracking later, you happen upon your first clue: a pattern of pockmarks have been hammered into the ground near the foot of a hill, indents in the snow and dirt where the creatures have scuttled by. You follow the trail to a cave on the western side of the cliff, where you find a clutch of giant crablike figures chittering restlessly.</p><p>They’re as large as you’ve heard from stories: tall, hard-shelled beings with long, craggy limbs, and as soon as you appear, they rise to their full height, some of them larger than an Algox. They shriek and move quickly toward you, their pincers snapping.</p>",
			"sectionLinks": "When door [one] is opened, read [section_42.1].",
			"containsImage": true
		},
		"42.1": {
			"trigger": "Door [one] is opened",
			"text": "Having dispatched the Lurkers out front, you make your way inside the tunnel, a dank burrow riddled with pits of frigid water and stretches of black ice. What’s worse than the cold, however, is the smell—an intense putridness emanates from deep within the tunnel, equal parts rot and corrupted flesh. What it could be, you’d honestly rather not know.",
			"sectionLinks": "When door [two] is opened, read [section_48.4].",
			"containsImage": true
		},
		"48.4": {
			"trigger": "Door [two] is opened",
			"text": "The earthen tunnel eventually gives way to a natural cavern, where you find a half-rotted humanoid corpse shuffling aimlessly around like a lost drunk. The smell is incredible, burning your eyes and your throat. Looking closer, you see a large, pink stone lodged in the creature’s right eye socket. Another wave of reeking air overwhelms you, and you retch involuntarily. At this sound, the corpse turns and snarls.",
			"specialRules": "The Frozen Corpse is the Coral Corpse. It has HxC hit points, is immune to [immobilize], [disarm], and [stun], and adds [brittle] to all its attacks.",
			"containsImage": true
		},
		"3.3": {
			"trigger": "The Coral Corpse is dead",
			"conclusion": "<p>Ripping the shard from the corpse’s eye, you find the thing to be strangely beautiful. It’s slim and hollow, more like a piece of coral than a stone, and yet, there is a certain weight to it that seems uncanny for something only the size of a dagger handle. You bring it closer, admiring its crags and hollows, but as you do, you feel its weight grow. It presses down on your hand and then into your mind, sinking into you and pulling. The coral shard speaks to each of you, not with words, but with desires. It wants to move north, far out to sea, away from the cliffs and the frozen safety of Frosthaven. And it wants you to take it there.</p><p>This must have been what the Lurkers were after: a strange goal for what you thought were beasts no more sophisticated than wolves or spiders. Yet as the chunk of coral speaks to you, you know it to be true. They sought this object, and in order to understand why, you’ll have to follow the pull of the shard north across the water. But Frosthaven’s tiny fishing vessels aren’t fit for the journey, and you’re not about to swim. This leaves you with a choice: You can either keep your feet on dry land, following the shard along the northern coast [scenario_13]; or you can build a proper ship and head out into the ice-choked sea [scenario_14].</p>",
			"rewards": {
				"text": "Gain 10 [xp] each.<br/>Gain “Coral Shard” campaign sticker.",
				"scenarios": [{ "id": "013" }, { "id": "014" }]
			}
		}
	},
	"path": ["main", "42.1", "48.4", "3.3"]
}