{
	"id": "008",
	"name": "Crystal Trench",
	"questLine": "Unfettered",
	"coordinates": "G8",
	"unlockedBy": { "scenario": { "id": "004" }},
	"complexity": 1,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all characters have escaped. At the end of that round, read [section_54.4].",
	"effects": "Each character adds one [minus1] card to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>You travel east from Frosthaven, passing over the frozen wastes and into the Whitefire Wood, hoping to sort out the mystery of the wandering mechanical beings reported by Satha’s scouts. You’ve heard of such contraptions before, but no one in the north seems capable of building such things. There’s no place for delicate machinery up here, not where the air peels your heat away and frost can lock your weapon tight in its scabbard. Surely, the scouts must have been mistaken.</p><p>But machines aside, there are other sorts of creatures that do thrive in this climate, and one of them just dashed across your trail—wild hounds. You’ve been so occupied by your thoughts that you didn’t notice them until just now, and there’s movement all around you. An entire pack is stalking you, and now they’re closing in like a vice. Your position is terrible. It’s too narrow in this forest for a close fight, and there is hardly enough light to see by. You need to get out of here, so you run.</p><p>The trail is thick with roots and stones and fallen trees. Still, you run, and the wolves give chase, much more adept at moving through these woods than your group. Their shadows flicker between the thick brush, and their snarls are close.</p><p>Suddenly, there’s daylight. You break out of the forest and into the open, the trees giving way to ice and snow. However, this escape wasn’t quite what you’d hoped for. On either side of you stand great walls of ice and rock, and behind you, the pack of beasts. It’s an alley—a perfect place to funnel prey—and you just ran right into it.</p>",
			"specialRules": "<p>Characters cannot escape until all Polar Bears in the scenario are dead.</p><p>If any character becomes exhausted, the scenario is lost.</p>",
			"sectionLinks": "When door [one] is opened, read [section_21.1].",
			"containsImage": true
		},
		"21.1": {
			"trigger": "Door [one] is opened",
			"text": "Just when you think you’ve outrun them, the howling starts again. You glance behind you to see the hounds emerging from the shadows of the forest – shaggy silhouettes coalescing into fur and fang. There are too many to fight, so your only choice is to keep running.",
			"specialRules": "At the start of each round, spawn one Hound at any empty starting hex. It is normal for two characters, elite each second spawning for three characters, or elite for four characters.",
			"sectionLinks": "When door [two] is opened, read [section_12.1].",
			"containsImage": true
		},
		"12.1": {
			"trigger": "Door [two] is opened",
			"specialRules": "<p>Each [a] is an escape hex.</p><p>Continue spawning Hounds as described in [section_21.1].</p>",
			"containsImage": true
		},
		"54.4": {
			"trigger": "All characters have escaped",
			"conclusion": "<p>The pack is far behind you now, their snarls and barks fading far into the distance, and so, finally, you let yourselves slow to a march. The cold, for once, comes as a reprieve. You let it wash over and steal away the heat of battle, evaporating your sweat and taking the sting from your wounds.</p><p>For a long time after that, you march. The valley extends onward into the icy expanse of the north, finally opening into a vast field crowded with towering icy spikes. It looks almost like another forest, huge frozen pillars all gathered together, but these are no kind of tree you’ve seen. They are raw, frozen obelisks: enormous ice spears shot forth from the ground like huge monuments to some forgotten god.</p><p>You doubt this is what Satha was imagining when she sent you this way, but these things can’t be ignored. You scan the horizon and notice that deep in the expanse, one structure stands apart. Larger and darker in color than the others, it’s less a spike than a spire, and it reigns over the landscape like a lord’s keep.</p><p>You have the choice: you can either march to the massive spire [scenario_15] or opt for a closer target [scenario_16]. You do notice one not too distant spike that does look a little curious. It is shorter than the rest, but also wider. It might be worth a cursory investigation before venturing too deep into this unknown field.</p>",
			"rewards": {
				"text": "Gain 1 collective [lumber] and 2 collective [hide].<br/>Place map overlay sticker X on the map in location X (C7).",
				"scenarios": [{ "id": "015" }, { "id": "016" }]
			}
		}
	},
	"path": ["main", "21.1", "12.1", "54.4"]
}