{
	"id": "014",
	"name": "Jagged Shoals",
	"questLine": "Lurker",
	"coordinates": "L2",
	"requirement": { "transport": "boat" },
	"unlockedBy": { "scenario": { "id": "007" }},
	"complexity": 2,
	"location": "Biting Sea",
	"goals": "The scenario is complete when seven damage tokens are on snow rock [a]. At the end of that round, read [section_4.1].",

	"sections": {
		"main": {
			"introduction": "<p>Out on the water, the shard’s pull is stronger than ever. You let your mind ease and allow the shard to guide the way, steering your small crew farther and farther out to sea. It isn’t until just before sundown that you spot your destination: a sparse group of rocky crags jutting out of the surf. The shard hums in excitement— you’re close.</p><p>The deck lurches as salt sprays over the deck, but the hull is sturdy and handles the chop with ease. You anchor near the smallest of the rocks and then disembark to wade toward where the shard directs. Suddenly a shape dashes in your peripheral vision—something coming from the water.</p><p>Fish creatures, squat things with four legs and vicious teeth, crawl from the ocean with hunger in their eyes. But your attention is drawn elsewhere as the shard draws you forward. Its pull is incredible.</p><p>You run, leaping over crags until you find a small flooded hole surrounded by jagged stones. Peering into the murky water, you can feel, rather than see, that another shard of coral is stuck deep within. It will take some time to pry out… longer than you have. The amphibious predators have caught up, and now they close in, teeth bared.</p>",
			"specialRules": "<p>At the end of the round, if there is at least one character adjacent to snow rock [a], place one damage token on it. At the start of each listed round, spawn the following monsters at each listed location based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>Odd</th><td>[b]: One normal Piranha Pig<br/>[c]: Two normal Lightning Eels</td><td>[b]: One elite Piranha Pig<br/>[c]: Two normal Lightning Eels</td><td>[b]: One elite Piranha Pig<br/>[c]: Two elite Lightning Eels</td></tr><tr><th>Even</th><td>[d]: One normal Piranha Pig<br/>[e]: Two normal Lightning Eels</td><td>[d]: One normal Piranha Pig<br/>[e]: Two elite Lightning Eels</td><td>[d]: One elite Piranha Pig<br/>[e]: Two elite Lightning Eels</td></tr></tbody></table>",
			"containsImage": true
		},
		"4.1": {
			"trigger": "Snow rock [a] has seven damage tokens",
			"conclusion": "<p>The shard breaks loose with a final heave, skittering onto the stones. All at once, the battle around you stops. The creatures turn and stare, their eyes wide, and then flee, shrieking into the water.</p><p>The new shard is much like the first piece you found, small and hollow, but still you are taken by its beauty. In fact, you are so transfixed that you hardly notice that several new shapes have risen from the water around you. That is, until a lilting echo rings out, like a musician playing a crystal glass.</p><p>You turn and find a semi-circle of Lurkers watching you from the shallows. You prepare for another fight, but the monsters make no move to attack. Instead, the Lurker in the center tilts her head, repeating the same eerie tone. You realize then that she didn’t actually make a sound, but somehow caused you to “hear” its greeting inside your heads. The echo fades, and with it you feel your aggression wash away—you won’t need your weapons.</p><p>The Lurker steps forward from the others, and a shared vision flashes through your minds: sunlight filtering through coastal shallows, dancing in dappled waves over a delicate coral reef. The vision fades almost instantly, but you realize with surprise that the Lurker is introducing herself: This image—Sun in Shallows—is the creature’s name.</p><p>The Lurker turns her attention to the coral shards. She wants them too, you can tell; whatever pull you feel from the shards tugs at these Lurkers twice as hard. You sense sadness, confusion, jealousy that the shards have chosen land-dwellers. But Sun in Shallows doesn’t move to take the treasures; instead, she inhales deeply, her chinked carapace swelling. When she exhales, you feel another vision invite itself into your mind—a story told in a series of psychic images.</p><p>Deep, deep beneath the waves, a beautiful crown rests on a pedestal in a palace made of woven amethyst coral—the work of thousands of architects over hundreds of years. A throng of Lurkers has assembled to witness a coronation.</p><p>The crown calls to you from within the vision, consuming your focus as the rest of the image fades away. You draw closer to it, feeling its power, but as you reach out to touch it, a cloud of inky sludge emerges and swirls around the crown, shattering it and plunging the assembled Lurkers into darkness. The crown is gone.</p><p>What follows is a period of blind frenzy. You don’t know how many years pass in the vision, but you watch as the great underwater empire collapses, its citizens’ minds reduced to animal instinct. Artistry, craft, even language—all are forgotten in the Lurkers’ decline.</p><p>Then, in the darkness, hope: a pinprick, an oasis of light in the endless black sea. Then another, then another, calling out to each other. They are pieces of the ruined crown, scattered across the world. You see a few Lurkers in these oases begin to stir from their haze and seek the shards out, though the other Lurkers remain in the clutches of the inky water.</p><p>Finally, a plea: you see the shards pull back together in your vision, re-making the coral crown and banishing the darkness from the realm of the Lurkers forevermore.</p><p>The vision fades, and you’re left blinking in the sunlight. Sun in Shallows stands before you, her hope for the future of the ancient Lurker kingdom laid bare. All that remains of your vision is the all-consuming pull of the crown, which lingers in your minds as if asking a question: Will you do it?</p><p>The creatures stand patiently in the surf, their huge, barrel-sized claws hanging taught before them. You feel the sting of the crown, the emptiness in your chest.</p><p>You nod, and Sun in Shallows breaks into celebratory chitters. She and most Lurkers descend back into the waters, but one remains, an offer of aid clear in your minds.</p><p>And then the shards redouble their pull, drawing you now to the east, farther out into the sea.</p>",
			"rewards": {
				"text": "Choose one: Unlock [crashingtide] class box OR unlock [deepwraith] class box.<br/>Gain “Coral Shard” and “Shard Seeker” campaign stickers.",
				"events": {
					"WO": [{ "id": "WO-81" }]
				},
				"scenarios": [{ "id": "022" }]
			}
		}
	},
	"path": ["main", "4.1"]
}