{
	"id": "015",
	"name": "Ancient Spire",
	"questLine": "Unfettered",
	"coordinates": "D7",
	"unlockedBy": { "scenario": { "id": "008" }},
	"complexity": 2,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when the Chaos Lieutenant is dead. At the end of that round, read [section_70.3].",
	
	"sections": {
		"main": {
			"introduction": "<p>The iron spire towers over the barren wastes, riveted metal covered in a thick lens of ice. The thing stands taller than even the Great Sanctuary back in White Oak, cutting through the daylight and casting a long, foreboding shadow onto the snowy plain like some nefarious sundial.</p><p>The opening mechanism on the black iron door is wholly foreign, but with a good deal of tinkering and prying, you finally manage to force it open and are greeted by a sudden blast of arid heat. Inside is a wide, echoing chamber filled with cogs and pistons and dozens of scampering mechanical creatures. The creatures pay you no attention at all, and instead hurry about, carrying armfuls of debris down a single immense hallway.</p><p>Meeting no resistance, you make your way inside the tower and travel down the main hallway until it empties into a wide circular room, where an enormous beam of sanguine energy crackles and hums, shooting up from the chamber’s floor and piercing the ceiling. It’s as if a small sun was harnessed and imprisoned inside this tower.</p><p>This main chamber is filled with even more mechanical creatures. They still pay you no attention, but as some of them pass by, you manage to get a closer look at what they’re carrying, and the sight of it cools your blood. Body parts—arms and legs and torsos, cut from all manner of animals, but you notice some Algox parts as well—are being carried about as if they were coal in a furnace room. The scale of the slaughter is staggering as you consider the number of automatons scurrying through the chamber, carrying their loads down a stairwell on the other side.</p><p>Just then a ghastly looking creature made of swirling prismatic smoke and a hard, gnarled shell moves out from behind a row of metal boxes and catches sight of you, releasing a high, visceral screech.</p><p>“Mortal scum,” it yells. “You dare intrude here with your filthy blood? I will take pleasure in using your limbs to complete the cycle!”</p><p>The demon rakes a hand over a nearby panel of lights and, responding as one, the entire horde of automatons all cease moving. Their gruesome cargo drops to the floor and then, slowly, they advance toward you.</p>",
			"specialRules": "<p>The Chaos Demon is the Chaos Lieutenant. It is immune to [disarm] and [stun]. At the end of each round, in addition to its normal turn in initiative order, it performs [heal] X, self, where X is (RxL)/2 (rounded down), and R is the number of Ruined Machines currently on the map.</p><p>At the start of each even round, spawn C-1 normal Ruined Machines at [c].</p><p>All hexes on tile 15-D are treated as in range of any ranged abilities performed on tiles 1-B and 6-B, regardless of the actual range or line-of-sight. In addition, all hexes on tile 15-D are considered the same distance away from tiles 1-B and 6-B for the purpose of focusing with ranged attacks.</p><p>Any character can spend 2 movement points to move from any hex [a] to [b], but they cannot move from [b] to either [a]. When any character enters tile 1-B, 2-H, or 6-B, all characters can no longer teleport from tile 15-D to any other tile or move from [a] to [b].</p>"
		},
		"70.3": {
			"trigger": "The Chaos Liutenant is dead",
			"conclusion": "<p>It’s over. The demon lies ruined beneath you, its life ebbing slowly out, but still, it speaks.</p><p>“Your efforts mean nothing. Our machinations are ageless. We will gather our power and turn this world to ash.” It’s glossy eyes swivel toward the tower above, and a terrible smile curls over its face. “Even now my kin prepare to destroy you mortal upstarts and your failed outpost.”</p><p>The demon tries to laugh but the effort pushes it over the edge. The creature’s body swells and then sinks down, breaking its physical barriers and dissolving into a slick of prismatic fluid that seeps through the grates below you, leaving only a greasy smear behind.</p><p>However, with the demon’s passing you notice that the machines—what few were still hanging on—suddenly drop to the floor, dormant. A connection, perhaps, between them and the infernal creature.</p><p>Taking stock of the chamber again, you find two points worthy of inspection. First is a stairwell leading down, where a number of the automatons had been carrying their cargo when you first entered [scenario_23].</p><p>Second, the beam of light. Standing close to it, you can feel its sickly energy radiating outward, and yet there is a warmth to it that is not entirely repellent. It’s like some immense tropical waterfall flowing in reverse.</p><p>Acting on a hunch, you grab a hunk of ruined machine from the floor and toss it into the light. It hovers there, begins to fall, and then vanishes from sight. A second later, you hear a soft metal clang from somewhere up above, and you understand. Teleportation magic is a fickle thing, but if you decide to investigate the upper levels of this tower, at least you now have a way up [scenario_24].</p>",
			"rewards": {
				"text": "Gain 1 collective [lumber], 1 collective [hide], and 1 collective [metal].",
				"scenarios": [{ "id": "023", "linked": true }, { "id": "024", "linked": true }]
			}
		}
	},
	"path": ["main", "70.3"]
}