{
	"id": "019",
	"name": "Skyhall",
	"questLine": "AlgoxIcespeaker",
	"coordinates": "N7",
	"unlockedBy": { "scenario": { "id": "011" }},
	"complexity": 3,
	"location": "Copperneck Mountains",
	"goals": "Unknown at this time.",
	"effects": "Each character gains [wound].",

	"sections": {
		"main": {
			"introduction": "<p>Snow and rock fall freely as the mountain shakes violently. Boulders zip past your rappel lines, plummeting through space before crashing into the ground with incredible thuds. Every second you’re outside is another second nearer to death, so the instant you touch down, you unlatch your harness and run. But rather than flee for the safety of the plains, you dive down into the tunnels, knowing that it’s only a matter of time before Snowscorn comes crashing down. You have to find the Icespeaker chief in the hopes that he knows how to stop this.</p><p>Panicked Algox clog the passages as they try to escape their crumbling home, but the chief is easy to find. He’s right where you expect him to be, standing in the central chamber, giving rapid orders to his kin, telling them to leave everything and flee.</p><p>“The spirits of Skyhall have turned against us,” he growls when he sees you. “You must come with me, quickly!” You turn and follow as the tremors intensify, the entire mountain threatening collapse. The Skyhall is a wide, circular room domed with glistening crystals—clearly a place of great religious significance. The floor is carved with a number of intricate glyphs, and stout pedestals made of ice stand in patterns around the room. The chief moves slowly, reverent even despite his rush, but you sense the presence of an almost palpable frustration, a twisted anger hovering in the air.</p><p>Shadows materialize in front of your eyes—gray spirits wriggling out of nothingness. They are pale, wickedlooking things: ghostly in body but with sharp spectral claws and a pure, unchecked hatred in their eyes.</p><p>Another tremor rises up and the Algox chief shouts over it. “You must put the spirits to rest. Their anger will bring down the mountain!”</p>",
			"specialRules": "<p>All altars are immune to damage at this time.</p><p>At the start of each listed round, spawn the following monsters at each listed location based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>1</th><td>[a]: One normal Flame Demon</td><td>[a]: One normal Flame Demon</td><td>[a]: One elite Flame Demon</td></tr><tr><th>2</th><td>[b]: One normal Earth Demon</td><td>[b]: One normal Earth Demon</td><td>[b]: One elite Earth Demon</td></tr><tr><th>3</th><td>[c]: One elite Ice Wraith</td><td>[c]: One elite Ice Wraith<br/>[d]: One normal Ice Wraith</td><td>[c]: One elite Ice Wraith<br/>[d]: One normal Ice Wraith</td></tr><tr><th>4, 5, 7, 8</th><td>[c]: One normal Flame Demon<br/>[d]: One normal Earth Demon</td><td>[c]: One normal Flame Demon<br/>[d]: One elite Earth Demon</td><td>[c]: One elite Flame Demon<br/>[d]: One elite Earth Demon</td></tr><tr><th>6, 9</th><td>[a]: One normal Ice Wraith<br/>[b]: One normal Earth Demon</td><td>[a]: One normal Ice Wraith and one elite Ice Wraith<br/>[b]: One normal Earth Demon</td><td>[a]: One normal Ice Wraith and one elite Ice Wraith<br/>[b]: One elite Earth Demon</td></tr></tbody></table>",
			"sectionLinks": "At the end of the ninth round, read [section_75.2].",
			"containsImage": true,
			"unlockedSections": ["75.2"]
		},
		"75.2": {
			"trigger": "End of the ninth round",
			"goals": "The scenario is complete when all six dark fogs have been destroyed. At the end of that round, read [section_58.1].",
			"text": "<p>No matter how many wraiths you destroy, the tide never seems to ebb. They rise like infernal vapor and come at you, each one more furious than the last.</p><p>“Something is wrong,” the chief huffs. “No Snowspeaker could control so many spirits. There must be something here that spurs their anger.” He raises his fists in the air and beseeches them. “Show me what is wrong, spirits. Please, tell me what I must do!”</p><p>The answer comes in fitting form. The ground shifts violently, your feet nearly sliding out from under you, and a huge shard of ice breaks from the ceiling, crashing into a pillar below. The icy plinth shatters, but something is revealed beneath it—a glowing crystal of black ice jutting upward like a thorn.</p><p>“There!” The chief shouts. “They have corrupted Skyhall itself. We must purge their devilry. Destroy the pillars.”</p>",
			"specialRules": "<p>Replace any one altar with dark fog.</p><p>All altars can now be damaged. Each has Cx(L+2) hit points. They are enemies to you and allies to all monsters. Whenever any altar is destroyed, replace it with one dark fog.</p><p>Each dark fog has Cx(L+2) hit points. They are enemies to both you and all monsters, with an initiative of 01 for the purpose of focusing.</p>",
			"unlockedSections": ["58.1"]
		},
		"58.1": {
			"trigger": "All six dark fogs have been destroyed",
			"conclusion": "<p>The last of the black shards explodes into a thousand tiny fragments, and the spirits snuff out with a hush. The howling and trembling of the mountain ceases at once. You are left stilled by the silence. The walls and ceiling are all riddled with cracks, and the floor is rent with jagged scars. It seems that the battle ended not a moment too soon.</p><p>Chief Elland stands and groans, his enormous muscles steaming in the frigid air.</p><p>“This… this cannot continue,” he says. “Look. Look at what’s befallen the Skyhall: such sacrilege, such plain hatred.” His eyes search for answers.</p><p>“The Snowpseakers must be destroyed,” A new voice says, coming from down the hall. It is an older, female Icespeaker, trailed by a group of battle-worn fighters. “The only solution is to wipe them out completely. We can use the conduits our kin have erected around the Whitefire Wood to purge them from the land.”</p><p>The chief clenches his jaw and snaps back, “No, Putargal, for three centuries we have made war with the Snowspeakers, and look what it brings us. If not for the warmbloods, our home would be rubble. More conflict is not the answer. Water poured on ice will only create more ice.”</p><p>Putargal snarls, a raw contempt burning in her eyes.</p><p>“Do not presume you speak for us all,” she growls, “The Snowspeakers kill us, corrupt the Skyhall itself, and threaten to destroy everything we know... and you call for peace? Those fiends must pay for what they have done this day.” She turns and begins to walk out, but stops and calls back. “You, warm-bloods. Come meet with me after you have recovered. We will honor your alliance only if you aid us in our counterattack.” And with that, she leaves.</p><p>For a moment you stand in the new silence of Skyhall, considering this new schism and how you’ve found yourself at the center of it. The Algox chief turns to you.</p><p>“Please,” he says, “this is not the way. More fighting will never bring us peace. You must join me instead. I have a plan to end this brutal cycle.” The chieftain takes you aside. It will take some time, but I believe I can arrange a peace summit with the Snowspeakers to discuss a treaty. After the damage Skyhall has sustained, and that which Putargal threatens, we must end this cycle of destruction. When the time comes, I hope you will join me instead, and we will truly end this war.</p>",
			"rewards": {
				"text": "Gain 1 morale.<br/>Gain one random item blueprint."
			},
			"sectionLinks": "Add [section_54.3] to the calendar in four weeks."
		}
	},
	"path": ["main", "75.2", "58.1"]
}