{
	"id": "020",
	"name": "Temple of Liberation",
	"questLine": "AlgoxIcespeaker",
	"coordinates": "L9",
	"unlockedBy": { "scenario": { "id": "012" }},
	"complexity": 3,
	"location": "Copperneck Mountains",
	"goals": "The scenario is complete when the glowing orb is destroyed. At the end of that round, read [section_57.2].",

	"sections": {
		"main": {
			"introduction": "<p>The light here is sparse. You tread carefully with torches held high, the long stone hallways bending in the darkness. You march with your eyes straining forward, and only after a long stretch of time do you find anything new. A hallway appears, bathed in a faint yellow glow. The light is dim at first but intensifies as you continue on, and a few moments later you arrive at the source: an immense chamber dominated by a huge, humming yellow orb.</p><p>The room is truly massive. The soaring domed ceiling is carved with intricate rectangular designs. The walls too share this motif, and four large pillars stand in four quadrants of the room, each topped with a small, glowing yellow node.</p><p>The orb, which is the primary source of the light, is positioned in the center like a sun, humming in key with the four pillars around it.</p><p>A small crowd of mechanical creatures have gathered here. Some look like the machines you’ve faced already, bipedal beings made of metal and cord, but others are new and strange. All of them are turned toward the orb, heads bowed as if in prayer.</p><p>There is little time to wonder at the sight. Shortly after you enter, one of the machines turns and sees you. It rises at once and the other mechanical parishioners follow like a silent wave. As they do, the four pillars deploy a protective shroud that encases the main orb in a hazy barrier of light. That orb must be driving them, you think, but as soon as the thought crosses your mind, the machines charge. Their metal feet click against the stone floor, and through a passage at the far end of the room, you can see shadows flickering—reinforcements on their way. You need to shut down the barrier and disable the orb, and you need to do it fast.</p>",
			"specialRules": "<p>At the start of each even round, spawn one Ruined Machine at each [a] and [b]. These spawns are normal for two characters, elite at [b] for three characters, or all elite for four characters.</p><p>At the start of each odd round after the first, all characters, character summons, and Ruined Machines occupying or adjacent to any hex with a power conduit or metal cabinet suffer trap damage.</p><p>The glowing orb is immune to damage at this time.</p><p>Each metal cabinet has Cx(L+2) hit points. They are enemies to you and allies to all monsters. They have an initiative of 01 for the purpose of focusing. Whenever any metal cabinet is destroyed, spawn one Flaming Bladespinner at to the glowing orb. It is normal for two or three characters, or elite for four characters. In addition, the closest [a] or [b] no longer spawns anything, and the closest power conduit no longer causes trap damage.</p>",
			"sectionLinks": "When all metal cabinets are destroyed, read [section_14.3].",
			"containsImage": true
		},
		"14.3": {
			"trigger": "All metal cabinets are destroyed",
			"text": "The final pillar is reduced to a chaotic mass of cable and scrap, and the highpitched whine emanating from the orb slowly lowers and then sputters out. The yellow light flickers and fades. The orb is vulnerable, but the fight isn’t over. As a last-ditch effort to protect the power source, two hulking giants of metal rise up from the machinery beneath the orb. You’re not sure you could even bring them down, but with any luck, destroying the orb should end this fight.",
			"specialRules": "<p>Do not spawn the Flaming Bladespinner for the last metal cabinet. Instead, spawn two Steel Automatons at the glowing orb. These are normal for two characters, or elite for three or four characters.</p><p>The glowing orb can now be damaged. It has Cx(L+2) hit points. It is an enemy to you and an ally to all monsters.</p>"
		},
		"57.2": {
			"trigger": "The glowing orb is destroyed",
			"conclusion": "<p>You aim true and the orb cracks. The thick glass splits like a piece of marble, and the light within it fades. A puff of smoke leaks out, smelling of burnt sap and rain. The room reels in response. The machines seize and fall silently to the ground, but the door leading onward slams shut, locked into place by thick metal gear.</p><p>With the yellow glow now gone, you relight your torches and examine the door. In order to move forward, you’ll have to disable the mechanism securing it, but the system is incredibly complex. A large ring is affixed to the center of the door, and this ring holds six smaller circular plates at even intervals. You reach out and touch one of the pieces and find it strangely cold compared to the warmth of the room. You press harder and a pained creaking echoes throughout the room, one of the plates giving an unwilling turn. You press harder still, and discover the entire rings spins as well. You spend a great deal of time doing this, turning the ring and the plates into different positions, but, beyond making a fair deal of noise, the door refuses to budge.</p><p>You look closer and see a number of symbols etched in the wall along the circumference of the device. Starting from the top and going clockwise, you see a skull, a scarab, a triangle, a moon, a star, and an anchor. They must mean something, but, as much as it pains you to admit, without further context, you’ll have to turn back for now.</p>",
			"rewards": {
				"text": "Gain 15 gold each."
			}
		}
	},
	"path": ["main", "14.3", "57.2"]
}