{
	"id": "024",
	"name": "Upper Spire",
	"questLine": "Unfettered",
	"coordinates": "D6",
	"unlockedBy": { "scenario": { "id": "015" }},
	"complexity": 2,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all characters have escaped. At the end of that round, read [section_88.3].",
	"effects": "Each character gains [curse] twice.",

	"sections": {
		"main": {
			"introduction": "<p>This dark metal tower was built for some purpose, and you’re certain the truth will be at the top. You need to see where this beam of red light leads. When you step into the beam of light, you feel nothing at first. The world around you becomes a crimson stained version of itself . You feel silly, realizing that maybe this beam was meant only for the transportation of machines. But then you take a breath, and everything wobbles. Your vision bends, and the world snaps with sudden violence into an entirely new shape. You have no time to react—if you did, you would almost certainly scream—but in a blink it’s over and you are somewhere else, standing in an entirely new room. The redness is gone, but you feel terribly off-balance. It’s as if you’ve been at sea for months and have just run aground. For whatever reason, there is a dry, smoky taste on your tongue.</p><p>You’re in a smaller room now—an upper level of the spire, you think. The red beam is still coursing through the center of the floor, and all around it are a number of automatons, just like the workers downstairs, except these are still active. The reason for this is quite clear: just past the beam hovers another demon, thrashing its long, leathery tendrils in rage.</p>",
			"specialRules": "<p>Shuffle the twelve numbered tokens face-down next to the map.</p><p>All corridor hexes in the scenario represent the beam of chaotic energy. All monsters treat all corridors as negative hexes. Whenever any figure enters a corridor hex, immediately reveal one numbered token and apply the corresponding effect to that figure:</p><p><strong>1:</strong> Gain [regenerate]<br/><strong>2:</strong> Gain [ward]<br/><strong>3:</strong> Gain [strengthen]<br/><strong>4:</strong> Gain [bless] twice<br/><strong>5:</strong> Perform [heal] 2+L, self<br/><strong>6:</strong> The closest monster suffers trap damage<br/><strong>7:</strong> Gain [wound]<br/><strong>8:</strong> Gain [brittle]<br/><strong>9:</strong> Gain [muddle]<br/><strong>10:</strong> Gain [curse] twice<br/><strong>11:</strong> Suffer trap damage<br/><strong>12:</strong> Spawn one normal Living Bones at the closest empty non-corridor hex.</p><p>Whenever all numbered tokens have been revealed, shuffle them all face‑down again.</p><p>If any character becomes exhausted, the scenario is lost.</p>",
			"sectionLinks": "When all revealed enemies are dead and any character occupies a corridor, after applying any numbered effect, read [section_83.2].",
			"containsImage": true,
			"unlockedSections": ["83.2"]
		},
		"83.2": {
			"trigger": "All revealed enemies are dead and any character occupies a corridor",
			"text": "Seeing no other opportunity for advancement, you close your eyes and step into the red beam. For a moment, you feel weightless, and then gently your weight returns as your feet settle into a new floor. It was almost a pleasant experience, but then you open your eyes. You have definitely arrived somewhere new, and this place is also swarming with demons and machines.",
			"specialRules": "Place any figure occupying a corridor on tile 15-D in any empty corridor hex on tile 8-A. From now on, whenever any figure enters a corridor hex on tile 15-D, after applying a numbered effect, place them in any empty corridor hex on tile 8-A (if able), and apply a numbered effect for it, as well. No figure can travel from tile 8-A to tile 15-D, and there is no line-of-sight or focus between rooms. Character summons on tile 15-D focus on the nearest empty corridor hex.",
			"sectionLinks": "When all revealed enemies are dead and any character occupies a corridor on tile 8-A, after applying any numbered effect, read [section_74.2].",
			"containsImage": true,
			"unlockedSections": ["74.2"]
		},
		"74.2": {
			"trigger": "All revealed enemies are dead and any character occupies a corridor on tile 8-A",
			"text": "Well, it worked last time. You keep your eyes open this time so that you can see the new foes materialize around you.",
			"specialRules": "Place any figure occupying a corridor on tile 8-A in any empty corridor hex on tile 4-B. From now on, whenever any figure enters a corridor hex on tile 8-A, after applying a numbered effect, place them in any empty corridor hex on tile 8-A (if able), and apply a numbered effect for it, as well. No figure can travel from tile 4-B to tile 8-A, and there is no line-of-sight or focus between rooms. Character summons on tile 8-A focus on the nearest empty corridor hex.",
			"sectionLinks": "When all revealed enemies are dead and any character occupies a corridor on tile 4-B, after applying any numbered effect, read [section_12.5].",
			"containsImage": true,
			"unlockedSections": ["12.5"]
		},
		"12.5": {
			"trigger": "All revealed enemies are dead and any character occupies a corridor on tile 4-B",
			"specialRules": "Each corridor hex on tile 4-B is now an escape hex.",
			"unlockedSections": ["88.3"]
		},
		"88.3": {
			"trigger": "All characters have escaped",
			"conclusion": "<p>The final demon dies like ice thrown into a weak fire. It sizzles and pops, and then melts away, its body dissolving into a wet, oily stain on the ground. When it’s gone, you are left standing in the smallest chamber yet, filled with lifeless machines and the ever-present pillar of light.</p><p>There is a way forward at least: a set of iron stairs lead up to what must be the top of this spire. But you take a few moments to rest before continuing on. All this demon fighting and teleporting is exhausting work, and you’re looking forward to a nice drink on solid ground. But the spire has other plans.</p><p>In the midst of your reprieve, the red beam suddenly brightens and courses upward faster than before. It moves so fast, in fact, that it shakes the floor and lets loose splinters of stray energy. As this happens, the humming noise that you’d grown so used to rises as well, becoming a thunderous roar. You back away from the beam, guarding your eyes. A voice calls from above.</p><p>“Silly things,” it says, deriding you with an erratic, fluctuating tone. “Silly mortal things. Reveling in tiny victories, small delays, as though I haven’t got time. I will see you soon, little puppets.”</p><p>The beam settles down for a moment but then rises once again, swelling to such a wild intensity that the entire spire begins to shake. Whatever is up there is anything but frightened of you, but you remember the first demon’s warning. You don’t know how long you have, but if the thing at the top of the spire finishes its task, Frosthaven could be doomed. You had better prepare for a real fight.</p>",
			"rewards": {
				"text": "Gain one random item blueprint.",
				"scenarios": [{ "id": "034" }]
			}
		}
	},
	"path": ["main", "83.2", "74.2", "12.5", "88.3"]
}