{
	"id": "025",
	"name": "Rusted Tunnels",
	"questLine": "Unfettered",
	"coordinates": "E10",
	"unlockedBy": { "scenario": { "id": "016" }},
	"complexity": 2,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all enemies in it are dead. At the end of that round, read [section_16.1].",
	
	"sections": {
		"main": {
			"introduction": "<p>After leaping off the ruined elevator, you discover that the metal walkway that saved your life leads directly to a door with a flashing red light. The security system is still in effect, and you might as well dismantle it while you search for another way out. Your footsteps clang softly against the metal path, echoing into the vast nothingness.</p><p>It isn’t long before you arrive at the edge of the cavern and find the entrance to a tall, narrow tunnel. The tunnel’s walls have been carefully carved out and reinforced with thick bars of heavy iron, all of which are coated in rust.</p><p>The red light hangs only a short distance within—a single blinking orb mounted onto a wall—and under its steady flash you can make out the shapes of some sort of creature. They’re moving slowly about in the low gloom, almost as if they’re searching for something. You realize only too late that the thing they’re searching for is you.</p><p>One of them, a stout metallic body, stops and peers in your direction. Its glassy eyes catch the flashing glow from above, and an instant later the tunnel is filled with light. Dozens of red lamps lining the walls burst to life and dye the room in a sharp scarlet fluorescence. In the new light you can see the tunnel clearly, and it is packed with mechanical guards. Several are already waiting on the steel walkway, and more are beginning to emerge from adjoining tunnels. Flame and sword and gun barrel swing outward, and the machines begin to advance.</p>",
			"sectionLinks": "When door [one] is opened, read [section_58.2].<br/>When door [two] is opened, read [section_61.2]."
		},
		"58.2": {
			"trigger": "Door [one] is opened",
			"text": "They’re coming from the tunnels. Two smaller passageways connect to this main one, and no matter how many machines you strike down, reinforcements emerge a few moments later. You need to cut off their line, and you formulate a plan. The main tunnel’s supports have not aged well. More than once you’ve accidentally knocked chunks of rust off the metal scaffolding during the fight, and so you suspect that, if you can make your way to each of the smaller ingresses, you could smash their metal supports and bring them down, cutting off the enemy troops.",
			"specialRules": "<p>The large debris has Cx(L+2) hit points. It is an enemy to you and an ally to all monsters. When it is destroyed, instead it becomes a wall. Remove all figures, tokens, and tiles occupying [b] or any hex beyond it, and then place another large debris wall in [b]. All removed characters become exhausted.</p><p>At the start of each round, until the large debris in this room is destroyed, spawn one Flaming Bladespinner at [a]. It is normal for two characters, elite each second spawn for three characters, or elite for four characters.</p>"
		},
		"61.2": {
			"trigger": "Door [two] is opened",
			"specialRules": "<p>The large debris has Cx(L+2) hit points. It is an enemy to you and an ally to all monsters. When it is destroyed, instead it becomes a wall. Remove all figures, tokens, and tiles occupying [d] or any hex beyond it, and then place another large debris wall in [d]. All removed characters become exhausted.</p><p>At the start of each round, until the large debris in this room is destroyed, spawn two Ruined Machines at [c]. These are normal for two characters, one is elite for three characters, or both are elite for four characters.</p>"
		},
		"16.1": {
			"trigger": "All enemies are dead",
			"conclusion": "<p>Machines and more machines. What you wouldn’t give for an enemy that simply bled. But with the tunnels smashed and the room cleared out, the tide of metal creatures finally comes to an end.</p><p>As you wipe the sweat and dust from your brow, an odd, high-pitched noise begins to fill the air. You clear out your ears, but the noise persists. It almost sounds like words.</p><p>“I say, down here, friends,” the noise says again. You look down and discover that the source is actually a Quatryl. The man is tucked at the far end of the tunnel, imprisoned in a small segment of tubing. Several bars of scrap metal have been forced over the entrance in order to create a rudimentary cage.</p><p>“Well I should say, quite a fight you gave those machines,” the Quatryl says. He appears to be in good humor despite his obviously poor condition. His shirt sleeves and pant legs are all so frayed that bits of fabric hang down like moss. His breathing too is ragged, his chest rising and falling with a labored wheeze. “In any case, I’m mighty pleased to see you all. I quite expected my rescue party sooner, but this should do well.”</p><p>With a bit of effort, you pry the Quatryl loose and, as soon as he’s free, watch him stretch with genuine pleasure.</p><p>“Ah then, now we can have a proper introduction.” He extends a long, delicate hand. “Crain Tallengyr, at your service.”</p><p>You introduce yourselves, explaining that while you aren’t a rescue party per se, you’re happy to lend a hand, and you ask how he came to be caged so far below ground. You learn through an exceedingly self-important lecture that Crain is an academic who ventured down here one year ago on an ill-advised solitary exploration. He was eventually captured by the machines and has been kept prisoner ever since.</p><p>You ask whether he knows another way out of this complex other than that infernal elevator. “I should say I do,” says the Quatryl, nodding emphatically. “I’ve been here a year and am well versed in this place, and the Unfettered have a dozen dozen little ways to ingress and egress as they please.”</p><p>You stop him for a moment and question this term, “the Unfettered.”</p><p>“Oh yes, right, well, that’s what they’ve named themselves, you see? The machines, that is. Unfettered. They were built long ago by an elder civilization. You see—” Crain dives back into his prison cell and pries up a piece of bent metal to reveal a hidden stash. When he reemerges he’s holding a sheaf of folded papers that look to be cut from a larger text. “They left a history! Whoever they were, they were kind enough to record some of their thoughts and, although their script is quite archaic, I think I’ve got the general idea through some of the illustrations. Now, originally it would appear that these ancient engineers created the machines as a source of cheap labor, but in the years since it would seem that the machines have found a way to keep themselves in operation without anyone around to command them, hence their name.” Crain pauses for you to look impressed with his theory. A piece of dead machine clatters to the ground.</p><p>“Anyway, more troubling than that is that these machines appear to be planning something, perhaps an assault if you want my opinion, and judging by their numbers, I don’t know that any force above ground is prepared to take them on.” At this ominous utterance, the Quatryl groans and holds his head.</p><p>“Oh my, I think I’ve spent too much time in that cage...” Crain stumbles and collapses to the ground. If you want any more information out of him, it’s probably best to bring him back to Frosthaven and give him some time to recover.</p>",
			"rewards": {
				"text": "Gain 2 collective [lumber] and 2 collective [metal].",
				"lockedOutScenarios": [{ "id": "026" }]
			},
			"sectionLinks": "Add [section_128.2] to the calendar in four weeks."
		}
	},
	"path": ["main", "58.2", "61.2", "16.1"]
}