{
	"id": "026",
	"name": "Quatryl Library",
	"questLine": "Unfettered",
	"coordinates": "E10",
	"unlockedBy": { "scenario": { "id": "016" }},
	"complexity": 2,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all enemies in it are dead. At the end of that round, read [section_24.1].",

	"sections": {
		"main": {
			"introduction": "<p>Turning away from the flickering red right, you opt to move in a direction slightly less ominous, though only slightly. You take the steel walkway through the open cavern. The ceiling is too high for you to see in the darkness and no creatures stir around you, but still the vastness of this place is a marvel in itself.</p><p>After a few minutes, you come to the entrance of a well-constructed tunnel. Its walls and ceiling are held back with thick metal trellises, hundreds of hexagonal beams coming together to form a heavy metal skeleton that, though well-forged, has succumbed to decades of rust. Wide leaves of corroded iron have begun to flake off in several places. You listen for any signs of activity, but there are none.</p><p>You continue moving and, after a long stretch of time, you spot a trace of light escaping from a nearby passage. Following it, you come to a library. It is a large rectangular room bordered on all sides with bookshelves sagging under the weight of their contents, and in the center of the room are several tables and chairs, all of them thick with dust and cobwebs.</p><p>But you are not alone. Shortly after you enter, you hear the hurried shuffling of metal feet. A line of security machines emerge from the far entry, weapons at the ready. They move with rigid certainty, their limbs exact and swift, specialized in seeking and destroying intruders like yourselves. Their focus, however, is only partly aimed at you. The majority of them are instead moving toward a pedestal in the center of the room. The pedestal is little more than a simple stone pillar, but atop it you can see a large steel pressure plate. You’re not sure what the plate does, but judging by how much attention the machines are paying it, you know it isn’t good.</p>",
			"specialRules": "<p>All Ruined Machines focus on moving toward and occupying the pressure plate, then find a focus as normal and perform any other abilities as if they had no movement. If they cannot find a path to the pressure plate, they will move to get as close as possible to it (as measured by range).</p><p>If any figure occupies the pressure plate, the scenario is lost. All characters and character summons cannot enter the hex with the pressure plate in any way.</p>",
			"sectionLinks": "At the start of the seventh round, read [section_131.4].",
			"containsImage": true,
			"unlockedSections": ["131.4", "24.1"]
		},
		"131.4": {
			"trigger": "Start of the seventh round",
			"text": "A pile of broken, battered machine parts is building up, but you continue to make sure the steel plate remains clear. You are hoping this ordeal is almost over when a new batch of spindly, persistent robots appears from around the bookshelves in the back of the room. These too seem annoyingly intent on reaching the plate.",
			"specialRules": "Spawn Ruined Machines as if the room were being set up again."
		},
		"24.1": {
			"trigger": "All enemies are dead",
			"conclusion": "<p>While destroying machines doesn’t quite provide the same satisfaction as, say, slaying monsters, there is a certain pleasure in returning the room to silence; libraries should be quiet, after all.</p><p>Looking around, you find that the room has held up better than you’d first thought. The shelves are packed with books, and many of them are still quite legible, though their pages are brittle to the touch. You while away some time browsing, and discover two particularly illuminating texts.</p><p>The first is an unusually shaped book, much taller and wider than the others. Taking it down, you find within it a complex series of diagrams—maps, you realize—that lay out a portion of this complex. You find the library, demarcated by a scribble of ink and, from the library, you can see two avenues branching outward: paths leading to what must be the central core of this place. The map shows an immense inkwork of intricate, almost knotlike design: thousands upon thousands of lines and shapes all leading toward some great labyrinthian chamber. You turn the page yet again and inside that chamber you find another, smaller room made in a triangular design. The script below the map is confusing, but it looks similar to the common word for ‘thought.’</p><p>The second book is even more helpful, though at first you take it for junk: the cover is dry, cracked leather, and half the pages have been cut out. The pages that remain offer only a dense, tight script written in a language far older than any spoken today. You are about to toss the book aside when a voice makes you freeze.</p><p>“I say, you’ve found one of my favorites there.”</p><p>You turn and find a Quatryl, short, dressed in rags, shuffling through the far door with a heavy ball and chain shackled to his ankle.</p><p>“Of course, I’ve borrowed the best section on something of a long-term loan,” the Quatryl laughs and fishes from his shirt a sheaf of folded paper. “I’ll let you read it if you get me out of this thing.”</p><p>You go to the Quatryl’s side and, with a bit of effort, help him out of his restraints. You learn that he is an academic named Crain Tallengyr who ventured down here one year ago on an ill-advised solitary exploration. He was eventually captured by the machines and has been kept prisoner ever since.</p><p>“They’re quite rude really, but they are an impressive force. Being their unwilling companion all this time, I have learned quite a bit about the Unfettered.”</p><p>You interrupt to ask about the name, ‘Unfettered.’</p><p>“Fascinating isn’t it? That’s what they’ve named themselves, these machines. A bit melodramatic if you ask me, but I suppose it fits. Their origins are actually hidden in that tome you were about to toss.” Crain unfolds his sheaf of papers and shows you more of the cramped, eye-glazing text. “The language is archaic, but I’ve been able to glean the general idea from the illustrations. I believe that these machines were once used as a source of cheap labor. To what end, I am less certain, but, as their name suggests, the Unfettered work for themselves now. More troubling, however, is that they appear to be planning something, perhaps an assault if you want my opinion, and judging by their numbers, I don’t know that any force aboveground is prepared to take them on. I believe therefore, that we, or rather you, may be the only party able to intervene in time. I can direct you toward their central chamber.”</p><p>There is no need for deliberation. Having fought what machines you have, you’re confident in Crain’s analysis: if you can stop the Unfettered from attacking the land above then you have to try. The only question then is how to proceed. Unfortunately, all this excitement has clearly caused the Quatryl some stress. He groans and holds his head.</p><p>“Oh my, I think I need to lie down for a bit...” Crain stumbles and collapses to the ground. If you want any more information out of him, it’s probably best to bring him back to Frosthaven and give him some time to recover.</p>",
			"rewards": {
				"text": "Gain 10 [xp] each.",
				"lockedOutScenarios": [{ "id": "025" }]
			},
			"sectionLinks": "Add [section_169.3] to the calendar in four weeks.",
			"lockedOutSections": ["131.4"]
		}
	},
	"path": ["main", "131.4", "24.1"]
}