{
	"id": "033",
	"name": "Thawed Wood",
	"questLine": "Lurker",
	"coordinates": "R2",
	"requirement": { "status": "Into the Forest" },
	"unlockedBy": { "section": { "id": "62.2" }},
	"complexity": 3,
	"location": "Radiant Forest",
	"goals": "The scenario is complete when three radiant stones have been found. At the end of that round, read [section] <strong>112.4</strong>.",

	"sections": {
		"main": {
			"introduction": "<p>The Radiant Forest: proof that map makers have a dark sense of humor. The forest, you find, is quite the opposite of radiant. Instead, it is an overgrown tangle of ancient trees and dense, knotted ivy. Each step you take is hard earned, requiring you to climb over slanted logs and higharching roots. What’s more, there is a particular weirdness suffusing this place. The creatures and insects chirp in foreign ways and even the ground feels somehow deranged, tilting at times, almost as if it’s bothered by your presence. And yet the strangest thing about this place is the air— it’s warm.</p><p>Not long after you enter, the snow gives way to lush green underbrush and you find yourself removing your furs to avoid overheating. It’s an oasis, a balmy island in an otherwise frozen wasteland, and so it should come as no surprise that the Radiant Forest is home to many creatures.</p><p>A dark blur whips toward you, razorsharp talons raking through the air. You dodge, more speeding shapes diving at you as you draw your weapons. You dive, and the attack pauses long enough for the aggressor to reveal itself. A lanky humanoid creature emerges from behind a tree. Its sinewy legs and arms are wrapped in dark-gray skin, and its upper body is covered in dozens of flapping black wings.</p><p>“Loud walkers, walking in my woods,” it says in a thin voice. “A meal for sharing and new skin to wear.”</p><p>Then the many birds perched on the creature’s waxy torso spread their wings and come at you.</p>",
			"sectionLinks": "When door [one] is opened, read [section] <strong>20.1</strong>."
		},
		"20.1": {
			"trigger": "Door [one] is opened",
			"text": "<p>Using the unnaturally warm air as a guide, you venture deep into the Radiant Forest, turning in whichever direction the heat is strongest, and you eventually arrive at a stone cave whose mouth radiates waves of dry heat.</p><p>Inside, the temperature is nearly unbearable. Each breath is like inhaling fresh steam. You cover your mouth and move quickly.</p><p>The rock itself is like a scorched kiln. The ground is cracked, broken into irregular scales like a dried-up mud flat in need of a flood, and walking on it makes you worry that your boots might melt.</p><p>Acting on a hunch, you pry up one of the scales and are rewarded with a burst of fire from below. That confirms it: the heat source is somewhere beneath the ground. You stumble back, blinking away the pain as a seething body claws itself out of the ground—a flame demon.</p><p>You draw your weapon as you realize the true danger of your task. You need to find the heat sources and extract enough of them for the Tinkerer to make your diving vessels... but there’s no knowing how many demons lie in wait.</p>",
			"specialRules": "<p>Randomly place one numbered token face-down in each [a]. These represent dowsing runes.</p><p>If any character enters a hex with a dowsing rune, reveal it. Spawn one Flame Demon at any adjacent empty hex if it is odd or one Earth Demon if it is even. These are normal for two characters, Earth Demons are elite for three characters, or both are elite for four characters.</p><p>A dowsing rune points to its own hex and all hexes on tile 16-B exactly [range] X from it, where X is half the value on the numbered token (rounded up). Any character occupying a hex that three or more dowsing runes point to may forgo at top action (discarding the card instead) to gain one radiant stone. If this occurs, remove any three dowsing runes that point to that hex from the map and place one of them on that character’s mat. Any character with a radiant stone adds [pierce] 3 to all their attacks.</p><p>Whenever any character starts their turn occupying a hex with a revealed dowsing rune, they may lose one card from their hand to move it to any adjacent featureless hex.</p><p>At the start of next round and each second round after that, spawn one normal Black Imp at [b] for two characters. For three or four characters, instead, at the start of each round, spawn one Black Imp at [b]. It is normal for three characters or elite for four characters.</p>"
		},
		"112.4": {
			"trigger": "Three radiant stones have been found",
			"conclusion": "<p>Working in the north for as long as you have, you’d think snow would be the last thing you’d want to see. And yet, here you are—drenched in sweat, flame coursing around you, and all you want is a nice, three-day blizzard. But you’ve found it— the last stone.</p><p>You cleave through the flame demons, snatch up the final orange rock, and dash free of the cave. The fresh air is incredible.</p><p>The demons, though fierce, do not give pursuit, and so, with your stash of heat stones now secure, you make your way gladly back to Frosthaven.</p>",
			"rewards": "<strong>Gain 5 [xp] each for each unrevealed dowsing rune.<br/>Gain “Ember Energy Source” [item].</strong>",
			"sectionLinks": "Add [section] <strong>135.1</strong> to the calendar in three weeks."
		}
	},
	"path": ["main", "20.1", "112.4"]
}