{
	"id": "036",
	"name": "Buried Ducts",
	"questLine": "Unfettered",
	"coordinates": "C9",
	"unlockedBy": { "section": { "id": "169.3" }},
	"complexity": 1,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all four doors have been destroyed and all monsters are dead. At the end of that round, read [section_118.1].",
	"effects": "Each character suffers [damage] 2.",

	"sections": {
		"main": {
			"introduction": "<p>You’ve been crawling for ages, stuffed together into a metal tube, inching toward a destination that you’re only moderately certain exists. You’ve opted for the less obvious route: sneaking through some tube in the ceiling in the hopes that you’ll avoid the machine guards. But now that you’re here, you wonder whether this was really the best choice.</p><p>The tube for one, was certainly not designed for this sort of thing. It’s cramped and whenever it rounds a corner, it does so at a painfully sharp angle that requires a fair bit of dexterity to maneuver. But despite all the trouble, you have managed to avoid getting into another fight. So you travel on, moving slowly, making a grudging peace with your decision. It’s only after a long while, when you stop to take a break, that you realize something is wrong.</p><p>A noise has begun to fill the tube, a rhythmic pounding that sounds like drums, coming from somewhere below. You close your eyes and try to focus but as you do another noise starts to grow: a soft creaking. That creaking turns into a loud groan and that turns into a sharp metallic cry as the tube beneath you suddenly gives way.</p><p>Limbs and gear and dust all plummet. You and the section of tube come crashing to the ground with a loud and painful bang.</p><p>You land without taking any real damage, but when you get to your feet, you realize the full depth of your new predicament. The noise from earlier wasn’t drums at all, but the marching feet of an entire garrison of machines. You managed to fall directly into their formation as they passed through a junction between two tunnels, and now the machines stand there, watching you.</p><p>As one, the garrison moves to attack. Blades and flames come to bear, and you quickly formulate a plan. The only good way out of here is back up through the ceiling, but you can’t do that with an army of machines on your back. You need to seal off the tunnels leading into this chamber and then dispatch the garrison of guards. Only then can you escape back into the tubes.</p>",
			"specialRules": "<p>Each door [a] to [d] has ((C-1)/2)x(L+3) hit points (rounded down). They are enemies to you and allies to all monsters.</p><p>At the start of each listed round, spawn the monsters indicated in the chart below, based on character count, at a door in the order: [a] in the second round, [b] in the third round, [c] in the fourth round, [d] in the fifth round, then repeat the cycle with [a] in the sixth round. Whenever any destroyed door would spawn monsters, no monsters spawn that round.</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>2, 5, 8, etc.</th><td>One elite Ruined Machine</td><td>One elite and two normal Ruined Machines</td><td>One elite and two normal Ruined Machines</td></tr><tr><th>3, 6, 9, etc.</th><td>One normal Robotic Boltshooter</td><td>One elite Robotic Boltshooter</td><td>One elite Robotic Boltshooter</td></tr><tr><th>4, 7, 10, etc.</th><td>One normal Flaming Bladespinner</td><td>One normal Flaming Bladespinner</td><td>Two normal Flaming Bladespinners</td></tr></tbody></table>",
			"containsImage": true
		},
		"118.1": {
			"trigger": "All four doors have been destroyed and all enemies are dead",
			"conclusion": "<p>There is good news and bad news. The good news is that, judging by the number of machines operating here, you’re nearing the center of the complex. The bad news is you have to get back in the tubes.</p><p>Still, it’s easier to climb knowing that the end is near. You hoist yourselves back up and continue on.</p><p>You crawl. You wriggle and scrape. Time stretches slower than you knew possible. After a while your arms begin to tire and you wish only for sunlight. Each time you turn a corner to find only more ventilation tube, your heart sinks.</p><p>You’re just about ready to give up entirely when a patch of light appears up ahead. You move faster, crawling out of a massive exhaust vent that opens onto a huge, echoing hall. This has to be the heart of the complex. The chamber is immense and filled with rows upon rows of hulking steel and iron machines: furnaces, arms, pistons, wire, and pipe. There is no doubt that this is the central chamber, and deep inside you can see its core: a raised platform overlooking the vast hall, and atop it, a single figure cloaked in shadow.</p>",
			"rewards": {
				"text": "Gain 3 collective [lumber] and 3 collective [metal].",
				"scenarios": [{ "id": "044", "forceLinked": true }],
				"lockedOutScenarios": [{ "id": "037" }]
			}
		}
	},
	"path": ["main", "118.1"]
}