{
	"id": "050",
	"name": "Explosive Descent",
	"questLine": "Lurker",
	"coordinates": "G1",
	"requirement": { "transport": "boat" },
	"unlockedBy": { "section": { "id": "168.2" }},
	"complexity": 2,
	"location": "Biting Sea",
	"goals": "The scenario is complete at the end of the twelfth round. At the end of that round, read [section_86.2].",
	"effects": "Each character adds three [minus1] cards to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>It turns out constructing a device to emit a psychic blast is quite a difficult process. But when it is done, you quickly realize that was only half the battle. Getting it safely to the bottom of the Biting Sea will be equally challenging, and that part is all up to you.</p><p>The device doesn’t look particularly impressive— most of its bulk is just a haphazard metal casing to weigh it down in the water— but Pinter assures you it will do the trick. Essentially, he explains, it is a very potent battery filled with energy that has been attuned to the psychic frequency of a coral shard. When detonated, the simple explosives around the battery will cause this energy to disperse in a powerful psychic wave, overloading the mind of anyone sensitive to it. He gives you a remote to set it off from a safe distance, but he doubts the Lurkers will let it get anywhere close to their base, so you’ll still have to escort the charge the whole way down.</p><p>So then, here you are, once again locked inside your submersible, sinking below the waves. You adjust much more quickly this time, and shortly after you take control of the bathysphere, the charge is lowered in next to you. Then the upper world vanishes as both you and the bomb plunge into the icy depths.</p><p>For a time, you simply watch the metal contraption through your hazy window. It moves slowly downward: a mangle of scrap metal and Quatryl ingenuity sinking lazily toward the ocean floor like a ruined ship heading for its final resting place.</p><p>Soon you see the vague outline of the Lurker structures appear. From this angle, they look like a great opened mouth: the ring of curved coral teeth sticking up from the sand, waiting for prey to wander inside. And then you see the Lurkers, a thick line of them moving upward— heading right for you.</p><p>They’ve detected your approach and are coming to stop you, a long string of red shells rising from the ocean floor. You must protect the device, because if it is lost, then all your efforts will be for nothing.</p>",
			"specialRules": "<p>Each non-Lurker character gains [curse] twice (this is not a scenario effect).</p><p>The metal cabinet is the pulse emitter. It is slowly descending and characters must keep pace with it. During their turn, each character can spend 1 movement point to keep pace. Otherwise, at the end of their turn, they gain [muddle].</p><p>The pulse emitter has 6+(3xL) hit points. It is neither an ally nor enemy to you and is an enemy to all monsters. Any character can lose one card from their hand or two from their discard pile to negate one source of damage to the pulse emitter. If the pulse emitter is destroyed or any character becomes exhausted, the scenario is lost.</p><p>All hexes in the scenario are treated as water hexes for the purposes of Lightning Eel summoning and movement.</p><p>At the start of each listed round, spawn the following monsters at the listed locations based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>2</th><td>[a]: One normal Lurker Wavethrower</td><td>[a] and [b]: One normal Lurker Wavethrower</td><td>[a] and [b]: One normal Lurker Wavethrower</td></tr><tr><th>3</th><td>[g]: One normal Lurker Wavethrower</td><td>[g]: One normal Lurker Wavethrower</td><td>[c] and [g]: One normal Lurker Wavethrower</td></tr><tr><th>4</th><td>[d]: One normal Lurker Mindsnipper</td><td>[c]: One normal Lurker Wavethrower<br/>[d]: One normal Lurker Mindsnipper</td><td>[d]: Two normal Lurker Mindsnippers</td></tr><tr><th>5</th><td>[e]: One normal Lightning Eel<br/>[g]: Two normal Lightning Eels</td><td>[e]: One elite Lightning Eel<br/>[g]: Two normal Lightning Eels</td><td>[e]: One elite Lightning Eel<br/>[g]: Two elite Lightning Eels</td></tr><tr><th>6</th><td>[f]: One normal Lurker Clawcrusher</td><td>[b]: One normal Lurker Wavethrower<br/>[f]: One normal Lurker Clawcrusher</td><td>[b] and [f]: One normal Lurker Clawcrusher</td></tr><tr><th>7</th><td>[a] and [b]: One normal Lurker Wavethrower</td><td>[a]: One normal Lurker Wavethrower<br/>[b]: One elite Lurker Wavethrower</td><td>[a] and [b]: One elite Lurker Wavethrower</td></tr><tr><th>8</th><td>[a]: One normal Lurker Wavethrower<br/>[g]: One normal Lurker Mindsnipper</td><td>[a]: One elite Lurker Wavethrower<br/>[g]: One elite Lurker Mindsnipper</td><td>[a]: One elite Lurker Wavethrower<br/>[g]: One elite Lurker Mindsnipper</td></tr><tr><th>9</th><td>[c]: One normal Lurker Clawcrusher<br/>[e]: One normal Lightning Eel</td><td>[c]: One normal Lurker Clawcrusher<br/>[e]: Three normal Lightning Eels</td><td>[c] and [d]: One normal Lurker Clawcrusher<br/>[e]: Two normal Lightning Eels</td></tr><tr><th>10</th><td>[f]: One elite Lurker Mindsnipper</td><td>[b]: One normal Lurker Mindsnipper<br/>[f]: One elite Lurker Mindsnipper</td><td>[b] and [f]: One elite Lurker Mindsnipper</td></tr><tr><th>11</th><td>[e]: One normal Lurker Wavethrower<br/>[g]: One normal Lurker Clawcrusher</td><td>[e]: One elite Lurker Wavethrower<br/>[g]: One normal Lurker Clawcrusher</td><td>[e]: One elite Lurker Wavethrower<br/>[g]: One elite Lurker Clawcrusher</td></tr></tbody></table>",
			"containsImage": true
		},
		"86.2": {
			"trigger": "End of the twelfth round",
			"conclusion": "<p>You’ll give the Lurkers credit: they’ve fought as hard as anyone could hope, but there was nothing that could have stopped this.</p><p>You wait until it is inevitable— until there is nothing the Lurkers can do to stop the device from reaching its target, and then you turn and slam open the throttle. Your bathysphere shakes violently, and the engine screams as you count to five and then press the detonator. Soon after, the shockwave hits.</p><p>It is a bizarre feeling, having your brain so overwhelmed with the desire to find the shards that you almost pass out. But you hold on to your consciousness and then turn around to collect what you came for.</p><p>Navigating back to the Lurker settlement, you pass the Lurkers that were chasing you, now blasted into unconsciousness. The seafloor at the epicenter swept with debris: coral structures knocked clean over; great boulders cracked and strewn about like pebbles, and you can feel the shard pulling you toward it. Underneath this carnage lies your quarry.</p>",
			"rewards": {
				"text": "Lose 2 inspiration.<br/>Gain 4 collective [lumber] and 4 collective [metal].",
				"scenarios": [{ "id": "054", "forceLinked": true }]
			}
		}
	},
	"path": ["main", "86.2"]
}