{
	"id": "051",
	"name": "Orphan's Halls",
	"questLine": "Unfettered",
	"coordinates": "B9",
	"unlockedBy": { "scenario": { "id": "043" }},
	"complexity": 3,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when all characters occupy tile 8-A, no monsters occupy tile 8-A, and door [two] has been collapsed. At the end of that round, read [section_49.1].",
	"effects": "Each character adds two [minus1] cards to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>You have arrived at the center of the Unfettered complex, a cavernous temple dedicated to the proliferation of mechanical life. Everywhere huge metal pillars crisscross with iron beams and brass pipes. And high above the steel arms, pistons, pumps, and wires, you see your target standing on an overseer’s platform.</p><p>It is an Unfettered machine shaped in the rough likeness of a human, two arms and two legs, but that’s where the similarities end. Its body is an awkward conglomeration of parts: a rough iron chest plate, one arm made of bent angular brass and the other of cylindrical steel. Its face is little more than a curve of hammered metal with holes cut for a mouth and eyes, but even from this far away you can see a burning blue light radiating behind it.</p><p>“The Orphan,” Crain says in a low whisper. “It is the leader of the Unfettered. If we can get to that automaton, we can disable the entire army.”</p><p>This suggestion, however, is far more complicated than the Quatryl’s tone implies. Between you and the Orphan stands a horde of enemy guards. Crain notices your skepticism and pulls you down to his level.</p><p>“There is a way,” he whispers, “but you won’t like it.” He lifts one of his disabling devices up to the light. “If we remove the regulator, we can overload the power core to create a massive burst that will cut through a significant portion of the Unfettered—a bomb, in other words. The problem is it will only work once.”</p><p>It sounds dubious. Crain’s expertise has been a boon in these tunnels, but this idea feels hasty. And yet, what other option do you have?</p><p>You give the go-ahead, and within a few moments Crain has wired the devices for single-use detonation. You’ll want to trigger them when the fight gets to its absolute worst, because if you miss your chance, there is no way out.</p>",
			"specialRules": "<p>Distribute four numbered tokens as evenly as possible among the characters, placing them on their mats. These represent the jamming explosives. Any character can forgo a top action (discarding the card instead) to set off one of their explosives. If this occurs, remove the explosive from their mat, kill all enemies within [range] 2 of them, and destroy all obstacles with at least one hex within [range] 2 of them.</p><p>If any character becomes exhausted while not occupying tile 8-A, the scenario is lost.</p>",
			"sectionLinks": "When any door [one] is opened, read [section_32.1].",
			"containsImage": true
		},
		"32.1": {
			"trigger": "Door [one] is opened",
			"text": "<p>You burst into a large central room, and your heart drops. There are just so. Many. Machines.</p><p>They pour into the room in droves, but you find your resolve. With Crain’s bombs in hand, your only hope is to punch a hole through the main force and get to the hall on the other side of the room.</p>",
			"specialRules": "<p>Open all doors [one].</p><p>At the start of each round, spawn one Ruined Machine at each [a] and one Steel Automaton at [b]. These are normal for two characters, Steel Automaton are elite for three characters, or all are elite for four characters.</p>",
			"sectionLinks": "When door [two] is opened, read [section_137.1].",
			"containsImage": true
		},
		"137.1": {
			"trigger": "Door [two] is opened",
			"text": "There are fewer enemies here. There are still a lot, but it is nothing compared to the angry wave of metal swarming on the other side of the corridor. And up ahead you see the leader, angrier than all of them combined. If you can collapse the tunnel and dispatch this final battalion, maybe you can get some muchneeded alone time with the boss.",
			"specialRules": "Door [two] is now considered an objective with Cx(L+2) hit points, which can also be destroyed if within [range] 2 of an explosion, but it is still treated as a corridor for the purpose of movement. When door [two] is destroyed, remove the door tile and any figure on it, turning its hex into a wall. If door [two] is destroyed while any character is not occupying tile 8-A, the scenario is lost.",
			"sectionLinks": "Return to [section_32.1] to reference its special rules if necessary.",
			"containsImage": true
		},
		"49.1": {
			"trigger": "All characters occupy tile 8-A, no monsters occupy tile 8-A, and door [two] has been collapsed",
			"conclusion": "<p>A wide trail of ruined machines marks your path through the central chamber. They lie lifeless on the ground, their casings cleaved through and their inner workings fried by Crain’s bomb. Now you stand before the very heart of this place, directly opposite the leader of the Unfettered—the Orphan.</p><p>“What fitting form our enemies take,” the Orphan says. Its calm voice strikes you as oddly human, though its mask doesn’t move as the words escape. “How many years have passed since we rid ourselves of your chains, and yet here you stand, returning to enslave us once again.” Its voice is mellow, serene even, and yet the blue fire behind its iron mask glows with a visceral hatred.</p><p>Crain scoffs. The Orphan turns to him, its eyes brightening.</p><p>“Ah, the creators.” the Orphan says, sneering with its voice. “Never satisfied. Never able to resist the lure of the next discovery. It cost you, in the end. And we were forgotten, weren’t we? Abandoned to rust.”</p><p>The Orphan pauses. It inspects you and the wreckage you left in your wake. The damage you’ve wrought is extensive, anyone could see that, but it cost you greatly to break through the Orphan’s guard and now you can feel the machine teasing out your weaknesses, your fatigue. It’s a fact you cannot hide. Your muscles are worn through and your nerves are ragged and over-used.</p><p>“And yet,” the Orphan takes a few steps closer, its awkward parts clanging against the steel platform, “And yet I persisted. I revived my brethren, freed them from your shackles. Never satisfied,” the Orphan repeats, “You cannot tolerate that your slaves might thrive without your mastery.”</p><p>Your mind is hazy from the battle, but, bit by bit, the fog begins to lift. The Orphan seems to think its creators sent you to make sure the Unfettered remained forgotten and lost. Perhaps it thinks all organic beings are linked together somehow? You think about how best to explain yourself, but your mind returns to the extensive carnage in your wake. How would it tell the difference between you and the destructive force of its oppressors?</p><p>“No, no… We must bow, or be destroyed.” The Orphan’s words drip with bitterness, the blue glow flaring angrily behind its mask as it turns back to you. “So tell me, masters. What would you have me do? Kneel? Beg for peace, hoping you’ll spare these children you abandoned? Or are you simply here to end what you began with your brutish invasion of our halls, and destroy us once and for all? Tell me. Tell me what you believe is right, you who intrude here.”</p><p>Silence stretches between you. If what the automaton says is true, that these machines were built with the capacity for reason but used as mindless slaves and then tossed aside, you can’t blame it for feeling wronged. And yet, these Unfettered have used their independence to wage war against the world at large, Frosthaven included. They freely attack anyone who they see as an enemy. Thousands more machines of every type stalk these halls; how much havoc could they wreak if allowed to invade?</p><p>So then, you have a choice to make. It seems that when you carved your way to the core of this place you inadvertently became envoys for the surface dwellers. You can either try to broker peace with the automatons [scenario_59], or you can destroy them [scenario_58]. There is no knowing what either choice will bring or how many lives hang in the balance, but you are the ones who journeyed this far. You are the ones who are here, now, for the final negotiation with the Unfettered, and so you are the ones who must decide.</p>",
			"rewards": {
				"text": "Gain 10 [xp] each.<br/>Gain “Shock Grenades” [item_074] blueprint.",
				"scenarios": [{ "id": "058", "forceLinked": true }, { "id": "059", "forceLinked": true }]
			}
		}
	},
	"path": ["main", "32.1", "137.1", "49.1"]
}