{
	"id": "059",
	"name": "Automaton Uprising",
	"questLine": "Unfettered",
	"coordinates": "A11",
	"unlockedBy": [{ "scenario": { "id": "044" }}, { "scenario": { "id": "051" }}],
	"complexity": 2,
	"location": "Crystal Fields",
	"goals": "The scenario is complete when the control console on tile 15-D has five damage tokens on it. At the end of that round, read [section_62.1].",

	"sections": {
		"main": {
			"introduction": "<p>“Peace?” The Orphan says, its voice incredulous. “Peace?”</p><p>It turns and looks back at what you’ve done, at the ruined machines left in your wake and the injuries you yourself have suffered to come here. You can understand the sentiment; you’re a little surprised yourself. Here you were at the brink of war, the destruction of all the Unfettered within your grasp, and you laid down your sword. So you explain how you arrived at the decision. You tell of your time here in the north. You tell of the freezing expeditions, fierce battles and brutal attacks, of the memories that follow you now. Then you describe Frosthaven: this hopeful town perched on the edge of the world and how hard you and everyone there have fought and worked and died to keep that hope alive.</p><p>As you speak, something dawns on the Orphan. You see it in the machine’s mannerisms, how it nods slowly and lowers its arms. It understands. These obstacles that you’ve overcome, the anguish that you’ve endured, the Orphan has felt those same things. You aren’t sure when, but at some point, you find yourself speaking not with an enemy but with a fellow pilgrim, fighting in an unforgiving world.</p><p>When you finish, the Orphan takes a moment to consider. When it speaks again, it does so with warmth.</p><p>“Life is not so gentle a thing, is it?” The Orphan says. It shakes its head, a small concession to the immense burden it has endured over all these years. It turns back to you, the blue light behind its eyes softening.</p><p>“Perhaps,” it says, “we have misjudged each other. Perhaps the world is not the same as it once was. You struggle here, just like us, and perhaps the answer is not to destroy, but to work together.”</p><p>The Orphan turns and gestures for you to follow. “Come,” it says, “we must tell the others.”</p><p>Together you move through a side passage and enter a series of triangular chambers filled with great towers of black steel and flashing lights.</p><p>“If we are to have peace,” the Orphan calls back, “I must issue a new proclamation to the Unfettered.” The automaton moves to the base of a tower and opens up a small compartment, revealing a complex web of cords and buttons. “But be forewarned: I can entreat, but I cannot command. Each Unfettered has a mind of its own, and each chooses for itself whether to accept my decision.”</p><p>The Orphan manipulates the control tower, its fingers clicking over the row of buttons, and after a moment the tower itself shifts. The lights that weave in and out of its steel façade flicker, changing from red to green like distant stars—except a few of them do not.</p><p>“As I suspected,” the Orphan says with some darkness in its voice. Almost on cue, you hear the sound of machines marching, and a moment later, a line of heavy Unfettered barge into the triangular chamber: hulking steel automatons, their fists already clenched.</p><p>“My personal guard,” the Orphan says. “They will never accept peace, I’m afraid. They will try to destroy both of us now. Quickly, we must move to the other towers and send the message to the rest of the Unfettered. If enough of them take up our call, we might stand a chance.”</p><p>Surrounded, you face a row of solid steel. The Orphan’s private guard are huge, well-built machines, their joints hissing as they bring their massive limbs to bear, but still you must hold them back. The Orphan needs time to send out the new orders, because without them, none of you will get out alive.</p>",
			"specialRules": "<p>Doors [one] are locked.</p><p>The Orphan [a] is an ally to you and an enemy to all other monsters. Do not set up its stat card or the Boss monster ability deck. Instead, it has (L+C)x2 hit points. On initiative 01 each round, it performs [move] 3, controlled by you. Any character can lose one card from their hand or two from their discard pile to negate one source of damage to the Orphan. If the Orphan dies, the scenario is lost.</p><p>Whenever the Orphan ends its turn adjacent to any control console, place one damage token on that console.</p><p>At the start of each listed round, spawn the following monsters at the listed locations based on the character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>3, 9</th><td>[b] and [d]: One normal Flaming Bladespinner</td><td>[b]: One normal Flaming Bladespinner<br/>[d]: One elite Flaming Bladespinner</td><td>[b] and [d]: One elite Flaming Bladespinner</td></tr><tr><th>4, 10</th><td>[c] and [e]: One normal Robotic Boltshooter</td><td>[c]: One normal Robotic Boltshooter<br/>[e]: One elite Robotic Boltshooter</td><td>[c] and [e]: One elite Robotic Boltshooter</td></tr><tr><th>5, 7</th><td>Two normal Ruined Machines at any starting hex</td><td>One normal and one elite Ruined Machine at any starting hex</td><td>Two elite Ruined Machines at any starting hex</td></tr><tr><th>11</th><td>Two normal Flaming Bladespinners at any starting hex</td><td>One normal and one elite Flaming Bladespinner at any starting hex</td><td>Two elite Flaming Bladespinners at any starting hex</td></tr><tr><th>12, 13, 14, etc.</th><td>[b], [c], [d], and [e]: One normal Ruined Machine</td><td>[b] and [d]: One normal Ruined Machine<br/>[c] and [e]: One elite Ruined Machine</td><td>[b], [c], [d], and [e]: One elite Ruined Machine</td></tr></tbody></table>",
			"sectionLinks": "When both revealed control consoles have three damage tokens on them, read [section_121.1].",
			"containsImage": true
		},
		"121.1": {
			"trigger": "Both revealed control consoles have three damage tokens on them",
			"text": "<p>The waves come and you strike them down. You heave yourselves up, muscles drawn and wasted, pulling at the very dregs of your being, and you swing, dropping more and more machines. But still they come.</p><p>The doors to the final tower fall open. Just a little longer.</p>",
			"specialRules": "Open all doors [one].",
			"containsImage": true
		},
		"62.1": {
			"trigger": "The control console on tile 15-D has five damage tokens on it",
			"conclusion": "<p>The Unfettered will never tire. Their bodies will never feel pain. They will come at you as long as they draw power, but you cannot wait. Already your limbs are heavy, and sweat stings your eyes. You back up and hit a wall, and there is nowhere else to go. The machines are closing in. Then a shout.</p><p>“It is done!” The Orphan says. The moment hangs. Nothing appears to have changed, and yet the steel golems do not advance. You wipe the sweat and blood from your eyes, confused. Then the guard closest to you shudders, and that’s when you see it: the blade piercing through its chassis.</p><p>The other Unfettered have come to your defense. Waves of injured and mismatched automatons burst through the door and drag down their steely siblings, like a storm crashing over a sandcastle.</p><p>Within seconds, the fight is over. The room is reduced to a heap of broken machinery and a new army, loyal and at the ready. One of them, a large, barrel-chested automaton, lifts the Orphan and brings it over, and you understand how close you came to death.</p><p>The Orphan’s legs are broken and its chest is cratered. It took a terrible beating, but somehow it managed to stay alive long enough to finish its work.</p><p>“We’ve done it,” the Orphan says, the light behind its face blooming like a rising flame. “I asked them for peace. I asked them to join me, all of them. To give up this fighting and work together with those above. This is their choice. The Unfettered choose peace.”</p><p>It takes several days to recover from the battle. The Unfettered aid you as best they can, though hospitality is clearly a skill the machines have not practiced. Eventually you make your way out of the complex and back to Frosthaven.</p><p>When you arrive at the outpost, you are not alone. Instead you come surrounded by a retinue of figures draped in thick cloaks, their long armored legs jutting down into the snow.</p><p>One of the guards atop the gate shouts down, asking who goes there, but rather than answering yourself, you allow someone else to speak up.</p><p>“Allies,” the Orphan shouts and peels back its hood. “Allies come to your aid.”</p>",
			"rewards": {
				"text": "<p>Gain 2 morale and 2 prosperity.<br/>Gain “Key Card” [item_246].<br/>Unlock [hive] class box.<br/>Gain “Unfettered Allies” campaign sticker.<br/>Remove all unfettered events from all outpost event decks.</p><p>Add one +50 card to the town guard deck.</p>",
				"events": {
					"SO": [{ "id": "SO-49" }],
					"WO": [{ "id": "WO-63" }]
				},
				"lockedOutScenarios": [{ "id": "058" }]
			}
		}
	},
	"path": ["main", "121.1", "62.1"]
}