{
	"id": "060",
	"name": "Uniting the Crown",
	"questLine": "Lurker",
	"coordinates": "G2",
	"requirement": { "transport": "boat", "status": "6 Coral Shards" },
	"unlockedBy": { "scenario": { "id": "053" }},
	"complexity": 2,
	"location": "Biting Sea",
	"goals": "The scenario is complete when the Fracture of the Deep is dead. At the end of that round, read [section_10.1].",
	"effects": "Each character adds three [minus1] cards to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>The dome hangs in your submersible’s window: a great sunken moon. The image of it has followed you for months. Ever since your first vision back on the jagged shoals you’ve been bombarded by flashes of this place, and now you’re here. The shards of the crown are secure in the hold and the end to all of this is within your sight.</p><p>You approach carefully, hoping to avoid detection, and with a bit of luck you manage to make it inside without drawing any attention to yourselves. The dome is abandoned. Rocks are strewn about and broken coral litters the ground. No one has entered this place in many years—a temple scorned by its own parishioners—but that works to your advantage.</p><p>You pilot your way over to the pedestal, finding it in the same poor condition as the rest of the structure. Sickly brown plants have adhered themselves to its sides and a few branches of stony coral have begun to grow around its base.</p><p>Working together, you draw each shard from the external hold and place them on the pedestal. It’s a delicate process. You must fit each piece together, being sure not to damage them with the bathyspheres’ clumsy controls. The air is getting muggy, and you distantly recognize that you’ll need to resurface soon. But this will only take a moment longer. The crown is almost back in one piece; the shards are joined so they form two parts of a whole and then, with your breath held, you ease the two halves together.</p><p>But no.</p><p>The shards, nearly reunited, are suddenly wrenched apart and the water wobbles like a warped mirror. You reach out to grab at them but a wave of energy pushes you back, shaking your vessel violently. Then you watch as all six shards lift up from the pedestal and six Lurkers appear behind them.</p><p>These are spiny, ethereal figures: Lurkers of a sort you’ve not seen before. Their bodies are a murky fog, shades of some ancient time, brought here through some twisted magic.</p><p>Sudden flashes of anger and hatred cloud your mind as a Lurker presence invades it. It shows you the coral crown in an underwater palace, a king ascending the throne. It is the same vision Sun in Shallows shared with you when you met, but you feel no reverence or longing for this bygone era. There is only jealousy and rage.</p><p>When the cloud of darkness comes, you see a figure within it. You are the figure, so full of loathing for the king. You made the seas safe. Your great military prowess has brought peace to the many warring clutches. And yet he gets the power, the recognition. You reject the king and his crown. You will take it all back by force.</p><p>The last memory is the crown shattering. A shockwave envelopes you—consumes you—tying your destructive will inexorably to the shards.</p><p>The vision fades from your mind, but the dark presence does not leave your sight. He now stands before you, flanked by his six ethereal lieutenants who now hold the shards. The hateful apparition steps forward on crooked limbs—a giant of immense proportions, a shrouded usurper dredged from the very bottom of the abyss. He means to prevent you from reuniting the crown—to bury all of you and the shards beneath the waves. You deploy your bathysphere’s suits and prepare to defend yourselves.</p>",
			"specialRules": "<p>Each non-Lurker character gains [curse] twice (this is not a scenario effect).</p><p>All hexes in the scenario are treated as water hexes for the purposes of Lightning Eel summoning and movement.</p><p>All six Lurkers on tiles 13-B and 13-D are Fractured Lieutenants and add +1 [attack] to all their attacks. Place one element token on each one as depicted. Any element on a lieutenant cannot be infused. When any lieutenant dies, the character who killed it, or any character closest to the lieutenant if no character killed it, places one numbered token on their mat. This represents a coral shard. In addition, place that lieutenant’s element token in the strong column of the element board. It is now always treated as strong.</p><p>For each crystal shard a character has on their mat, they add a cumulative +1 [attack] to one of their attacks each turn targeting non-boss enemies. At the start of any character’s turn, they can give any number of their crystal shards to an adjacent character. If a character with crystal shards becomes exhausted, the shards are given to the closest character.</p><p>The Fracture of the Deep is immune to all conditions and damage at this time.</p>",
			"bossSpecials": {
				"1": "<p>The Fracture of the Deep performs:<br/>[push] 1, [target] all, [range] 1<br/>[consumeIce][consumeWild][consumeWild]: Summon one Lurker Clawcrusher<br/>[consumeDark][consumeWild][consumeWild]: Summon one Lurker Mindsnipper</p><p>Any summoned Lurker Clawcrushers or Lurker Mindsnippers are normal for two characters, Lurker Clawcrushers are elite for three characters, or both are elite for four characters.</p>",
				"2": "<p>The Fracture of the Deep performs:<br/>[move] +0 ([consumeAir]: [jump])<br/>[attack] +0 ([consumeFire]: +C [attack])<br/>[consumeLight][consumeWild][consumeWild]: Summon one Lurker Wavethrower</p><p>Any summoned Lurker Wavethrowers are normal for two or three characters, or elite for four characters.</p>"
			},
			"sectionLinks": "When one character has all six numbered tokens on their mat, read [section_115.4].",
			"containsImage": true
		},
		"115.4": {
			"trigger": "One character has all six numbered tokens on their mat",
			"text": "<p>A blur of darkness and a screech. Another phantom Lurker falls, black ichor bursting from his body. That makes six. The Lurkers, which had only a moment ago been vicious knots of carapace and shadow, are dead, which leaves only the would-be king.</p><p>He does not shy away, this abyssal lord. His eyes, two obsidian orbs, look down on you with bottomless hate.</p>",
			"specialRules": "Any character with all six coral shards on their mat can now damage and apply conditions to the Fracture of the Deep. This includes damage from negative hexes if the character performs a forced movement ability."
		},
		"10.1": {
			"trigger": "The Fracture of the Deep is dead",
			"conclusion": "<p>Your vessels are battered beyond reason; onboard lights flicker nervously and your viewing ports are cracked. But you’re alive, and you have the final shard.</p><p>You waste no time. Back at the altar, you carefully arrange the shards as you had just a few moments ago. Your breathing is shallow; the air is wearing thin. You know you should head back to the surface, but you can’t leave now—the shards won’t allow it. They compel you to finish what you started.</p><p>The pieces move together in the dimness, one snapping into the next until finally there are only two halves. And there, at the bottom of the ocean, your hearts thumping, you bring the final pieces together.</p><p>Light. A painful bloom of white and gold. The shards, which a moment ago were little more than chunks of coral, are transformed into a curve of golden brilliance—the crown. It’s just how you remember it from your visions: a radiant circlet of light and power, an exultant beacon for a new age. It radiates with light and fills the dome with a marigold brilliance.</p><p>It doesn’t take long for the Lurkers to respond. They arrive in droves, first hesitating at the dome’s entrance, shying from the source of this incredible shine but then their courage returns, and they fill the chamber in earnest. Thousands arrive, called to the rebirth of their empire. A great procession fills the dome, plugging every exit with chitinous limbs and excited chitters.</p><p>A tall Lurker appears at the far entrance of the dome, shuffling forward as the gathered crowd parts to make way. To your surprise, you recognize Sun in Shallows, the Lurker with whom you began this quest. But this creature has been ravaged since then; war, it seems, has taken a great toll. Two of the Lurker’s legs are missing, and one of her eyes is sealed permanently shut. Scars and gouges mark its shell, wounds from countless battles, and yet Sun in Shallows trudges forward all the same, using her claws to keep balance.</p><p>When she reaches you, she stands on the opposite side of the pedestal and repeats the mental echo greeting she first hailed you with so long ago. The crowd echoes back, an eerie keening symphony that swells with anticipation as Sun in Shallows lifts the crown.</p><p>At once, she is transformed. The light that radiated throughout the dome cascades downward and infuses itself into the wearer of the crown. The Lurker is imbued, rising with new strength. The light pours onto the wearer and etches elaborate designs into its shell: intricate golden filigree interlocking to form a great tapestry of a regal tattoo, each line shining like the morning sun.</p><p>The coronation complete, the Lurker queen turns to you. Her vision comes to you clearly, powerful with intent: A new age of enlightenment has begun for the Lurkers, and with it unity and peace between the people of the sea and the coastal settlements of land-dwellers. Gratitude suffuses the vision, warm and joyful. You have returned to the Lurkers their greatest treasure, and with it their hope. The vision fades, and Sun in Shallows presents her claws and bows deeply in a display of respect. The water around you dances as the gathered crowd snap their claws in celebration.</p><p>The feeling of gratitude remains with you as you journey back to the surface and rejoin your crew, leaving the Lurkers beneath the waves to rebuild their empire.</p><p>The ship’s mate charts a course back home, and you regale the crew with the tale of your journey beneath the waves. It’s a harrowing story, and yet as you tell and retell it in the weeks that follow, you always leave one part unsaid. It’s a feeling that’s followed you ever since you resurfaced, and it only intensifies as you approach Frosthaven and put more and more distance between yourselves and the Lurker city. You weren’t sure what it was at first, but now, after several long nights of rumination, of staring out at the moonlit waves, you are certain. It’s a haunting desire, a hunger to own something you can never have—it is the deep, unrelenting pull of the crown.</p>",
			"rewards": {
				"text": "<p>Gain 2 morale and 1 prosperity.<br/>Gain 30 [xp] each.<br/>Unlock whichever class box is still locked: [crashingtide] or [deepwraith].<br/>Gain “Crown Reunited” campaign sticker.<br/>Remove all lurker events from all outpost event decks.</p><p>Add one +50 card to the town guard deck.</p>",
				"events": {
					"B": [{ "id": "B-17" }],
					"SO": [{ "id": "SO-48" }]
				}
			}
		}
	},
	"path": ["main", "115.4", "10.1"]
}