{
	"id": "102",
	"name": "Into the Black",
	"questLine": "JobPosting",
	"coordinates": "R7",
	"unlockedBy": { "scenario": { "id": "101" }},
	"complexity": 3,
	"location": "Imperial Mountains",
	"goals": "The scenario is complete when the Savvas Icestorm is dead. At the end of that round, read [section_142.3].",
	"effects": "Each character adds one [minus1] card to their attack modifier deck.",

	"sections": {
		"main": {
			"introduction": "<p>You find Bartlet, the last surviving member of Gem’s mercenary group, slumped in the corner of an unassuming cave, right where Zu said. The mood is more somber and less celebratory than you expected.</p><p>Gem strokes her hand over Bartlet’s unconscious forehead. “A Savvas is granted all the life it will ever have the day it’s born under the Copperneck Mountains. From then forward, their lives have a finite energy, and when they take their last step, they return to being just the rocks they once were.” She taps her finger against Bartlet’s forehead, but there’s no response.</p><p>“Oh sure, they can top off some dribs and drabs by eating some rocks, but the reality is that every step they take, every spell they cast, every word they speak—it marches them closer to the end of their lives. Macabre, really. Could you imagine? Knowing you have just a hundred fifty years, give or take, and everything you do counts against it? That’s why a Savvas’s life is so focused, they know they have to make the most of the little time they have.”</p><p>Gem stops for a moment, and when she continues speaking, there’s a line of wetness under her eyes. “By that same token, if a Savvas were to just stop moving, to think no more thoughts, and just settle where it sat… well, it could live for a very long time. And I can think of no Savvas that would want more to never think again than poor Bartlet. It’s a kind of torture, really. To live with just the faintest trickle of a thought, knowing that your guilt is your only companion.” Gem pauses for a long time, unsure if she should continue.</p><p>“I told you we used to adventure together. Zu, Barlet, and I. But there was a fourth... what you today call a Lurker. Ripple was the best of us. We took a job, and we chose... the wrong path. We were manipulated, and it wound up with Ripple dead and the rest of us outlaws. We couldn’t show our faces anywhere. Zu was imprisoned, and I hid. Bartlet... poor, sweet Bartlet just gave up. Exiled itself. Wandered into the mountains and sat down here. I’ve been searching for my old friend ever since.”</p><p>The Harrower, Zu, bows their head. “And what now thattt we have found our companionnn? There cannot be much life leffft in Bartlet at all... it hasss been too long.”</p><p>Gem reaches out one of her hands and extends a crystalline finger. She places it gently, delicately against the temple of the resting Savaas, and then with surprising strength pushes her long, sharp digit into the creature’s skull until her finger is embedded down to the knuckle.</p><p>“What now? Now they go in and put its mind to rest. Find the Savvas in there and help it move on.” She looks back at you, all business, and encourages you to hold one of the sharp crystal protrusions on her back. “What are you waiting for? Grab on.” You pick one that seems stable enough—and just like that, it’s done.</p>",
			"specialRules": "<p>Any character may spend 1 movement point to place one 1-hex corridor or ice tile adjacent and connected to the map such that it is within [range] 3 of them. These tiles represent new hexes, which increase the overall map size. All tiles placed in this way are considered corridors. As new hexes are added, consolidate existing 1-hex tiles into 2-hex tiles, if necessary. The border around the map is not considered a wall line at any time, and range can be counted across gaps in the map.</p><p>Set the numbered tokens next to the map. Use the round track to track the number of new hexes added to the map. Whenever each fifth hex is placed, reset the track and consult the appropriate chart:</p><table class=\"table\"><thead><tr><th>Hexes</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>5</th><td>Place one numbered token in the newest hex.</td><td>Place one numbered token in the newest hex.</td><td>Place one numbered token in the newest hex.</td></tr><tr><th>10</th><td>Spawn one normal Night Demon at the newest hex and one elite Chaos Demon at the numbered token.</td><td>Spawn one normal Night Demon at the newest hex and one elite Chaos Demon at the numbered token.</td><td>Spawn one normal Night Demon at the newest hex.</td></tr><tr><th>15</th><td>Place one numbered token in the newest hex, then spawn one normal Night Demon at each numbered token.</td><td>Spawn one elite Living Spirit at the newest hex and one normal Living Spirit at the numbered token.</td><td>Spawn one normal Night Demon at the newest hex and one elite Chaos Demon at the numbered token.</td></tr><tr><th>20</th><td>Spawn one normal Living Spirit at the newest hex, then place one treasure tile (numbered 85) in either numbered token.</td><td>Place one numbered token in the newest hex, then spawn one elite Night Demon at either numbered token.</td><td>Spawn one elite Living Spirit at the newest hex and one normal Living Spirit at the numbered token.</td></tr><tr><th>25</th><td>Spawn one elite Savvas Icestorm at the newest hex and one normal Chaos Demon at either numbered token.</td><td>Spawn one normal Living Spirit at the newest hex and one normal Night Demon at either numbered token, then place one treasure tile (numbered 85) in the other numbered token.</td><td>Place one numbered token in the newest hex, then spawn one normal Night Demon at either numbered token.</td></tr><tr><th>30</th><td>Spawn one normal Night Demon at both numbered tokens.</td><td>Spawn one elite Savvas Icestorm at the newest hex.</td><td>Spawn one normal Chaos Demon at the newest hex and one normal Night Demon at both numbered tokens.</td></tr><tr><th>35</th><td>Place one treasure tile (numbered 57) in the newest hex.</td><td>Spawn one normal Chaos Demon, one elite Living Spirit, and one elite Night Demon at any starting hex.</td><td>Spawn one normal Living Spirit at the newest hex, and place one treasure tile (numbered 85) in either numbered token.</td></tr><tr><th>40</th><td><hr></td><td>Place one treasure tile (numbered 57) in the newest hex.</td><td>Spawn one elite Savvas Icestorm at the newest hex and one normal Chaos Demon at either numbered token.</td></tr><tr><th>45</th><td><hr></td><td><hr></td><td>Place one numbered token in the newest hex and spawn one normal Chaos Demon, one elite Living Spirit, and one elite Night Demon at any starting hex.</td></tr><tr><th>50</th><td><hr></td><td><hr></td><td>Spawn one normal Night Demon at each numbered token.</td></tr><tr><th>55</th><td><hr></td><td><hr></td><td>Place one treasure tile (numbered 57) in the newest hex.</td></tr></tbody></table>"
		},
		"142.3": {
			"trigger": "The Savvas Icestorm is dead",
			"conclusion": "<p>You feel the world stretch to impossible heights, and with a snap of clarity you’re sitting back in the cave with Gem and Zu. Mental travel is exhausting.</p><p>Gem retracts her fingertip from Bartlet’s head. “You did well. I can feel Barlet shifting… there is a peace there that did not exist before. Thank you. It’s good to see mercenaries bettering the world— don’t ever let anyone convince you that you aren’t enough.”</p><p>The old Orchid crosses her legs and sits beside her old Savvas companion. She looks up at the Harrower. “Zu, would you care to sit with me for a while?”</p><p>The Harrower shifts protectively beside her. “It turnsss out we havveee no otherrr plansss.”</p>",
			"rewards": {
				"text": "Gain 20 [xp] each."
			}
		}
	},
	"path": ["main", "142.3"]
}