{
	"id": "114",
	"name": "Work Freeze",
	"questLine": "Other",
	"coordinates": "O7",
	"unlockedBy": { "section": { "id": "156.1" }},
	"complexity": 2,
	"goals": "The scenario is complete when C+4 ice pillars have been destroyed. At the end of that round, read [section_125.3].",

	"sections": {
		"main": {
			"introduction": "<p>Pinter Droman’s explosives are surprisingly light. You hike up the pass to the demolition site, where the enthusiastic tinkerer hopes to create a new shortcut on the road over the mountains. You head to the spot marked on the map, where you find a natural stone plateau that could indeed lend itself to wagon travel... were it not for the heap of fresh landslide rubble perched directly in the path.</p><p>You drop your packs of explosive charges and begin to loosen the straps, but a howl interrupts your work. A pack of wolves poke their heads out of hiding, and a polar bear emerges from behind a large boulder. You were warned about the aggressive wildlife in the area—this is why you were chosen for the task, after all—but as more and more animals appear, you realize there’s no end in sight; you’ll have to do your work while fighting off the locals.</p><p>Luckily, you figure the explosives you brought will work just as well on beasts as they do on rocks.</p>",
			"specialRules": "<p>Doors [one] are locked.</p><p>Each ice pillar in the scenario has (Lx2)+2 hit points and [shield] L/2 (rounded up). They are enemies to you and allies to all monsters.</p><p>Set the numbered tokens next to the map. These represent detonation charges. Any character occupying or adjacent to any [a] can forgo a top or bottom action (discarding the card instead) to gain one detonation charge and place it on their character mat. Each character can only carry one detonation charge at any time.</p><p>Any character can drop a detonation charge at any time during their turn (including during movement), placing it in an adjacent empty hex. Whenever any detonation charge is dropped, it cannot be picked up again.</p><p>All hexes with dropped charges are considered negative hexes. They can be targeted by character attacks and can be affected by abilities that cause enemies to suffer damage. If a dropped charge suffers any damage or any figure enters its hex, the charge detonates, causing all figures and objectives occupying or adjacent to its hex to suffer [damage] (Lx2)+4. A carried charge will also detonate in a character’s hex if the character carrying it suffers any damage from attacks.</p><p>At the start of each listed round, spawn the following monsters at the listed locations based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>2, 4, 6, etc.</th><td>[c]: One normal Hound</td><td>[c]: One elite Hound</td><td>[c]: One normal Polar Bear</td></tr><tr><th>3, 5, 7, etc.</th><td>[d]: One normal Snow Imp</td><td>[d]: One elite Snow Imp</td><td>[d]: One normal and one elite Snow Imp</td></tr></tbody></table>",
			"sectionLinks": "When both ice pillars [b] have been destroyed, read [section_159.1].",
			"containsImage": true
		},
		"159.1": {
			"trigger": "Both ice pillars [b] have been destroyed",
			"text": "Explosions echo off the hills, and the mountainside shifts under the force. A stream of rock and slag slides down into the ravine below. You’re just about to congratulate yourself when the mountain’s surface buckles and collapses as well, revealing a natural cavern that had been buried beneath the rock. More creatures pour from the cave, intent on making a fresh meal out of you.",
			"specialRules": "<p>Open all doors [one].</p><p>From now on, all monsters that would spawn at [c] instead spawn at [e], and all monsters that would spawn at [d] instead spawn at [f].</p>",
			"containsImage": true
		},
		"125.3": {
			"trigger": "C+4 ice pillars have been destroyed",
			"conclusion": "<p>“Marvelous! Outstanding! Oh, it’s beautiful!” Pinter Droman stands at the site with a work crew behind him. “I couldn’t have hoped for a better result!”</p><p>The tinkerer gushes like this for a while, racing around gleefully to inspect the stability of various parts of the site, which is now a mostly clear slab of flat rock connecting the two sides of the valley. “We’ll need to dig quite a bit to make it ready, of course, but no need to concern yourselves there. I’ll be certain to send for you when we reach the next phase!”</p>",
			"rewards": {
				"text": "Gain 5 collective [hide]."
			},
			"sectionLinks": "Add [section_86.1] to the calendar in four weeks."
		}
	},
	"path": ["main", "159.1", "125.3"]
}