{
	"id": "115",
	"name": "Pylon Problems",
	"questLine": "Other",
	"coordinates": "O8",
	"unlockedBy": { "section": { "id": "86.1" }},
	"complexity": 2,
	"goals": "The scenario is complete at the end of the tenth round. At the end of that round, read [section_33.4]",

	"sections": {
		"main": {
			"introduction": "<p>You’re not sure what kind of desperate merchant would want to take this route, but you have to admire the beauty of the place as you hike the pristine wilderness path meant to become a shortcut through the Frozen Pass. The “road” is barely wide enough for a single wagon, but Pinter Droman’s construction crew has done an admirable job of making the way passable, if still dangerous.</p><p>At last, you arrive at your destination. The cleared road hugs a tight curve around the base of a cliff, over which hangs a precipitous rocky ledge that threatens to collapse on any traveler foolhardy enough to pass underneath.</p><p>Droman sent you here to protect his crew’s work: a half-dozen or so metal pylons that stretch up from the ground to support the ledge and make the road passable. You understand now why the tinkerer sent you; it’s clear that losing any of the rickety structures could trigger a collapse that would require weeks to dig out. You’re meant to repel any attack by a local group of Algox raiders, the Horns of Ruin, who have taken offense to the new highway cutting through the mountains.</p><p>You don’t have to wait long. As the rest of the area comes into view, a group of Algox appear from around the cliff base, equipped for both combat and demolition. It seems their goal is to make the road impassable for the traveling merchants that Satha says are Frosthaven’s lifeline in the summertime.</p><p>You draw your weapons. It’s time to teach the Algox how to share the road.</p>",
			"specialRules": "<p>Each ice pillar has L+3 hit points. They are enemies to both you and all monsters. All character summons cannot focus on ice pillars.</p><p>Whenever any ice pillar would be destroyed, it is instead replaced with rubble, and all figures in adjacent hexes suffer trap damage. If all seven ice pillars have been replaced, the scenario is lost.</p><p>At the start of each listed round, spawn the following monsters at the listed locations based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>5</th><td>Each [a] and [b]: One normal Algox Guard</td><td>Each [a]: One normal Algox Guard<br/>Each [b]: One elite Algox Guard</td><td>Each [a] and [b]: One elite Algox Guard</td></tr><tr><th>8</th><td>Each [a]: One normal Algox Snowspeaker<br/>Each [b]: Two normal Snow Imps</td><td>Each [a]: One elite Algox Snowspeaker<br/>Each [b]: Two normal Snow Imps</td><td>Each [a]: One elite Algox Snowspeaker<br/>Each [b]: Two elite Snow Imps</td></tr></tbody></table>",
			"containsImage": true
		},
		"33.4": {
			"trigger": "End of the tenth round",
			"conclusion": "With the Algox raiders defeated, Droman says he can clean up the rubble and reinforce the remaining pylons to be much sturdier. This was the final obstacle stopping traffic through the shortcut; if there’s still time in the season after Droman’s crew finishes cleanup, Satha might be able to send for a caravan of much-needed resources.",
			"rewards": {
				"text": "Gain 15 [xp] each."
			},
			"sectionLinks": "Add [section_66.2] to the calendar in X+1 weeks, where X is the number of pylons destroyed."
		}
	},
	"path": ["main", "33.4"]
}