{
	"id": "116",
	"name": "Caravan Guards",
	"questLine": "Other",
	"coordinates": "O8",
	"unlockedBy": { "section": { "id": "66.2" }},
	"complexity": 2,
	"goals": "The scenario is complete when all five wagons have either escaped or been destroyed. At the end of that round, read [section_141.2].",

	"sections": {
		"main": {
			"introduction": "<p>Pinter Droman paces excitedly. He is always a font of energy, but today his fidgeting is especially enthusiastic. “When do you think they’ll be here?”</p><p>He’s asked the same question every hour since you stomped out your campfire’s embers in the dawn light. Today is the grand opening of Droman’s Path—the first time the new shortcut through the Frozen Pass will be used by merchants bound for Frosthaven. After months of preparation, engineering, and backbreaking labor, the shortcut promising easier access—and thus, prosperity for Frosthaven—is finally ready. Satha insisted on you being here when the first wagons rolled through, and you felt honored when you first set out, but now, as you wait for the caravan to arrive, your patience with Droman’s inexhaustible excitement is starting to wear thin.</p><p>You turn to answer his question for the umpteenth time, but your response is cut off by the snap of a twig from somewhere down the path. Droman jumps to attention. “Was that them?” He runs off around a bend in the path, waving his arms in greeting. “Hello! Hello, welcome!” No sooner is he out of sight than a series of mighty roars ring out and the excitable tinkerer reappears, sprinting back toward you.</p><p>“Not them! That is NOT them!” Droman cries, running past you and cowering behind a boulder.</p><p>An Algox appears from around the bend, followed by others, all armed to the teeth. The Horns of Ruin are back. Of course; it wouldn’t be a highway if you didn’t have highwaymen. You draw your weapon, but just then you hear the unmistakable crunch of hooves and wheels—the caravan has arrived. The Algox hear it too and split up, some turning to waylay the caravan while the others prepare to stop any rescue you might attempt. This grand opening just got more interesting.</p>",
			"specialRules": "<p>All dungeon and cave corridor tiles represent the road.</p><p>At the start of each of the first five rounds, place one numbered token in [a]. These represent caravan wagons, allies to you and enemies to all monsters. Each has (Cx2)+L hit points and is immune to all conditions and forced movement.</p><p>On initiative 50 each round, all wagons, in right-to-left order, perform [move] 3, focusing on moving toward and occupying [b]. Wagons can only enter road hexes, but can enter occupied hexes and hexes with obstacles. If any wagon enters an occupied hex, the figure in the hex suffers trap damage and is placed in the closest empty non-road hex. If any wagon enters a hex with an obstacle, the obstacle is destroyed, and the wagon suffers trap damage. All other overlay tiles do not affect wagons in any way.</p><p>At the end of every round, if any wagon occupies [b], it escapes and is removed from the map. If all five wagons have been destroyed, the scenario is lost.</p><p>At the start of each listed round, spawn the following monsters at the listed locations based on character count:</p><table class=\"table\"><thead><tr><th>Round</th><th>Two Characters</th><th>Three Characters</th><th>Four Characters</th></tr></thead><tbody><tr><th>3</th><td>Each [c]: One normal Algox Icespeaker</td><td>Each [c]: One normal Algox Icespeaker<br/>Each [d]: One elite Algox Archer</td><td>Each [c]: One elite Algox Icespeaker<br/>Each [d]: One normal Algox Archer</td></tr><tr><th>6</th><td>Each [c]: One normal Algox Archer<br/>Each [d]: One normal Algox Icespeaker</td><td>Each [c]: One normal Algox Archer<br/>Each [d]: One normal Algox Icespeaker and one normal Algox Guard</td><td>Each [c]: One elite Algox Archer<br/>Each [d]: One normal Algox Icespeaker and one normal Algox Guard</td></tr></tbody></table>",
			"containsImage": true
		},
		"141.2": {
			"trigger": "All five wagons have either escaped or been destroyed",
			"conclusion": "<p>“That was close!” Pinter Droman exclaims, climbing down from his hiding place in a nearby tree. The remaining merchants have circled their wagons up in a small clearing off the path, trying to calm their frightened draft animals before continuing.</p><p>You look back up at Droman’s Path, the project that carries much of Frosthaven’s hope for supplies and survival this winter. Despite all the weeks of planning and effort, it very nearly became Droman’s Grave. If Frosthaven is to keep this shortcut open, it’ll need better security. You make a note to tell Satha to set up patrols.</p><p>The tinkerer’s voice interrupts your thoughts as he chatters away at one of the surviving merchants. “Yes, yes, but other than that,” you hear him say, “How did you like the path?”</p>",
			"rewards": {
				"text": "<p>Gain rewards based on the number of wagons that escaped. All rewards are cumulative.</p><p>1: <span class=\"fw-normal\">Gain 1 morale.</span></p><p>2: <span class=\"fw-normal\">Gain 1 collective [lumber], 1 collective [metal], and 1 collective [hide].</span></p><p>3: <span class=\"fw-normal\">Gain any 2 material resources each and 10 [xp] each.</span></p><p>4: <span class=\"fw-normal\">Gain one random item blueprint.</span></p><p>5: <span class=\"fw-normal\">Gain 1 prosperity and 2 morale.</span></p>"
			}
		}
	},
	"path": ["main", "141.2"]
}